#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AndroidFileServer

#include "Basic.hpp"

#include "AndroidFileServer_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AndroidFileServer.AndroidFileServerBPLibrary.IsFileServerRunning
// 0x0001 (0x0001 - 0x0000)
struct AndroidFileServerBPLibrary_IsFileServerRunning final
{
public:
	EAFSActiveType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AndroidFileServerBPLibrary_IsFileServerRunning;

// Function AndroidFileServer.AndroidFileServerBPLibrary.StartFileServer
// 0x000C (0x000C - 0x0000)
struct AndroidFileServerBPLibrary_StartFileServer final
{
public:
	bool                                          bUSB;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNetwork;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Port;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AndroidFileServerBPLibrary_StartFileServer;

// Function AndroidFileServer.AndroidFileServerBPLibrary.StopFileServer
// 0x0003 (0x0003 - 0x0000)
struct AndroidFileServerBPLibrary_StopFileServer final
{
public:
	bool                                          bUSB;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNetwork;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AndroidFileServerBPLibrary_StopFileServer;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
