#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Animnotify_PlayfootSteps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Animnotify_PlayfootSteps.Animnotify_PlayfootSteps_C
// 0x0030 (0x0068 - 0x0038)
class UAnimnotify_PlayfootSteps_C final : public UAnimNotify
{
public:
	class FName                                   FootBoneName;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FootStepSoundPreset_C*              Preset;                                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        UnderDistance;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceSphereSize;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebugDraw;                                       // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReportNoiseRange;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp_Received_Notify, class UAnimSequenceBase* Animation_Received_Notify, const struct FAnimNotifyEventReference& EventReference_Received_Notify) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Animnotify_PlayfootSteps_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Animnotify_PlayfootSteps_C")
	}
	static class UAnimnotify_PlayfootSteps_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimnotify_PlayfootSteps_C>();
	}
};
DUMPER7_ASSERTS_UAnimnotify_PlayfootSteps_C;

SDK_NAMESPACE_END
