#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANT_AttackNotify

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass ANT_AttackNotify.ANT_AttackNotify_C
// 0x0030 (0x0068 - 0x0038)
class UANT_AttackNotify_C final : public UAnimNotify
{
public:
	bool                                          CollisionReset;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeRange;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttackName;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageMultiply;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mutiple_Hit_Possible;                              // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Stan_Damage_Multiply;                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp_Received_Notify, class UAnimSequenceBase* Animation_Received_Notify, const struct FAnimNotifyEventReference& EventReference_Received_Notify) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANT_AttackNotify_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANT_AttackNotify_C")
	}
	static class UANT_AttackNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANT_AttackNotify_C>();
	}
};
DUMPER7_ASSERTS_UANT_AttackNotify_C;

SDK_NAMESPACE_END
