#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"

#include "AsyncLoadingScreen_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


SDK_NAMESPACE_START

// Class AsyncLoadingScreen.AsyncLoadingScreenLibrary
// 0x0000 (0x0028 - 0x0028)
class UAsyncLoadingScreenLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetIsEnableLoadingScreen();
	static void SetDisplayBackgroundIndex(int32 BackgroundIndex);
	static void SetDisplayMovieIndex(int32 MovieIndex);
	static void SetDisplayTipTextIndex(int32 TipTextIndex);
	static void SetEnableLoadingScreen(bool bIsEnableLoadingScreen);
	static void StopLoadingScreen();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncLoadingScreenLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncLoadingScreenLibrary")
	}
	static class UAsyncLoadingScreenLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncLoadingScreenLibrary>();
	}
};
DUMPER7_ASSERTS_UAsyncLoadingScreenLibrary;

// Class AsyncLoadingScreen.LoadingScreenSettings
// 0x0F28 (0x0F60 - 0x0038)
class ULoadingScreenSettings final : public UDeveloperSettings
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALoadingScreenSettings                StartupLoadingScreen;                              // 0x0040(0x04C0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FALoadingScreenSettings                DefaultLoadingScreen;                              // 0x0500(0x04C0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FClassicLayoutSettings                 Classic;                                           // 0x09C0(0x00D0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FCenterLayoutSettings                  Center;                                            // 0x0A90(0x00D0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FLetterboxLayoutSettings               Letterbox;                                         // 0x0B60(0x0190)(Edit, Config, NativeAccessSpecifierPublic)
	struct FSidebarLayoutSettings                 Sidebar;                                           // 0x0CF0(0x00E0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FDualSidebarLayoutSettings             DualSidebar;                                       // 0x0DD0(0x0190)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoadingScreenSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadingScreenSettings")
	}
	static class ULoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenSettings>();
	}
};
DUMPER7_ASSERTS_ULoadingScreenSettings;

SDK_NAMESPACE_END
