#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.GetIsEnableLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadingScreenLibrary_GetIsEnableLoadingScreen;

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayBackgroundIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex final
{
public:
	int32                                         BackgroundIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex;

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayMovieIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayMovieIndex final
{
public:
	int32                                         MovieIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadingScreenLibrary_SetDisplayMovieIndex;

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetDisplayTipTextIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayTipTextIndex final
{
public:
	int32                                         TipTextIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadingScreenLibrary_SetDisplayTipTextIndex;

// Function AsyncLoadingScreen.AsyncLoadingScreenLibrary.SetEnableLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct AsyncLoadingScreenLibrary_SetEnableLoadingScreen final
{
public:
	bool                                          bIsEnableLoadingScreen;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncLoadingScreenLibrary_SetEnableLoadingScreen;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
