#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BGM_Manager

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_BGM_Manager.BP_BGM_Manager_C.OnRep_CurrentBGM
// 0x0030 (0x0030 - 0x0000)
struct BP_BGM_Manager_C_OnRep_CurrentBGM final
{
public:
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USoundCue*                              CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BGM_Manager_C_OnRep_CurrentBGM;

// Function BP_BGM_Manager.BP_BGM_Manager_C.ExecuteUbergraph_BP_BGM_Manager
// 0x0004 (0x0004 - 0x0000)
struct BP_BGM_Manager_C_ExecuteUbergraph_BP_BGM_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BGM_Manager_C_ExecuteUbergraph_BP_BGM_Manager;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
