#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CopyActorBase

#include "Basic.hpp"

#include "EN_DamageType_structs.hpp"
#include "ST_VAT_Datas_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_EnablePotoIn_Base_classes.hpp"
#include "EN_StanType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CopyActorBase.BP_CopyActorBase_C
// 0x0070 (0x0460 - 0x03F0)
class ABP_CopyActorBase_C : public ABP_EnablePotoIn_Base_C
{
public:
	uint8                                         Pad_3E6[0x2];                                      // 0x03E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CopyActorBase_C;                 // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DeleteVATAnim_Time_9C40C62540CE68DAE57FCAA1FB62D81A; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DeleteVATAnim__Direction_9C40C62540CE68DAE57FCAA1FB62D81A; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DeleteVATAnim;                                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_VAT_Datas                          Voxel_Base;                                        // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FST_VAT_Datas                          Voxel_Copy;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FST_VAT_Datas                          Voxel_Delete;                                      // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OverrideScale;                                     // 0x0438(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CopiedStaticMeshComponent;                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DeleteDynamicMaterialInstance;                     // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CopyActorBase(int32 EntryPoint);
	void Fix();
	void Delete();
	void Reverse(const struct FTransform& NewPosition_Reverse, const struct FVector& HitNormal_Reverse);
	void DamageToPlayerController(class AActor* TargetActor, double DamageValue, int32 TeamIndex, EN_DamageType DamageType, const struct FTransform& SourceAgentPoint, bool UnAvoidable, class FName DamageName, const struct FHitResult& HitRezult, class AActor* SourceActor);
	void StaminaDamage(double Value);
	void StanDamage(EN_StanType StanType);
	void DeleteVATAnim__UpdateFunc();
	void DeleteVATAnim__FinishedFunc();
	void UserConstructionScript();
	void GetCopyClass(class UStaticMeshComponent* CentorComponent_GetCopyClass, class UClass** Class_GetCopyClass_0, double* Scale_GetCopyClass, struct FVector* DefaultScale_GetCopyClass);
	void Damage(double DamageValue, int32 TeamIndex, EN_DamageType DamageType, const struct FTransform& SourceAgentPoint, bool UnAvoidable, class FName DamageName, class AActor* SourceActor, struct FFinishFilter* Finish);
	void GetParryState(bool* State);
	void ReceiveBeginPlay();
	void DestroyVAT();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CopyActorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CopyActorBase_C")
	}
	static class ABP_CopyActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CopyActorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_CopyActorBase_C;

SDK_NAMESPACE_END
