#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrouchingCheck

#include "Basic.hpp"

#include "Mover_structs.hpp"
#include "PenguinHotel_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_CrouchingCheck.BP_CrouchingCheck_C.Trigger
// 0x0120 (0x0120 - 0x0000)
struct BP_CrouchingCheck_C_Trigger final
{
public:
	struct FSimulationTickParams                  Params_Trigger;                                    // 0x0000(0x0120)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_CrouchingCheck_C_Trigger;

// Function BP_CrouchingCheck.BP_CrouchingCheck_C.ExecuteUbergraph_BP_CrouchingCheck
// 0x0128 (0x0128 - 0x0000)
struct BP_CrouchingCheck_C_ExecuteUbergraph_BP_CrouchingCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimulationTickParams                  K2Node_Event_Params;                               // 0x0008(0x0120)(ConstParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_CrouchingCheck_C_ExecuteUbergraph_BP_CrouchingCheck;

// Function BP_CrouchingCheck.BP_CrouchingCheck_C.Evaluate
// 0x0228 (0x0228 - 0x0000)
struct BP_CrouchingCheck_C_Evaluate final
{
public:
	struct FSimulationTickParams                  Params_Evaluate;                                   // 0x0000(0x0120)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FTransitionEvalResult                  ReturnValue_Evaluate;                              // 0x0120(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
	const class UStanceSettings*                  CallFunc_FindSharedSettings_BP_ReturnValue;        // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetDataFromCollection_DidSucceed;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMyClimbingInputBatch                  CallFunc_K2_GetDataFromCollection_TargetAsRawBytes; // 0x0138(0x00A0)(ConstParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GetMoverComp_C>   K2Node_DynamicCast_AsBPI_Get_Mover_Comp;           // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMoverComponent*               CallFunc_GetCharacterMoverComp_CharacterMoverComponent; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CrouchingCheck_C_Evaluate;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
