#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CraftedObject_GiftBox_2

#include "Basic.hpp"

#include "EN_DamageType_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_CraftedObject_Base_classes.hpp"
#include "ENUM_ItemBindType_structs.hpp"
#include "ENUM_ClassType_structs.hpp"
#include "ENUM_HandType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CraftedObject_GiftBox_2.BP_CraftedObject_GiftBox_2_C
// 0x0090 (0x03E0 - 0x0350)
class ABP_CraftedObject_GiftBox_2_C final : public ABP_CraftedObject_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CraftedObject_GiftBox_2_C;       // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DefaultTransform;                                  // 0x0370(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverrideMass;                                      // 0x03D0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnRep_OverrideMass();
	void IsChangeImage(bool* IsInteract_IsChangeImage, class FText* OverrideText_IsChangeImage);
	void GetItemInfo(ENUM_HandType* HandType_GetItemInfo, ENUM_ClassType* ClassType_GetItemInfo, bool* NotPickUp_GetItemInfo, struct FRotator* HaveRotation_GetItemInfo, struct FVector* Add_Position_GetItemInfo, bool* IsBoneAttach_GetItemInfo, ENUM_ItemBindType* BindType_GetItemInfo, class FName* BoneName_GetItemInfo, struct FST_ItemCoreDatas* CoreDatas_GetItemInfo);
	void ExecuteUbergraph_BP_CraftedObject_GiftBox_2(int32 EntryPoint);
	void Damage(double DamageValue_Damage, int32 TeamIndex_Damage, EN_DamageType DamageType_Damage, const struct FTransform& SourceAgentPoint_Damage, bool UnAvoidable_Damage, class FName DamageName_Damage, class AActor* SourceActor_Damage, struct FFinishFilter* Finish_Damage);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CraftedObject_GiftBox_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CraftedObject_GiftBox_2_C")
	}
	static class ABP_CraftedObject_GiftBox_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CraftedObject_GiftBox_2_C>();
	}
};
DUMPER7_ASSERTS_ABP_CraftedObject_GiftBox_2_C;

SDK_NAMESPACE_END
