#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathSplash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PenguinHotel_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_DeathSplash.BP_DeathSplash_C
// 0x0038 (0x02E0 - 0x02A8)
class ABP_DeathSplash_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPaintMaterialPattern>          PaintMaterialPatterns;                             // 0x02B8(0x0010)(Edit, BlueprintVisible, Net, RepNotify, ExposeOnSpawn)
	struct FRandomStream                          RandomStream;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	TArray<struct FHitResult>                     Out_Hits;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ReceiveBeginPlay();
	void PaintSpawn();
	void OnRep_PaintMaterialPatterns();
	void ExecuteUbergraph_BP_DeathSplash(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DeathSplash_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DeathSplash_C")
	}
	static class ABP_DeathSplash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathSplash_C>();
	}
};
DUMPER7_ASSERTS_ABP_DeathSplash_C;

SDK_NAMESPACE_END
