#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnablePotoIn_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ENUM_ActorType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_HandType_structs.hpp"
#include "HitMaterial_structs.hpp"
#include "ENUM_ItemBindType_structs.hpp"
#include "ENUM_ClassType_structs.hpp"
#include "ENUM_CameraMode_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_EnablePotoIn_Base.BP_EnablePotoIn_Base_C
// 0x0148 (0x03F0 - 0x02A8)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) ABP_EnablePotoIn_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    RayPoint_Sub_2;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_RayPositions_C*                    BPC_RayPositions;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CollisionSound_C*                  BPC_CollisionSound;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RayPoint_Sub_1;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RayPoint_Centor;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DefaultTransform;                                  // 0x02E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalizeScale;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Not_Shot;                                          // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultHeight;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeDiff;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotPickUp;                                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReverseTime;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FirstTransform;                                    // 0x0370(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHitMaterial                                  ActorMaterial;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AfterAngulerDumping;                               // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioOff;                                          // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ActorType                                ActorDefaultType;                                  // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FullRandomRotation;                                // 0x03E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InPhoto;                                           // 0x03E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeStopState;                                     // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTimeStop;                                    // 0x03E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EnablePotoIn_Base(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason_ReceiveEndPlay);
	void SetMeshDatas(bool KeepScale);
	void InteractItem();
	void PickState(bool State, class ABP_FirstPersonCharacter_Main_C* Character, int32 SlotIndex);
	void UpdateCoreDatas(const struct FST_ItemCoreDatas& CoreDatas);
	void DropItem(const struct FVector& Force_Vector, const struct FVector& CentorPosition);
	void SetActorInfo(const struct FVector& ToPosition, class USceneComponent* Comp);
	void SetTimeStopState(bool State);
	void ReceiveBeginPlay();
	void Delete();
	void BndEvt__BP_EnablePotoIn_Base_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Fix();
	void InAngleOfView(bool InState, double DeltaTime, ENUM_CameraMode CameraMode);
	void ReceiveDestroyed();
	void View_In_Out_Function(int32 Stencil_Value);
	void Reverse(const struct FTransform& NewPosition, const struct FVector& HitNormal);
	void UserConstructionScript();
	void ReverseFunc();
	void InPhotoFunc();
	void SetScaleValues();
	void GetItemInfo(ENUM_HandType* HandType, ENUM_ClassType* ClassType, bool* NotPickUp, struct FRotator* HaveRotation, struct FVector* Add_Position, bool* IsBoneAttach, ENUM_ItemBindType* BindType, class FName* BoneName, struct FST_ItemCoreDatas* CoreDatas);
	void GetParentCharacter(class ABP_FirstPersonCharacter_Main_C** FirstpersonCharacter);
	void GetActorInfo(struct FTransform* DefaultTransform, bool* Not_In_Shot, struct FVector* CentorPosition, bool* IsPenguin, ENUM_ActorType* ActorType, bool* NonInPhoto);
	void GetCentorPosition(TArray<struct FVector>* CentorPosition);
	void GetCopyClass(class UStaticMeshComponent* CentorComponent, class UClass** Class_0, double* Scale, struct FVector* DefaultScale);
	void IsChangeImage(bool* IsInteract, class FText* OverrideText);
	void IsInPhoto(bool* Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EnablePotoIn_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EnablePotoIn_Base_C")
	}
	static class ABP_EnablePotoIn_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnablePotoIn_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_EnablePotoIn_Base_C;

SDK_NAMESPACE_END
