#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ElectricFan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CopyActorBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_ElectricFan.BP_ElectricFan_C
// 0x0070 (0x04D0 - 0x0460)
class ABP_ElectricFan_C final : public ABP_CopyActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ElectricFan_C;                   // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ElectricFan_Base_mesh;                             // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Multimedia_Internet_CD_Rom_Flash_Click_Multiple_18; // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      N_WindTrail;                                       // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WindRadius;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        WindLength;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindPower;                                         // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ParentActor;                                       // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NonParent;                                         // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxSpeed;                                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitDistance;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWindTrailSize(double Distance);
	void SetTimeStopState(bool State_SetTimeStopState);
	void ReceiveBeginPlay();
	void MaxSpeedControl(class AActor* TargetActor, double* MultiplyPower);
	double GetAttenuation(const struct FVector& v1, double power);
	void ExecuteUbergraph_BP_ElectricFan(int32 EntryPoint);
	void DestroyVAT();
	void Check();
	void BehindCheck(const struct FVector& B, bool* IsBehind);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ElectricFan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ElectricFan_C")
	}
	static class ABP_ElectricFan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ElectricFan_C>();
	}
};
DUMPER7_ASSERTS_ABP_ElectricFan_C;

SDK_NAMESPACE_END
