#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirstPersonCharacter_cLeon_Character_Hunter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_FirstPersonCharacter_cLeon_Character_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_FirstPersonCharacter_cLeon_Character_Hunter.BP_FirstPersonCharacter_cLeon_Character_Hunter_C
// 0x00D0 (0x0D70 - 0x0CA0)
class ABP_FirstPersonCharacter_cLeon_Character_Hunter_C final : public ABP_FirstPersonCharacter_cLeon_Character_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FirstPersonCharacter_cLeon_Character_Hunter_C; // 0x0CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        GunTop1;                                           // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LocalViewBody;                                     // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   crown;                                             // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GunTop;                                            // 0x0CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Gun1;                                              // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   gun;                                               // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StandRelativeCameraLocation;                       // 0x0CE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GunCoolTime;                                       // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_FirstPersonPlayerState_C*>   FoundTargetPlayerState;                            // 0x0D00(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TMap<class ABP_FirstPersonPlayerState_Online_cLeon_C*, int32> SendTargetInView;                  // 0x0D10(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               LocalTarget;                                       // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SpawnShotEffect_Server_(const struct FVector& Endpoint, bool IsHit, const struct FRotator& HitRotation, int32 Seed);
	void SpawnShotEffect_Local_(const struct FVector& Endpoint, bool IsHit, const struct FRotator& HitRotation, int32 Seed);
	void SpawnShotEffect_Client_(const struct FVector& Endpoint, bool IsHit, const struct FRotator& HitRotation, int32 Seed);
	void ShowCrown();
	void SendToView();
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void ReceiveBeginPlay();
	void PlayerControllerSetup();
	void OnRep_FoundTargetPlayerState();
	void OnNotifyEnd_B6C494744BD8085F199D4791408CEB6E(class FName NotifyName);
	void OnNotifyEnd_85995EF044945821EC08CDAD261FDD89(class FName NotifyName);
	void OnNotifyEnd_53A71DDF483CC968C1A61DAF788E875A(class FName NotifyName);
	void OnNotifyEnd_12AC243E438FB95C3F7F978927A1E9CD(class FName NotifyName);
	void OnNotifyBegin_B6C494744BD8085F199D4791408CEB6E(class FName NotifyName);
	void OnNotifyBegin_85995EF044945821EC08CDAD261FDD89(class FName NotifyName);
	void OnNotifyBegin_53A71DDF483CC968C1A61DAF788E875A(class FName NotifyName);
	void OnNotifyBegin_12AC243E438FB95C3F7F978927A1E9CD(class FName NotifyName);
	void OnInterrupted_B6C494744BD8085F199D4791408CEB6E(class FName NotifyName);
	void OnInterrupted_85995EF044945821EC08CDAD261FDD89(class FName NotifyName);
	void OnInterrupted_53A71DDF483CC968C1A61DAF788E875A(class FName NotifyName);
	void OnInterrupted_12AC243E438FB95C3F7F978927A1E9CD(class FName NotifyName);
	void OnCompleted_B6C494744BD8085F199D4791408CEB6E(class FName NotifyName);
	void OnCompleted_85995EF044945821EC08CDAD261FDD89(class FName NotifyName);
	void OnCompleted_53A71DDF483CC968C1A61DAF788E875A(class FName NotifyName);
	void OnCompleted_12AC243E438FB95C3F7F978927A1E9CD(class FName NotifyName);
	void OnBlendOut_B6C494744BD8085F199D4791408CEB6E(class FName NotifyName);
	void OnBlendOut_85995EF044945821EC08CDAD261FDD89(class FName NotifyName);
	void OnBlendOut_53A71DDF483CC968C1A61DAF788E875A(class FName NotifyName);
	void OnBlendOut_12AC243E438FB95C3F7F978927A1E9CD(class FName NotifyName);
	void KillPlayer(class ABP_FirstPersonCharacter_cLeon_Character_C* FirstpersonCharacter, class ABP_FirstPersonPlayerState_C* SourcePlayerState);
	void InpActEvt_IA_Shot_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Crouch_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void HitSuccess(class ABP_FirstPersonCharacter_cLeon_Character_C* FirstpersonCharacter);
	void ExecuteUbergraph_BP_FirstPersonCharacter_cLeon_Character_Hunter(int32 EntryPoint);
	void CheckViewInSurvivor();
	void CheckViewInPlayers(class ABP_FirstPersonCharacter_cLeon_Character_Survivor_C* TargetCharacter, int32* Rezult);
	void ChangeViewMode(class FName ModeName_ChangeViewMode, bool Quick_ChangeViewMode);
	void ChangeViewEnd();
	void AntiChatTrace(const struct FVector& End, class ABP_FirstPersonCharacter_cLeon_Character_C* Target);
	void AddtoViewDatas_Server_(const TArray<class ABP_FirstPersonPlayerState_Online_cLeon_C*>& PlayerStates, const TArray<int32>& Points);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FirstPersonCharacter_cLeon_Character_Hunter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FirstPersonCharacter_cLeon_Character_Hunter_C")
	}
	static class ABP_FirstPersonCharacter_cLeon_Character_Hunter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FirstPersonCharacter_cLeon_Character_Hunter_C>();
	}
};
DUMPER7_ASSERTS_ABP_FirstPersonCharacter_cLeon_Character_Hunter_C;

SDK_NAMESPACE_END
