#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirstPersonCharacter_cLeon_Character_Survivor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_FirstPersonCharacter_cLeon_Character_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_FirstPersonCharacter_cLeon_Character_Survivor.BP_FirstPersonCharacter_cLeon_Character_Survivor_C
// 0x0030 (0x0CD0 - 0x0CA0)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) ABP_FirstPersonCharacter_cLeon_Character_Survivor_C : public ABP_FirstPersonCharacter_cLeon_Character_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FirstPersonCharacter_cLeon_Character_Survivor_C; // 0x0CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FilledValue;                                       // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreStencil;                                        // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB4[0x4];                                      // 0x0CB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCapsuleComponent*>              OverlapCheckCapsules;                              // 0x0CB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_FirstPersonCharacter_cLeon_Character_Survivor(int32 EntryPoint);
	void SetStencilValue_Server_(int32 StencilValue);
	void ReceiveBeginPlay();
	void OverlapCheck();
	void ReceiveTick(float DeltaSeconds);
	void PlayerControllerSetup();
	void IsOverlap(int32* OverlapCountRezult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FirstPersonCharacter_cLeon_Character_Survivor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FirstPersonCharacter_cLeon_Character_Survivor_C")
	}
	static class ABP_FirstPersonCharacter_cLeon_Character_Survivor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FirstPersonCharacter_cLeon_Character_Survivor_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_FirstPersonCharacter_cLeon_Character_Survivor_C;

SDK_NAMESPACE_END
