#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GeneratedNavLinksProxy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_GeneratedNavLinksProxy.BP_GeneratedNavLinksProxy_C.ExecuteUbergraph_BP_GeneratedNavLinksProxy
// 0x0040 (0x0040 - 0x0000)
struct BP_GeneratedNavLinksProxy_C_ExecuteUbergraph_BP_GeneratedNavLinksProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Agent;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Destination;                          // 0x0010(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AIMovement_C>     K2Node_DynamicCast_AsBPI_AIMovement;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GeneratedNavLinksProxy_C_ExecuteUbergraph_BP_GeneratedNavLinksProxy;

// Function BP_GeneratedNavLinksProxy.BP_GeneratedNavLinksProxy_C.ReceiveSmartLinkReached
// 0x0020 (0x0020 - 0x0000)
struct BP_GeneratedNavLinksProxy_C_ReceiveSmartLinkReached final
{
public:
	class AActor*                                 Agent;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Destination;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GeneratedNavLinksProxy_C_ReceiveSmartLinkReached;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
