#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GP_sand_random_nomal

#include "Basic.hpp"

#include "BP_GrowParts_Base_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_GP_sand_random_nomal.BP_GP_sand_random_nomal_C
// 0x0028 (0x02E0 - 0x02B8)
class ABP_GP_sand_random_nomal_C final : public ABP_GrowParts_Base_C
{
public:
	class ULBPC_GrowPoint_C*                      LBPC_notnormal;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULBPC_GrowPoint_C*                      LBPC_GrowPoint3;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULBPC_GrowPoint_C*                      LBPC_GrowPoint2;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULBPC_GrowPoint_C*                      LBPC_GrowPoint1;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULBPC_GrowPoint_C*                      LBPC_GrowPoint;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GP_sand_random_nomal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GP_sand_random_nomal_C")
	}
	static class ABP_GP_sand_random_nomal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GP_sand_random_nomal_C>();
	}
};
DUMPER7_ASSERTS_ABP_GP_sand_random_nomal_C;

SDK_NAMESPACE_END
