#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameState_LINK

#include "Basic.hpp"

#include "EN_LINK_GamePhase_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_GameState_LINK.BP_GameState_LINK_C
// 0x00E0 (0x03E0 - 0x0300)
class ABP_GameState_LINK_C final : public AGameStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRound;                                      // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WeightState;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class ABP_FirstPersonCharacter_LINK_C*        LinkCharacter;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            ShopTravel;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CurrentWidget;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_announcement_C*                    AnnounceWidget;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SortieCount_C*                     SortieWidget;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExitShopCount_C*                   ExitShopWidget;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EN_LINK_GamePhase                             CurrentGamePhase;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GlobalCoin;                                        // 0x0354(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Night;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UWBP_TaskBlock_C*>  TaskWidgets;                                       // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   GameMode;                                          // 0x03B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class ABP_FirstPersonCharacter_Main_C*        KingCharacter;                                     // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              StartTime;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              GoalTime;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecordNow;                                       // 0x03D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentStormLevel;                                 // 0x03D4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxClearLevel;                                     // 0x03D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReplicateCurrentRound;                             // 0x03DC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WriteWeeklyRezult(const struct FDateTime& StartTime, const struct FDateTime& EndTime);
	void UseCoin(int32 UseValue, bool* Rezult);
	void UpdateSortieWieget(int32 AppendPreset, const class FText& Text);
	void UpdateSessionSettings(int32 Index_0);
	void UpdateMapSettings(int32 Index_0, const class FString& OverrideText);
	void UpdateExitShopUI(int32 AppendPreset, const class FText& Text);
	void TimerPopup(int32 TextIndex, int32 AddTime, const class FString& CustomString);
	void StormTextUpdate(int32 TextIndex, int32 TextNumber);
	void StopAllBGM(class FName NextTarget);
	void ShowKingPopup_Server_();
	void ShowKingPopup_Replicate_(const class FString& TargetName);
	void ShowAnnounceLocal(float Duration, int32 TypeIndex, int32 ReplaceValue, class ABP_FirstPersonCharacter_LINK_C* LinkCharacter);
	void ShowAnnounce(const class FText& Text, float Duration, int32 TypeIndex);
	void ShopLoadingUI(bool State);
	void SetTimePhase(bool IsNight);
	void SetStormLevel(int32 StormLevel);
	void SetSortieCounterVisibility(bool State);
	void SendToText_Server_(const class FString& Text, int32 MessageType);
	void SendToText_Local_(const class FString& Text, int32 MessageType);
	void SendToText_Client_(const class FString& Text, int32 MessageType);
	void RevivalAnnounce_Server_(class ABP_FirstPersonPlayerState_LINK_C* SourcePlayerStete);
	void RevivalAnnounce_Client_(const class FString& playerName);
	void ReplicateSound(class USoundBase* Sound);
	void RemoveWidget_Global_();
	void RemoveTaskWidget(const class FString& Key);
	void ReceiveBeginPlay();
	void ProgressAdd(int32 AddValue, const class FString& Key);
	void PlayStartCinema();
	void PlayIslandTeleportMovie(int32 Day);
	void PhaseTextUpdate(int32 Phase, int32 Time, bool IsOverTime);
	void OnRep_WeightState();
	void OnRep_GlobalCoin();
	void OnRep_GameMode();
	void OnRep_CurrentStormLevel();
	void GoToShopUI();
	void GoalAfter(const TArray<class ABP_FirstPersonCharacter_LINK_C*>& GoalMiniPenguinOwners);
	void GameOver();
	void GameClerUI();
	void GameClear();
	void ExitShopAreaUpdate(class AActor* Actor, bool State);
	void ExecuteUbergraph_BP_GameState_LINK(int32 EntryPoint);
	void DeathAnnounce_Server_(class ABP_FirstPersonPlayerState_LINK_C* SourcePlayerStete);
	void DeathAnnounce_Client_(const class FString& playerName);
	void CloseAnnounce();
	void CinemaManequinAttach(const TArray<class AController*>& Controllers);
	void AddWidget_Global_(class UClass* WidgetClass);
	void AddTaskUI(int32 TaskIndex, int32 SumProgress, const class FString& Key);
	void AddCoin(int32 Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameState_LINK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameState_LINK_C")
	}
	static class ABP_GameState_LINK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameState_LINK_C>();
	}
};
DUMPER7_ASSERTS_ABP_GameState_LINK_C;

SDK_NAMESPACE_END
