#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LinkGoalPosition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_LINK_GamePhase_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_LinkGoalPosition.BP_LinkGoalPosition_C
// 0x0278 (0x0520 - 0x02A8)
class ABP_LinkGoalPosition_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NI_Beacon;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   falgswitch;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RespawnPointPosition2;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RespawnPointPosition1;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RespawnPointPosition;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LinkFlagOverlapZone;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ring;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeometryCacheComponent*                LiNK_flag;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole;                                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRespawnPoint;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InstancePoleTransform;                             // 0x0320(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DiffPosition;                                      // 0x0380(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FGuid>                            NeedLuggageId;                                     // 0x0398(0x0050)(Edit, BlueprintVisible)
	TArray<class AActor*>                         OverlapingActors;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TSet<struct FGuid>                            OverlapingIds;                                     // 0x03F8(0x0050)(Edit, BlueprintVisible)
	TMap<struct FGuid, class ABP_LinkPoint_C*>    LinkPoint;                                         // 0x0448(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_FirstPersonGameMode_Online_LINK_C*  GameMode_LINK;                                     // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x04A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefaultRespawnPoint;                             // 0x04A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class ABP_MiniPenguin_C*>                RegisteredRespawnMiniPenguin;                      // 0x04A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ABP_DeviceBase_C*                       SignalTarget;                                      // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnedAge;                                        // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanLink;                                           // 0x0504(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLastGoalPosition;                                // 0x0505(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_506[0x2];                                      // 0x0506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              LastGoal;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void ToBlueFlag();
	void SetUsedPoint(bool IsUsed);
	void RespawnCall(class ABP_MiniPenguin_C* Target);
	void ResetGoalEevent();
	void RegisterLinkPoint(const struct FGuid& ID, class ABP_LinkPoint_C* LinkPoint);
	void ReceiveBeginPlay();
	void MakePole(class UInstancedStaticMeshComponent* InstancedStaticMeshComp);
	void LINK_FragReActivate(bool IsLastLink);
	void LastTargetActivate(bool ActivateState);
	void LastLink();
	void IsChangeImage(bool* IsInteract, class FText* OverrideText);
	void InteractSignal();
	void GoalEvent();
	void GetDuplicateValues(TArray<struct FGuid>* DuplicateValues);
	void FragVisualUpdate(bool IsUsed);
	void ExecuteUbergraph_BP_LinkGoalPosition(int32 EntryPoint);
	bool CanInteract();
	void BPI_InteractStart_Server_(class ABP_FirstPersonCharacter_Main_C* First_Person);
	void BPI_InteractStart_Local_(class ABP_FirstPersonCharacter_Main_C* First_Person);
	void BPI_InteractStart(class ABP_FirstPersonCharacter_Main_C* First_Person);
	void BPI_InteractEnd();
	void BndEvt__BP_LinkGoalPosition_LinkFlagOverlapZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_LinkGoalPosition_LinkFlagOverlapZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LinkGoalPosition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LinkGoalPosition_C")
	}
	static class ABP_LinkGoalPosition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LinkGoalPosition_C>();
	}
};
DUMPER7_ASSERTS_ABP_LinkGoalPosition_C;

SDK_NAMESPACE_END
