#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Luggage_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Luggage_Base.BP_Luggage_Base_C
// 0x0050 (0x02F8 - 0x02A8)
class ABP_Luggage_Base_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCPP_AC_CustomPhysicsForce*             CPP_AC_CustomPhysicsForce;                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             TargetMesh;                                        // 0x02C0(0x0028)(Edit, BlueprintVisible, Net, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGuid                                  UniqueID;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnLoaded_061DDAA94BACAE0F7A327A8B0F5F6D91(class UObject* Loaded);
	void GetLuggageId(struct FGuid* ID);
	void ExecuteUbergraph_BP_Luggage_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Luggage_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Luggage_Base_C")
	}
	static class ABP_Luggage_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Luggage_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Luggage_Base_C;

SDK_NAMESPACE_END
