#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PenBoxTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PenBoxTop.BP_PenBoxTop_C
// 0x0028 (0x02D0 - 0x02A8)
class ABP_PenBoxTop_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_CollisionSound_C*                  BPC_CollisionSound;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_PenBoxUnder_C*                      UnderBox;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SleepCall();
	void SimulatePhysicsCheck();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PenBoxTop(int32 EntryPoint);
	void BndEvt__BP_PenBoxTop_StaticMesh_K2Node_ComponentBoundEvent_1_ComponentSleepSignature__DelegateSignature(class UPrimitiveComponent* SleepingComponent, class FName BoneName);
	void BndEvt__BP_PenBoxTop_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentWakeSignature__DelegateSignature(class UPrimitiveComponent* WakingComponent, class FName BoneName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PenBoxTop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PenBoxTop_C")
	}
	static class ABP_PenBoxTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PenBoxTop_C>();
	}
};
DUMPER7_ASSERTS_ABP_PenBoxTop_C;

SDK_NAMESPACE_END
