#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PenBoxUnder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PenBoxUnder.BP_PenBoxUnder_C
// 0x0078 (0x0320 - 0x02A8)
class ABP_PenBoxUnder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    BindPosition;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         SpawnItem;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, struct FTransform>        SpawnItemWithAddTransform;                         // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PenBoxUnder(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PenBoxUnder_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PenBoxUnder_C")
	}
	static class ABP_PenBoxUnder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PenBoxUnder_C>();
	}
};
DUMPER7_ASSERTS_ABP_PenBoxUnder_C;

SDK_NAMESPACE_END
