#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhotoAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ENUM_ClassType_structs.hpp"
#include "ST_CopyDatas_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_CameraMode_structs.hpp"
#include "ENUM_ItemBindType_structs.hpp"
#include "ENUM_HandType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PhotoAnimation.BP_PhotoAnimation_C
// 0x00B8 (0x0360 - 0x02A8)
class ABP_PhotoAnimation_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PhotoMesh;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _______Scale_07EBE3424D13DA82E76DDFA1C8F37E14;     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______ratio_07EBE3424D13DA82E76DDFA1C8F37E14;     // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ________Direction_07EBE3424D13DA82E76DDFA1C8F37E14; // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     タイムライン;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RelativeScale;                                     // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Not_Pick_Up;                                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         In_Actors;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         PenguinIn;                                         // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         HaveKeys;                                          // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NoFire;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockEffect;                                       // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      TrailEffect;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FST_CopyDatas>                  In_ActorClass;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENUM_CameraMode                               FilmType;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeleteTarget;                                      // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoDestroy;                                       // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Hit_Normal;                                        // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void タイムライン__UpdateFunc();
	void タイムライン__FinishedFunc();
	void View_In_Out_Function(int32 Stencil_Value);
	void UpdateCoreDatas(const struct FST_ItemCoreDatas& CoreDatas);
	void SetTimeStopState(bool State);
	void SetMeshDatas(bool KeepScale);
	void ReceiveDestroyed();
	void PickState(bool State, class ABP_FirstPersonCharacter_Main_C* Character, int32 SlotIndex);
	void PhotoExport(class USplineComponent* Sline, class ABP_FirstPersonCharacter_Main_C* FirstPerson, ENUM_CameraMode PhotoType);
	void IsInPhoto(bool* Value);
	void IsChangeImage(bool* IsInteract, class FText* OverrideText);
	void InteractItem();
	void GetParentCharacter(class ABP_FirstPersonCharacter_Main_C** FirstpersonCharacter);
	void GetKeyValues(TArray<class FString>* HaveKeys);
	void GetItemInfo(ENUM_HandType* HandType, ENUM_ClassType* ClassType, bool* NotPickUp, struct FRotator* HaveRotation, struct FVector* Add_Position, bool* IsBoneAttach, ENUM_ItemBindType* BindType, class FName* BoneName, struct FST_ItemCoreDatas* CoreDatas);
	void Fix();
	void Fire(bool MiniFire);
	void ExecuteUbergraph_BP_PhotoAnimation(int32 EntryPoint);
	void DropItem(const struct FVector& Force_Vector, const struct FVector& CentorPosition);
	void BndEvt__BP_PhotoAnimation_Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhotoAnimation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhotoAnimation_C")
	}
	static class ABP_PhotoAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhotoAnimation_C>();
	}
};
DUMPER7_ASSERTS_ABP_PhotoAnimation_C;

SDK_NAMESPACE_END
