#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Protein

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ItemBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Protein.BP_Protein_C
// 0x00A0 (0x04E0 - 0x0440)
class ABP_Protein_C final : public ABP_ItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Protein_C;                       // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        NowDamageMultiply;                                 // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowStanDamageMultiply;                             // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamageEnableState;                                 // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Damage_Name;                                       // 0x0454(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Damage_Value;                                      // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class AActor*>                           HitActors;                                         // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UPrimitiveComponent*>            CollisionPrimitives;                               // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UAnimMontage*                           DefaultMontage;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EatDelay;                                          // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        kcal;                                              // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UseItem();
	void Shot(bool PressState_Shot, double PushTime_Shot, class ABP_FirstPersonCharacter_Main_C* SourcePlayer_Shot);
	void SetMeshDatas(bool KeepScale_SetMeshDatas);
	void ReceiveBeginPlay();
	void PickState(bool State_PickState, class ABP_FirstPersonCharacter_Main_C* Character_PickState, int32 SlotIndex_PickState);
	void OnNotifyEnd_B624065C408A21AB39805CBF1EDA7D0B(class FName NotifyName);
	void OnNotifyEnd_8C09DE9F41762B9037D01C9BF92CC68C(class FName NotifyName);
	void OnNotifyBegin_B624065C408A21AB39805CBF1EDA7D0B(class FName NotifyName);
	void OnNotifyBegin_8C09DE9F41762B9037D01C9BF92CC68C(class FName NotifyName);
	void OnInterrupted_B624065C408A21AB39805CBF1EDA7D0B(class FName NotifyName);
	void OnInterrupted_8C09DE9F41762B9037D01C9BF92CC68C(class FName NotifyName);
	void OnCompleted_B624065C408A21AB39805CBF1EDA7D0B(class FName NotifyName);
	void OnCompleted_8C09DE9F41762B9037D01C9BF92CC68C(class FName NotifyName);
	void OnBlendOut_B624065C408A21AB39805CBF1EDA7D0B(class FName NotifyName);
	void OnBlendOut_8C09DE9F41762B9037D01C9BF92CC68C(class FName NotifyName);
	void IsChangeImage(bool* IsInteract_IsChangeImage, class FText* OverrideText_IsChangeImage);
	void ExecuteUbergraph_BP_Protein(int32 EntryPoint);
	void DefaultMontagePlay();
	void Combo(double TimeRange, class FName ComboName);
	void CollisionReset();
	void Attack_AC_Remote(double TimeRange, class FName ComponentName, double DamageMultiply, double StanMultiply);
	void Attack_AC(double TimeRange, class FName AttackName, double DamageMultiply, bool MutipleHitPossible, double StanMultiply);
	void ApplyDamage(class UObject* OtherActor, const struct FHitResult& Sweep_Result);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Protein_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Protein_C")
	}
	static class ABP_Protein_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Protein_C>();
	}
};
DUMPER7_ASSERTS_ABP_Protein_C;

SDK_NAMESPACE_END
