#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RBD_VAT_DataAssets

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_RBD_VAT_DataAssets.BP_RBD_VAT_DataAssets_C
// 0x0040 (0x0070 - 0x0030)
class UBP_RBD_VAT_DataAssets_C final : public UPrimaryDataAsset
{
public:
	double                                        FrameLate;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh;                                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Albedo;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Normal;                                            // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ORM;                                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             position;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Rotation;                                          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetDynamicMaterialInstance(class UObject* WorldContextObject, class UMaterialInstanceDynamic** DynamicMaterial);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RBD_VAT_DataAssets_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RBD_VAT_DataAssets_C")
	}
	static class UBP_RBD_VAT_DataAssets_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RBD_VAT_DataAssets_C>();
	}
};
DUMPER7_ASSERTS_UBP_RBD_VAT_DataAssets_C;

SDK_NAMESPACE_END
