#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RevivalBell

#include "Basic.hpp"

#include "EN_DamageType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_StanType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_RevivalBell.BP_RevivalBell_C
// 0x0038 (0x02E0 - 0x02A8)
class ABP_RevivalBell_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh2;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NI_BellHit;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       RevivalArea;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void StanDamage(EN_StanType StanType);
	void StaminaDamage(double Value);
	void ReceiveBeginPlay();
	void OnNotifyEnd_90D943BF4AFCA5B61750AE8D3827B9E2(class FName NotifyName);
	void OnNotifyBegin_90D943BF4AFCA5B61750AE8D3827B9E2(class FName NotifyName);
	void OnInterrupted_90D943BF4AFCA5B61750AE8D3827B9E2(class FName NotifyName);
	void OnCompleted_90D943BF4AFCA5B61750AE8D3827B9E2(class FName NotifyName);
	void OnBlendOut_90D943BF4AFCA5B61750AE8D3827B9E2(class FName NotifyName);
	void GetParryState(bool* State);
	void ExecuteUbergraph_BP_RevivalBell(int32 EntryPoint);
	void DamageToPlayerController(class AActor* TargetActor, double DamageValue, int32 TeamIndex, EN_DamageType DamageType, const struct FTransform& SourceAgentPoint, bool UnAvoidable, class FName DamageName, const struct FHitResult& HitRezult, class AActor* SourceActor);
	void Damage(double DamageValue, int32 TeamIndex, EN_DamageType DamageType, const struct FTransform& SourceAgentPoint, bool UnAvoidable, class FName DamageName, class AActor* SourceActor, struct FFinishFilter* Finish);
	void BellHit();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RevivalBell_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RevivalBell_C")
	}
	static class ABP_RevivalBell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RevivalBell_C>();
	}
};
DUMPER7_ASSERTS_ABP_RevivalBell_C;

SDK_NAMESPACE_END
