#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SoundDevice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EN_SoundPlayType_structs.hpp"
#include "BP_DeviceBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_SoundDevice.BP_SoundDevice_C
// 0x0048 (0x0338 - 0x02F0)
class ABP_SoundDevice_C final : public ABP_DeviceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SoundDevice_C;                   // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundAsset;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EN_SoundPlayType                              PlayType;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeInTime;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutTime;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NowPlayState;                                      // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      減衰設定;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_SoundDevice(int32 EntryPoint);
	void BndEvt__BP_SoundDevice_DeviceComonent_K2Node_ComponentBoundEvent_0_OnSignal__DelegateSignature(const struct FST_EventValue& SignalValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SoundDevice_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SoundDevice_C")
	}
	static class ABP_SoundDevice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SoundDevice_C>();
	}
};
DUMPER7_ASSERTS_ABP_SoundDevice_C;

SDK_NAMESPACE_END
