#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreeGenerater

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_TreeGenerater.BP_TreeGenerater_C
// 0x0030 (0x02D8 - 0x02A8)
class ABP_TreeGenerater_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULBPC_PriorityGenerateControl_C*        LBPC_PriorityGenerateControl;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TreeClass;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RandomYawRange;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void GenerateTree(const struct FRandomStream& Seed);
	void Generate(const struct FRandomStream& Seed, int32 DepthIndex);
	void ExecuteUbergraph_BP_TreeGenerater(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TreeGenerater_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TreeGenerater_C")
	}
	static class ABP_TreeGenerater_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TreeGenerater_C>();
	}
};
DUMPER7_ASSERTS_ABP_TreeGenerater_C;

SDK_NAMESPACE_END
