#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowTrailMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_ThrowTrailMesh.BP_ThrowTrailMesh_C
// 0x0058 (0x0300 - 0x02A8)
class ABP_ThrowTrailMesh_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Positions;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FRotator                               Rotation;                                          // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UStaticMesh*                            StaticMesh;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ThrowTrailMesh(int32 EntryPoint);
	void CreateMesh();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ThrowTrailMesh_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ThrowTrailMesh_C")
	}
	static class ABP_ThrowTrailMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThrowTrailMesh_C>();
	}
};
DUMPER7_ASSERTS_ABP_ThrowTrailMesh_C;

SDK_NAMESPACE_END
