#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeStopArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CopyActorBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_TimeStopArea.BP_TimeStopArea_C
// 0x0040 (0x04A0 - 0x0460)
class ABP_TimeStopArea_C final : public ABP_CopyActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TimeStopArea_C;                  // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere1;                                           // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Centor1;                                           // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Clock_Base_mesh;                                   // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Centor;                                            // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RayPoint_Sub_3;                                    // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RayPoint_Sub_4;                                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void TimeStop(class AActor* Actor);
	void TimerUpdate();
	void TimeReStart(class AActor* Actor);
	void SetTimeStopState(bool State_SetTimeStopState);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_TimeStopArea(int32 EntryPoint);
	void DestroyVAT();
	void Check();
	void BndEvt__BP_TimeStopArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_TimeStopArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TimeStopArea_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TimeStopArea_C")
	}
	static class ABP_TimeStopArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TimeStopArea_C>();
	}
};
DUMPER7_ASSERTS_ABP_TimeStopArea_C;

SDK_NAMESPACE_END
