#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ItemUsedLoal_Wine

#include "Basic.hpp"

#include "BPC_ItemUsedLoal_Base_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ItemUsedLoal_Wine.BPC_ItemUsedLoal_Wine_C
// 0x0030 (0x00E8 - 0x00B8)
class UBPC_ItemUsedLoal_Wine_C final : public UBPC_ItemUsedLoal_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        InfinityStaminaTime;                               // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DrunkTime;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FirstPersonCharacter_LINK_C*        As_BP_First_Person_Character_LINK;                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Drunk;                                             // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DrunkValue;                                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason_ReceiveEndPlay);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BPC_ItemUsedLoal_Wine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ItemUsedLoal_Wine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ItemUsedLoal_Wine_C")
	}
	static class UBPC_ItemUsedLoal_Wine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ItemUsedLoal_Wine_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ItemUsedLoal_Wine_C;

SDK_NAMESPACE_END
