#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ReplicateAnimBPState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ReplicateAnimBPState.BPC_ReplicateAnimBPState_C
// 0x0030 (0x00E8 - 0x00B8)
class UBPC_ReplicateAnimBPState_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsDash;                                            // 0x00C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxWalkSpeed;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtLocation;                                    // 0x00D0(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetMaxSpeed(double Speed);
	void ReceiveBeginPlay();
	void OnRep_MaxWalkSpeed();
	void ExecuteUbergraph_BPC_ReplicateAnimBPState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ReplicateAnimBPState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ReplicateAnimBPState_C")
	}
	static class UBPC_ReplicateAnimBPState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ReplicateAnimBPState_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ReplicateAnimBPState_C;

SDK_NAMESPACE_END
