#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AttackCollisionControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_AttackCollisionControl.BPC_AttackCollisionControl_C
// 0x0060 (0x0118 - 0x00B8)
class UBPC_AttackCollisionControl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> HitEvent; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UPrimitiveComponent*>            BindPrimitiveComponents;                           // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Multipy_Hit_Possible;                              // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         HitActors;                                         // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ULBPC_DamageEffect_C*>           DamageEffect;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              BlockCollision;                                    // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UnBindComponents();
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void OnComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BPC_AttackCollisionControl(int32 EntryPoint);
	void EffectStop();
	void EffectSpawnEvent(double ActiveTime, class FName TargetTag);
	void Combo(double TimeRange, class FName ComboName);
	void CollisionReset();
	bool CheckBlockOverlap(TArray<class UPrimitiveComponent*>& OverlapedPrimitives);
	void BindComponents(const TArray<class UPrimitiveComponent*>& PrimitiveComponent, double ActiveTime, bool MultipyHitPossible, class FName TargetTag);
	void Attack_AC_Remote(double TimeRange, class FName ComponentName, double DamageMultiply, double StanMultiply);
	void Attack_AC(double TimeRange, class FName AttackName, double DamageMultiply, bool MutipleHitPossible, double StanMultiply);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_AttackCollisionControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_AttackCollisionControl_C")
	}
	static class UBPC_AttackCollisionControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_AttackCollisionControl_C>();
	}
};
DUMPER7_ASSERTS_UBPC_AttackCollisionControl_C;

SDK_NAMESPACE_END
