#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AIMoveControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_AIMoveControl.BPC_AIMoveControl_C
// 0x0038 (0x00F0 - 0x00B8)
class UBPC_AIMoveControl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharacterMovementComponent*            CharacterMovementComp;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             OwnerCharacter;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EPathFollowingResult OutPutRezult, class FName AttackName)> MoveEndSignal; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BeforeWalkSpeed;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Attack_Name;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnSuccess_95EC79A3420BD63D9809D388C58C8FFB(EPathFollowingResult MovementResult);
	void OnFail_95EC79A3420BD63D9809D388C58C8FFB(EPathFollowingResult MovementResult);
	void MoveTo(class AActor* TargetActor, double AcceptanceRadius, double GiveUpTime, double MultiplySpeed, bool StopOnOverlap, class FName AttackName);
	void MoveStop();
	void ExecuteUbergraph_BPC_AIMoveControl(int32 EntryPoint);
	void ClearTimer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_AIMoveControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_AIMoveControl_C")
	}
	static class UBPC_AIMoveControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_AIMoveControl_C>();
	}
};
DUMPER7_ASSERTS_UBPC_AIMoveControl_C;

SDK_NAMESPACE_END
