#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_CharacterStatusGaugeControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_CharacterStatusGaugeControl.BPC_CharacterStatusGaugeControl_C
// 0x0080 (0x0138 - 0x00B8)
class UBPC_CharacterStatusGaugeControl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        max_0;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Now;                                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationValue;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Before;                                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double UpdateValue)> ChangedValue;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Direction;                                         // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimationSpeed;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ChangeAnimationEnd;                                // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        LastAddValue;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Add_Value_Per_Sec;                                 // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rate;                                              // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAutoHealNow;                                     // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MultiplyHealValue;                                 // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMaxValue(double Value);
	void Update();
	void SnapValue(double Value);
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void ReceiveBeginPlay();
	void GetRowValue(double* Value);
	void GetNormalizeValue(double* NormalizeValue);
	void GetNormalizeAnimationValue(double* NormalizeValue);
	void GetAnimationStartValue(bool Normalize, double* StartValue);
	void ExecuteUbergraph_BPC_CharacterStatusGaugeControl(int32 EntryPoint);
	void ChangeValue(double AddValue, double AnimationTime);
	void BlockAutoHeal();
	void AutoHealStart();
	void AutoHealDelay(double AddValuePerSec, double Rate, double WaitTime);
	void AutoHeal(double AddValuePerSec, double Rate);
	void AnimationState(bool State);

	void GetLastDirection(int32* Value) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_CharacterStatusGaugeControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_CharacterStatusGaugeControl_C")
	}
	static class UBPC_CharacterStatusGaugeControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_CharacterStatusGaugeControl_C>();
	}
};
DUMPER7_ASSERTS_UBPC_CharacterStatusGaugeControl_C;

SDK_NAMESPACE_END
