#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ItemReplicateController_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ItemReplicateController_Base.BPC_ItemReplicateController_Base_C
// 0x0028 (0x00E0 - 0x00B8)
class UBPC_ItemReplicateController_Base_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ItemBase_C*                         OwnerItem;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_FirstPersonCharacter_Main_C*        OwnerCharacter;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 TargetClass;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SelfSlotIndex;                                     // 0x00D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_ItemReplicateController_Base(int32 EntryPoint);
	void CharacterReplicated();
	void UpdateOwnerItem();
	void RightItemUpdate();
	void DestroySelf(class AActor* DestroyedActor);
	void ReceiveBeginPlay();
	void OnRep_OwnerCharacter();
	void UseItem_Server_(bool State);
	void UseItem_Replicate_(bool State);
	void UseItem_Local_(bool State);
	void ReceiveTick(float DeltaSeconds_ReceiveTick);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ItemReplicateController_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ItemReplicateController_Base_C")
	}
	static class UBPC_ItemReplicateController_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ItemReplicateController_Base_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ItemReplicateController_Base_C;

SDK_NAMESPACE_END
