#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ComboControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ComboControl.BPC_ComboControl_C
// 0x0070 (0x0128 - 0x00B8)
class UBPC_ComboControl_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 TargetMesh;                                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentComboIndex;                                 // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   Montages;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   CurrentState;                                      // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName StateName)> OnStateChange;                             // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APawn*                                  Target_Character;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayMontageOnline_C*               MontageOnline;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           UniqueEvent;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class FName EventName)> OnUniqueEvent;                             // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void StateChange(class FName NewState);
	void Setup(class APawn* TargetCharacter);
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void OnNotifyEnd_160FEEFC429FDD0964C81A82DBE63440(class FName NotifyName);
	void OnNotifyBegin_160FEEFC429FDD0964C81A82DBE63440(class FName NotifyName);
	void OnInterrupted_160FEEFC429FDD0964C81A82DBE63440(class FName NotifyName);
	void OnCompleted_160FEEFC429FDD0964C81A82DBE63440(class FName NotifyName);
	void OnBlendOut_160FEEFC429FDD0964C81A82DBE63440(class FName NotifyName);
	void LoopInput(bool bEnabled);
	void ExecuteUbergraph_BPC_ComboControl(int32 EntryPoint);
	void ComboStart();
	void CanCombo(bool* CanCombo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ComboControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ComboControl_C")
	}
	static class UBPC_ComboControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ComboControl_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ComboControl_C;

SDK_NAMESPACE_END
