#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_FindNearConnectPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_FindNearConnectPoint.BPC_FindNearConnectPoint_C
// 0x0230 (0x02E8 - 0x00B8)
class UBPC_FindNearConnectPoint_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimitiveComponent*                    Primitive;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSet<class UPrimitiveComponent*>              UniqueStatic;                                      // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UPrimitiveComponent*, struct FVector> Near_Point_Datas;                               // 0x0118(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UClass*                                 Visualize;                                         // 0x0168(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class UPrimitiveComponent*, class AActor*> SpawnVisualActors;                               // 0x0170(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class UPrimitiveComponent*>              SpawnedVisualActors;                               // 0x01C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class ABP_FirstPersonCharacter_Main_C*>  CurrentUsers;                                      // 0x0210(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         SelfWeight;                                        // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentRecivePower;                                // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class ABP_FirstPersonCharacter_Main_C*, double> ReciveWeightByUser;                         // 0x0270(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                BoundSize;                                         // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxConnectCount;                                   // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentConnectPoints;                              // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoundBox;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UserSet(class ABP_FirstPersonCharacter_Main_C* Character, bool State);
	void SpawnVisualizeActor(class AActor* TargetActor, const struct FVector& position);
	void SpawnOrTeleportVisualize(const struct FVector& InLocation, class UPrimitiveComponent* Primitive);
	void RemoveWeight(const class ABP_FirstPersonCharacter_Main_C*& Key, class UBPC_LINK_HandControl_C* HandComponent);
	void ReceiveTick(float DeltaSeconds_ReceiveTick);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason_ReceiveEndPlay);
	void ReceiveBeginPlay();
	void GetNearConnectDatas(TMap<class UPrimitiveComponent*, struct FVector>* NearPointDatas);
	void ExecuteUbergraph_BPC_FindNearConnectPoint(int32 EntryPoint);
	void DestroySelf();
	void ClearArray();
	void AddWeight(const class ABP_FirstPersonCharacter_Main_C*& Key, double Value, class UBPC_LINK_HandControl_C* HandComponent);

	void GetAttachUserNum(int32* Length) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_FindNearConnectPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_FindNearConnectPoint_C")
	}
	static class UBPC_FindNearConnectPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_FindNearConnectPoint_C>();
	}
};
DUMPER7_ASSERTS_UBPC_FindNearConnectPoint_C;

SDK_NAMESPACE_END
