#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPGI_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RedpointEOSFramework_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPGI_Main.BPGI_Main_C
// 0x0050 (0x0278 - 0x0228)
class UBPGI_Main_C final : public URedpointGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CursorSpeed;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InputDeviceName;                                   // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ULINK_ServerSaveData_C*                 LINK_ServerSaveData;                               // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_Online_SaveData_C*                  CreatedSaveGame;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CloudSaveSuccess;                                  // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Rezult)>   CloudSaveSyncState;                                // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CloudSaveCheck;                                    // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloudSaveSync();
	void ExecuteUbergraph_BPGI_Main(int32 EntryPoint);
	void OnCallFailed_0646E9BD4A18BBF176FCAEA43F9771E1(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnCallFailed_0646E9BD4A18BBF176FCAEA44F5EA191(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnCallFailed_4473CEAA43FDA8DFD02079B1F2500B1B(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename);
	void OnReadUserFileComplete_4473CEAA43FDA8DFD02079B1F2500B1B(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename);
	void OnWriteUserFileCanceled_0646E9BD4A18BBF176FCAEA43F9771E1(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnWriteUserFileCanceled_0646E9BD4A18BBF176FCAEA44F5EA191(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnWriteUserFileComplete_0646E9BD4A18BBF176FCAEA43F9771E1(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnWriteUserFileComplete_0646E9BD4A18BBF176FCAEA44F5EA191(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnWriteUserFileProgress64_0646E9BD4A18BBF176FCAEA43F9771E1(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void OnWriteUserFileProgress64_0646E9BD4A18BBF176FCAEA44F5EA191(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Filename, int64 BytesWritten);
	void ReceiveInit();
	void UpdateSettings();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPGI_Main_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPGI_Main_C")
	}
	static class UBPGI_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPGI_Main_C>();
	}
};
DUMPER7_ASSERTS_UBPGI_Main_C;

SDK_NAMESPACE_END
