#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_AI_Attack

#include "Basic.hpp"

#include "EN_ThrowState_structs.hpp"
#include "AttackType_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BPI_AI_Attack.BPI_AI_Attack_C.ThrowState
// 0x0001 (0x0001 - 0x0000)
struct BPI_AI_Attack_C_ThrowState final
{
public:
	EN_ThrowState                                 ThrowState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AI_Attack_C_ThrowState;

// Function BPI_AI_Attack.BPI_AI_Attack_C.DamageState
// 0x0001 (0x0001 - 0x0000)
struct BPI_AI_Attack_C_DamageState final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AI_Attack_C_DamageState;

// Function BPI_AI_Attack.BPI_AI_Attack_C.Avoid
// 0x0001 (0x0001 - 0x0000)
struct BPI_AI_Attack_C_Avoid final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AI_Attack_C_Avoid;

// Function BPI_AI_Attack.BPI_AI_Attack_C.AttackNotify
// 0x0004 (0x0004 - 0x0000)
struct BPI_AI_Attack_C_AttackNotify final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AI_Attack_C_AttackNotify;

// Function BPI_AI_Attack.BPI_AI_Attack_C.Attack
// 0x0001 (0x0001 - 0x0000)
struct BPI_AI_Attack_C_Attack final
{
public:
	EAttackType                                   AttackType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AI_Attack_C_Attack;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
