#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Strafing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"
#include "EN_StrafingDirection_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTTask_Strafing.BTTask_Strafing_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTTask_Strafing_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EN_StrafingDirection                          Strafing_Direction;                                // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EN_StrafingDirection>                  Select_Strafing_Direction;                         // 0x00B8(0x0010)(Edit, BlueprintVisible)
	double                                        SpeedMultiply;                                     // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTime;                                           // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinTime;                                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Select_World_Direction(EN_StrafingDirection Strafing_Direction, class APawn* ControlePawn, struct FVector* World_Direction);
	void ReceiveTickAI(class AAIController* OwnerController_ReceiveTickAI, class APawn* ControlledPawn_ReceiveTickAI, float DeltaSeconds_ReceiveTickAI);
	void ReceiveExecuteAI(class AAIController* OwnerController_ReceiveExecuteAI, class APawn* ControlledPawn_ReceiveExecuteAI);
	void ExecuteUbergraph_BTTask_Strafing(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_Strafing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_Strafing_C")
	}
	static class UBTTask_Strafing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_Strafing_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_Strafing_C;

SDK_NAMESPACE_END
