#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraCalibrationCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CinematicCamera_structs.hpp"


SDK_NAMESPACE_START

// Enum CameraCalibrationCore.ECalibratedMapPixelOrigin
// NumValues: 0x0003
enum class ECalibratedMapPixelOrigin : uint8
{
	TopLeft                                  = 0,
	BottomLeft                               = 1,
	MAX                                      = 2,
};

// Enum CameraCalibrationCore.ECalibratedMapChannels
// NumValues: 0x0004
enum class ECalibratedMapChannels : uint8
{
	RG                                       = 0,
	BA                                       = 1,
	None                                     = 2,
	MAX                                      = 3,
};

// Enum CameraCalibrationCore.ECalibrationPointVisualization
// NumValues: 0x0003
enum class ECalibrationPointVisualization : uint8
{
	CalibrationPointVisualizationCube        = 0,
	CalibrationPointVisualizationPyramid     = 1,
	ECalibrationPointVisualization_MAX       = 2,
};

// Enum CameraCalibrationCore.ELensDisplayUnit
// NumValues: 0x0004
enum class ELensDisplayUnit : uint8
{
	Millimeters                              = 0,
	Pixels                                   = 1,
	Normalized                               = 2,
	ELensDisplayUnit_MAX                     = 3,
};

// Enum CameraCalibrationCore.ELensDataMode
// NumValues: 0x0003
enum class ELensDataMode : uint8
{
	Parameters                               = 0,
	STMap                                    = 1,
	ELensDataMode_MAX                        = 2,
};

// Enum CameraCalibrationCore.ELensDataCategory
// NumValues: 0x0008
enum class ELensDataCategory : uint8
{
	Focus                                    = 0,
	Iris                                     = 1,
	Zoom                                     = 2,
	Distortion                               = 3,
	ImageCenter                              = 4,
	STMap                                    = 5,
	NodalOffset                              = 6,
	ELensDataCategory_MAX                    = 7,
};

// ScriptStruct CameraCalibrationCore.AnamorphicDistortionParameters
// 0x0038 (0x0038 - 0x0000)
struct FAnamorphicDistortionParameters final
{
public:
	float                                         PixelAspect;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CX02;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CX04;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CX22;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CX24;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CX44;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CY02;                                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CY04;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CY22;                                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CY24;                                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CY44;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SqueezeX;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SqueezeY;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LensRotation;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnamorphicDistortionParameters;

// ScriptStruct CameraCalibrationCore.BaseFocusPoint
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FBaseFocusPoint
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBaseFocusPoint;

// ScriptStruct CameraCalibrationCore.BaseFocusCurve
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct SDK_ALIGN(0x01) FBaseFocusCurve
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FBaseFocusCurve;

// ScriptStruct CameraCalibrationCore.BaseLensTable
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FBaseLensTable
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ULensFile>               LensFile;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FBaseLensTable;

// ScriptStruct CameraCalibrationCore.CalibratedMapFormat
// 0x0003 (0x0003 - 0x0000)
struct FCalibratedMapFormat final
{
public:
	ECalibratedMapPixelOrigin                     PixelOrigin;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibratedMapChannels                        UndistortionChannels;                              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibratedMapChannels                        DistortionChannels;                                // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalibratedMapFormat;

// ScriptStruct CameraCalibrationCore.LensDataCategoryEditorColor
// 0x001C (0x001C - 0x0000)
struct FLensDataCategoryEditorColor final
{
public:
	struct FColor                                 Focus;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Iris;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Zoom;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Distortion;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ImageCenter;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 STMap;                                             // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NodalOffset;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLensDataCategoryEditorColor;

// ScriptStruct CameraCalibrationCore.FocalLengthInfo
// 0x0010 (0x0010 - 0x0000)
struct FFocalLengthInfo final
{
public:
	struct FVector2D                              FxFy;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFocalLengthInfo;

// ScriptStruct CameraCalibrationCore.ImageCenterInfo
// 0x0010 (0x0010 - 0x0000)
struct FImageCenterInfo final
{
public:
	struct FVector2D                              PrincipalPoint;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FImageCenterInfo;

// ScriptStruct CameraCalibrationCore.NodalPointOffset
// 0x0040 (0x0040 - 0x0000)
struct FNodalPointOffset final
{
public:
	struct FVector                                LocationOffset;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RotationOffset;                                    // 0x0020(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNodalPointOffset;

// ScriptStruct CameraCalibrationCore.DistortionInfo
// 0x0010 (0x0010 - 0x0000)
struct FDistortionInfo final
{
public:
	TArray<float>                                 Parameters;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionInfo;

// ScriptStruct CameraCalibrationCore.STMapInfo
// 0x0010 (0x0010 - 0x0000)
struct FSTMapInfo final
{
public:
	class UTexture*                               DistortionMap;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FCalibratedMapFormat                   MapFormat;                                         // 0x0008(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSTMapInfo;

// ScriptStruct CameraCalibrationCore.DistortionCalibrationResult
// 0x00C0 (0x00C0 - 0x0000)
struct FDistortionCalibrationResult final
{
public:
	float                                         EvaluatedFocus;                                    // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EvaluatedZoom;                                     // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReprojectionError;                                 // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       FocalLength;                                       // 0x0010(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FImageCenterInfo                       ImageCenter;                                       // 0x0020(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     CameraPoses;                                       // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNodalPointOffset                      NodalOffset;                                       // 0x0040(0x0040)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDistortionInfo                        Parameters;                                        // 0x0080(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSTMapInfo                             STMap;                                             // 0x0090(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 STMapFullPath;                                     // 0x00A0(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ErrorMessage;                                      // 0x00B0(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionCalibrationResult;

// ScriptStruct CameraCalibrationCore.DistortionHandlerPicker
// 0x0028 (0x0028 - 0x0000)
struct FDistortionHandlerPicker final
{
public:
	class UCineCameraComponent*                   TargetCameraComponent;                             // 0x0000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FGuid                                  DistortionProducerID;                              // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HandlerDisplayName;                                // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionHandlerPicker;

// ScriptStruct CameraCalibrationCore.DistortionZoomPoint
// 0x0018 (0x0018 - 0x0000)
struct FDistortionZoomPoint final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDistortionInfo                        DistortionInfo;                                    // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionZoomPoint;

// ScriptStruct CameraCalibrationCore.DistortionFocusPoint
// 0x0098 (0x00A0 - 0x0008)
struct FDistortionFocusPoint final : public FBaseFocusPoint
{
public:
	float                                         Focus;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             MapBlendingCurve;                                  // 0x0010(0x0080)(NativeAccessSpecifierPublic)
	TArray<struct FDistortionZoomPoint>           ZoomPoints;                                        // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionFocusPoint;

// ScriptStruct CameraCalibrationCore.DistortionFocusCurve
// 0x0088 (0x0088 - 0x0000)
struct FDistortionFocusCurve final : public FBaseFocusCurve
{
public:
	struct FRichCurve                             MapBlendingCurve;                                  // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDistortionFocusCurve;

// ScriptStruct CameraCalibrationCore.DistortionTable
// 0x0020 (0x0030 - 0x0010)
struct FDistortionTable final : public FBaseLensTable
{
public:
	TArray<struct FDistortionFocusPoint>          FocusPoints;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDistortionFocusCurve>          FocusCurves;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionTable;

// ScriptStruct CameraCalibrationCore.EncodersTable
// 0x0100 (0x0100 - 0x0000)
struct FEncodersTable final
{
public:
	struct FRichCurve                             Focus;                                             // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             Iris;                                              // 0x0080(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEncodersTable;

// ScriptStruct CameraCalibrationCore.FocalLengthZoomPoint
// 0x0020 (0x0020 - 0x0000)
struct FFocalLengthZoomPoint final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocalLengthInfo                       FocalLengthInfo;                                   // 0x0008(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsCalibrationPoint;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFocalLengthZoomPoint;

// ScriptStruct CameraCalibrationCore.FocalLengthFocusPoint
// 0x0118 (0x0120 - 0x0008)
struct FFocalLengthFocusPoint final : public FBaseFocusPoint
{
public:
	float                                         Focus;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             Fx;                                                // 0x0010(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             Fy;                                                // 0x0090(0x0080)(NativeAccessSpecifierPublic)
	TArray<struct FFocalLengthZoomPoint>          ZoomPoints;                                        // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFocalLengthFocusPoint;

// ScriptStruct CameraCalibrationCore.FocalLengthFocusCurve
// 0x0108 (0x0108 - 0x0000)
struct FFocalLengthFocusCurve final : public FBaseFocusCurve
{
public:
	struct FRichCurve                             Fx;                                                // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             Fy;                                                // 0x0080(0x0080)(NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFocalLengthFocusCurve;

// ScriptStruct CameraCalibrationCore.FocalLengthTable
// 0x0020 (0x0030 - 0x0010)
struct FFocalLengthTable final : public FBaseLensTable
{
public:
	TArray<struct FFocalLengthFocusPoint>         FocusPoints;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFocalLengthFocusCurve>         FocusCurves;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFocalLengthTable;

// ScriptStruct CameraCalibrationCore.ImageCenterFocusPoint
// 0x0108 (0x0110 - 0x0008)
struct FImageCenterFocusPoint final : public FBaseFocusPoint
{
public:
	float                                         Focus;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             Cx;                                                // 0x0010(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             Cy;                                                // 0x0090(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FImageCenterFocusPoint;

// ScriptStruct CameraCalibrationCore.ImageCenterFocusCurve
// 0x0108 (0x0108 - 0x0000)
struct FImageCenterFocusCurve final : public FBaseFocusCurve
{
public:
	struct FRichCurve                             Cx;                                                // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             Cy;                                                // 0x0080(0x0080)(NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FImageCenterFocusCurve;

// ScriptStruct CameraCalibrationCore.ImageCenterTable
// 0x0020 (0x0030 - 0x0010)
struct FImageCenterTable final : public FBaseLensTable
{
public:
	TArray<struct FImageCenterFocusPoint>         FocusPoints;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FImageCenterFocusCurve>         FocusCurves;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FImageCenterTable;

// ScriptStruct CameraCalibrationCore.LensInfo
// 0x0048 (0x0048 - 0x0000)
struct FLensInfo final
{
public:
	class FString                                 LensModelName;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LensSerialNumber;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULensModel>                 LensModel;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SensorDimensions;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ImageDimensions;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SqueezeFactor;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLensInfo;

// ScriptStruct CameraCalibrationCore.CameraFeedInfo
// 0x0010 (0x0010 - 0x0000)
struct FCameraFeedInfo final
{
public:
	struct FIntPoint                              Dimensions;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AspectRatio;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraFeedInfo;

// ScriptStruct CameraCalibrationCore.SimulcamInfo
// 0x0010 (0x0010 - 0x0000)
struct FSimulcamInfo final
{
public:
	struct FIntPoint                              MediaResolution;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MediaPlateAspectRatio;                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CGLayerAspectRatio;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSimulcamInfo;

// ScriptStruct CameraCalibrationCore.DistortionData
// 0x0018 (0x0018 - 0x0000)
struct FDistortionData final
{
public:
	TArray<struct FVector2D>                      DistortedUVs;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	float                                         OverscanFactor;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDistortionData;

// ScriptStruct CameraCalibrationCore.DataTablePointInfoBase
// 0x0008 (0x0008 - 0x0000)
struct FDataTablePointInfoBase
{
public:
	float                                         Focus;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTablePointInfoBase;

// ScriptStruct CameraCalibrationCore.DistortionPointInfo
// 0x0010 (0x0018 - 0x0008)
struct FDistortionPointInfo final : public FDataTablePointInfoBase
{
public:
	struct FDistortionInfo                        DistortionInfo;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDistortionPointInfo;

// ScriptStruct CameraCalibrationCore.FocalLengthPointInfo
// 0x0010 (0x0018 - 0x0008)
struct FFocalLengthPointInfo final : public FDataTablePointInfoBase
{
public:
	struct FFocalLengthInfo                       FocalLengthInfo;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFocalLengthPointInfo;

// ScriptStruct CameraCalibrationCore.STMapPointInfo
// 0x0010 (0x0018 - 0x0008)
struct FSTMapPointInfo final : public FDataTablePointInfoBase
{
public:
	struct FSTMapInfo                             STMapInfo;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSTMapPointInfo;

// ScriptStruct CameraCalibrationCore.ImageCenterPointInfo
// 0x0010 (0x0018 - 0x0008)
struct FImageCenterPointInfo final : public FDataTablePointInfoBase
{
public:
	struct FImageCenterInfo                       ImageCenterInfo;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FImageCenterPointInfo;

// ScriptStruct CameraCalibrationCore.NodalOffsetPointInfo
// 0x0048 (0x0050 - 0x0008)
struct FNodalOffsetPointInfo final : public FDataTablePointInfoBase
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNodalPointOffset                      NodalPointOffset;                                  // 0x0010(0x0040)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNodalOffsetPointInfo;

// ScriptStruct CameraCalibrationCore.LensDistortionState
// 0x0030 (0x0030 - 0x0000)
struct FLensDistortionState final
{
public:
	struct FDistortionInfo                        DistortionInfo;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       FocalLengthInfo;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FImageCenterInfo                       ImageCenter;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLensDistortionState;

// ScriptStruct CameraCalibrationCore.LensFilePicker
// 0x0010 (0x0010 - 0x0000)
struct FLensFilePicker final
{
public:
	bool                                          bUseDefaultLensFile;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULensFile*                              LensFile;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FLensFilePicker;

// ScriptStruct CameraCalibrationCore.LensFileEvaluationInputs
// 0x0024 (0x0024 - 0x0000)
struct FLensFileEvaluationInputs final
{
public:
	float                                         Focus;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Iris;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraFilmbackSettings                Filmback;                                          // 0x000C(0x0014)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLensFileEvaluationInputs;

// ScriptStruct CameraCalibrationCore.NodalOffsetFocusPoint
// 0x0308 (0x0310 - 0x0008)
struct FNodalOffsetFocusPoint final : public FBaseFocusPoint
{
public:
	float                                         Focus;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             LocationOffset[0x3];                               // 0x0010(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             RotationOffset[0x3];                               // 0x0190(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNodalOffsetFocusPoint;

// ScriptStruct CameraCalibrationCore.NodalOffsetFocusCurve
// 0x0308 (0x0308 - 0x0000)
struct FNodalOffsetFocusCurve final : public FBaseFocusCurve
{
public:
	struct FRichCurve                             LocationOffset[0x3];                               // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	struct FRichCurve                             RotationOffset[0x3];                               // 0x0180(0x0080)(NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNodalOffsetFocusCurve;

// ScriptStruct CameraCalibrationCore.NodalOffsetTable
// 0x0020 (0x0030 - 0x0010)
struct FNodalOffsetTable final : public FBaseLensTable
{
public:
	TArray<struct FNodalOffsetFocusPoint>         FocusPoints;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNodalOffsetFocusCurve>         FocusCurves;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNodalOffsetTable;

// ScriptStruct CameraCalibrationCore.SphericalDistortionParameters
// 0x0014 (0x0014 - 0x0000)
struct FSphericalDistortionParameters final
{
public:
	float                                         K1;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2;                                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K3;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         P1;                                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         P2;                                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSphericalDistortionParameters;

// ScriptStruct CameraCalibrationCore.DerivedDistortionData
// 0x0030 (0x0030 - 0x0000)
struct FDerivedDistortionData final
{
public:
	struct FDistortionData                        DistortionData;                                    // 0x0000(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 UndistortionDisplacementMap;                       // 0x0018(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UTextureRenderTarget2D*                 DistortionDisplacementMap;                         // 0x0020(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDerivedDistortionData;

// ScriptStruct CameraCalibrationCore.STMapZoomPoint
// 0x0050 (0x0050 - 0x0000)
struct FSTMapZoomPoint final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTMapInfo                             STMapInfo;                                         // 0x0008(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDerivedDistortionData                 DerivedDistortionData;                             // 0x0018(0x0030)(Transient, NativeAccessSpecifierPublic)
	bool                                          bIsCalibrationPoint;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSTMapZoomPoint;

// ScriptStruct CameraCalibrationCore.STMapFocusPoint
// 0x0098 (0x00A0 - 0x0008)
struct FSTMapFocusPoint final : public FBaseFocusPoint
{
public:
	float                                         Focus;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurve                             MapBlendingCurve;                                  // 0x0010(0x0080)(NativeAccessSpecifierPublic)
	TArray<struct FSTMapZoomPoint>                ZoomPoints;                                        // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSTMapFocusPoint;

// ScriptStruct CameraCalibrationCore.STMapFocusCurve
// 0x0088 (0x0088 - 0x0000)
struct FSTMapFocusCurve final : public FBaseFocusCurve
{
public:
	struct FRichCurve                             MapBlendingCurve;                                  // 0x0000(0x0080)(NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSTMapFocusCurve;

// ScriptStruct CameraCalibrationCore.STMapTable
// 0x0020 (0x0030 - 0x0010)
struct FSTMapTable final : public FBaseLensTable
{
public:
	TArray<struct FSTMapFocusPoint>               FocusPoints;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSTMapFocusCurve>               FocusCurves;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSTMapTable;

SDK_NAMESPACE_END
