#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraCalibrationCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CameraCalibrationCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function CameraCalibrationCore.LensDistortionModelHandlerBase.SetDistortionState
// 0x0030 (0x0030 - 0x0000)
struct LensDistortionModelHandlerBase_SetDistortionState final
{
public:
	struct FLensDistortionState                   InNewState;                                        // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensDistortionModelHandlerBase_SetDistortionState;

// Function CameraCalibrationCore.LensDistortionModelHandlerBase.GetDistortionDisplacementMap
// 0x0008 (0x0008 - 0x0000)
struct LensDistortionModelHandlerBase_GetDistortionDisplacementMap final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensDistortionModelHandlerBase_GetDistortionDisplacementMap;

// Function CameraCalibrationCore.LensDistortionModelHandlerBase.GetUndistortionDisplacementMap
// 0x0008 (0x0008 - 0x0000)
struct LensDistortionModelHandlerBase_GetUndistortionDisplacementMap final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensDistortionModelHandlerBase_GetUndistortionDisplacementMap;

// Function CameraCalibrationCore.LensDistortionModelHandlerBase.IsModelSupported
// 0x0010 (0x0010 - 0x0000)
struct LensDistortionModelHandlerBase_IsModelSupported final
{
public:
	TSubclassOf<class ULensModel>                 ModelToSupport;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensDistortionModelHandlerBase_IsModelSupported;

// Function CameraCalibrationCore.CalibrationPointComponent.GetNamespacedPointNames
// 0x0010 (0x0010 - 0x0000)
struct CalibrationPointComponent_GetNamespacedPointNames final
{
public:
	TArray<class FString>                         OutNamespacedNames;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalibrationPointComponent_GetNamespacedPointNames;

// Function CameraCalibrationCore.CalibrationPointComponent.GetWorldLocation
// 0x0030 (0x0030 - 0x0000)
struct CalibrationPointComponent_GetWorldLocation final
{
public:
	class FString                                 InPointName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalibrationPointComponent_GetWorldLocation;

// Function CameraCalibrationCore.CalibrationPointComponent.NamespacedSubpointName
// 0x0028 (0x0028 - 0x0000)
struct CalibrationPointComponent_NamespacedSubpointName final
{
public:
	class FString                                 InSubpointName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutNamespacedName;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalibrationPointComponent_NamespacedSubpointName;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.FindOrCreateDistortionModelHandler
// 0x0038 (0x0038 - 0x0000)
struct CameraCalibrationSubsystem_FindOrCreateDistortionModelHandler final
{
public:
	struct FDistortionHandlerPicker               DistortionHandlerPicker;                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class ULensModel>                 LensModelClass;                                    // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULensDistortionModelHandlerBase*        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_FindOrCreateDistortionModelHandler;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetDistortionModelHandlers
// 0x0018 (0x0018 - 0x0000)
struct CameraCalibrationSubsystem_GetDistortionModelHandlers final
{
public:
	class UCineCameraComponent*                   Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULensDistortionModelHandlerBase*> ReturnValue;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetDistortionModelHandlers;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.SetDefaultLensFile
// 0x0008 (0x0008 - 0x0000)
struct CameraCalibrationSubsystem_SetDefaultLensFile final
{
public:
	class ULensFile*                              NewDefaultLensFile;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_SetDefaultLensFile;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.UnregisterDistortionModelHandler
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_UnregisterDistortionModelHandler final
{
public:
	class UCineCameraComponent*                   Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULensDistortionModelHandlerBase*        Handler;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_UnregisterDistortionModelHandler;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.FindDistortionModelHandler
// 0x0038 (0x0038 - 0x0000)
struct CameraCalibrationSubsystem_FindDistortionModelHandler final
{
public:
	struct FDistortionHandlerPicker               DistortionHandlerPicker;                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUpdatePicker;                                     // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULensDistortionModelHandlerBase*        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_FindDistortionModelHandler;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraCalibrationStep
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraCalibrationStep final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraCalibrationStep>     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraCalibrationStep;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraCalibrationSteps
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraCalibrationSteps final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraCalibrationSteps;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraImageCenterAlgo
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraImageCenterAlgo final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraImageCenterAlgo>     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraImageCenterAlgo;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraImageCenterAlgos
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraImageCenterAlgos final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraImageCenterAlgos;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraNodalOffsetAlgo
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraNodalOffsetAlgo final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraNodalOffsetAlgo>     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraNodalOffsetAlgo;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetCameraNodalOffsetAlgos
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetCameraNodalOffsetAlgos final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetCameraNodalOffsetAlgos;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetDefaultLensFile
// 0x0008 (0x0008 - 0x0000)
struct CameraCalibrationSubsystem_GetDefaultLensFile final
{
public:
	class ULensFile*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetDefaultLensFile;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetLensFile
// 0x0018 (0x0018 - 0x0000)
struct CameraCalibrationSubsystem_GetLensFile final
{
public:
	struct FLensFilePicker                        Picker;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ULensFile*                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetLensFile;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetOverlayMaterial
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetOverlayMaterial final
{
public:
	class FName                                   OverlayName;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetOverlayMaterial;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetOverlayMaterialNames
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetOverlayMaterialNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetOverlayMaterialNames;

// Function CameraCalibrationCore.CameraCalibrationSubsystem.GetRegisteredLensModel
// 0x0010 (0x0010 - 0x0000)
struct CameraCalibrationSubsystem_GetRegisteredLensModel final
{
public:
	class FName                                   ModelName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULensModel>                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraCalibrationSubsystem_GetRegisteredLensModel;

// Function CameraCalibrationCore.LensFile.AddDistortionPoint
// 0x0028 (0x0028 - 0x0000)
struct LensFile_AddDistortionPoint final
{
public:
	float                                         NewFocus;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewZoom;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDistortionInfo                        NewPoint;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       NewFocalLength;                                    // 0x0018(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_AddDistortionPoint;

// Function CameraCalibrationCore.LensFile.AddFocalLengthPoint
// 0x0018 (0x0018 - 0x0000)
struct LensFile_AddFocalLengthPoint final
{
public:
	float                                         NewFocus;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewZoom;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       NewFocalLength;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_AddFocalLengthPoint;

// Function CameraCalibrationCore.LensFile.AddImageCenterPoint
// 0x0018 (0x0018 - 0x0000)
struct LensFile_AddImageCenterPoint final
{
public:
	float                                         NewFocus;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewZoom;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImageCenterInfo                       NewPoint;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_AddImageCenterPoint;

// Function CameraCalibrationCore.LensFile.AddNodalOffsetPoint
// 0x0050 (0x0050 - 0x0000)
struct LensFile_AddNodalOffsetPoint final
{
public:
	float                                         NewFocus;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewZoom;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNodalPointOffset                      NewPoint;                                          // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_AddNodalOffsetPoint;

// Function CameraCalibrationCore.LensFile.AddSTMapPoint
// 0x0018 (0x0018 - 0x0000)
struct LensFile_AddSTMapPoint final
{
public:
	float                                         NewFocus;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewZoom;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTMapInfo                             NewPoint;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_AddSTMapPoint;

// Function CameraCalibrationCore.LensFile.ChangeFocusPoint
// 0x000C (0x000C - 0x0000)
struct LensFile_ChangeFocusPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InExistingFocus;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InNewFocus;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_ChangeFocusPoint;

// Function CameraCalibrationCore.LensFile.ChangeZoomPoint
// 0x0010 (0x0010 - 0x0000)
struct LensFile_ChangeZoomPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFocus;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InExistingZoom;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InNewZoom;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_ChangeZoomPoint;

// Function CameraCalibrationCore.LensFile.ClearData
// 0x0001 (0x0001 - 0x0000)
struct LensFile_ClearData final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_ClearData;

// Function CameraCalibrationCore.LensFile.HasZoomPoint
// 0x0010 (0x0010 - 0x0000)
struct LensFile_HasZoomPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFocus;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_HasZoomPoint;

// Function CameraCalibrationCore.LensFile.MergeFocusPoint
// 0x0010 (0x0010 - 0x0000)
struct LensFile_MergeFocusPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InSrcFocus;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDestFocus;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplaceExistingZoomPoints;                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_MergeFocusPoint;

// Function CameraCalibrationCore.LensFile.RemoveFocusPoint
// 0x0008 (0x0008 - 0x0000)
struct LensFile_RemoveFocusPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFocus;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_RemoveFocusPoint;

// Function CameraCalibrationCore.LensFile.RemoveZoomPoint
// 0x000C (0x000C - 0x0000)
struct LensFile_RemoveZoomPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFocus;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_RemoveZoomPoint;

// Function CameraCalibrationCore.LensFile.EvaluateDistortionData
// 0x0028 (0x0028 - 0x0000)
struct LensFile_EvaluateDistortionData final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InFilmback;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULensDistortionModelHandlerBase*        InLensHandler;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_EvaluateDistortionData;

// Function CameraCalibrationCore.LensFile.EvaluateDistortionParameters
// 0x0020 (0x0020 - 0x0000)
struct LensFile_EvaluateDistortionParameters final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDistortionInfo                        OutEvaluatedValue;                                 // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_EvaluateDistortionParameters;

// Function CameraCalibrationCore.LensFile.EvaluateFocalLength
// 0x0020 (0x0020 - 0x0000)
struct LensFile_EvaluateFocalLength final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       OutEvaluatedValue;                                 // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_EvaluateFocalLength;

// Function CameraCalibrationCore.LensFile.EvaluateImageCenterParameters
// 0x0020 (0x0020 - 0x0000)
struct LensFile_EvaluateImageCenterParameters final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImageCenterInfo                       OutEvaluatedValue;                                 // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_EvaluateImageCenterParameters;

// Function CameraCalibrationCore.LensFile.EvaluateNodalPointOffset
// 0x0060 (0x0060 - 0x0000)
struct LensFile_EvaluateNodalPointOffset final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNodalPointOffset                      OutEvaluatedValue;                                 // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_EvaluateNodalPointOffset;

// Function CameraCalibrationCore.LensFile.EvaluateNormalizedFocus
// 0x0008 (0x0008 - 0x0000)
struct LensFile_EvaluateNormalizedFocus final
{
public:
	float                                         InNormalizedValue;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_EvaluateNormalizedFocus;

// Function CameraCalibrationCore.LensFile.EvaluateNormalizedIris
// 0x0008 (0x0008 - 0x0000)
struct LensFile_EvaluateNormalizedIris final
{
public:
	float                                         InNormalizedValue;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_EvaluateNormalizedIris;

// Function CameraCalibrationCore.LensFile.GetDistortionPoint
// 0x0020 (0x0020 - 0x0000)
struct LensFile_GetDistortionPoint final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDistortionInfo                        OutDistortionInfo;                                 // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_GetDistortionPoint;

// Function CameraCalibrationCore.LensFile.GetDistortionPoints
// 0x0010 (0x0010 - 0x0000)
struct LensFile_GetDistortionPoints final
{
public:
	TArray<struct FDistortionPointInfo>           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetDistortionPoints;

// Function CameraCalibrationCore.LensFile.GetFocalLengthPoint
// 0x0020 (0x0020 - 0x0000)
struct LensFile_GetFocalLengthPoint final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocalLengthInfo                       OutFocalLengthInfo;                                // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_GetFocalLengthPoint;

// Function CameraCalibrationCore.LensFile.GetFocalLengthPoints
// 0x0010 (0x0010 - 0x0000)
struct LensFile_GetFocalLengthPoints final
{
public:
	TArray<struct FFocalLengthPointInfo>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetFocalLengthPoints;

// Function CameraCalibrationCore.LensFile.GetImageCenterPoint
// 0x0020 (0x0020 - 0x0000)
struct LensFile_GetImageCenterPoint final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImageCenterInfo                       OutImageCenterInfo;                                // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_GetImageCenterPoint;

// Function CameraCalibrationCore.LensFile.GetImageCenterPoints
// 0x0010 (0x0010 - 0x0000)
struct LensFile_GetImageCenterPoints final
{
public:
	TArray<struct FImageCenterPointInfo>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetImageCenterPoints;

// Function CameraCalibrationCore.LensFile.GetNodalOffsetPoint
// 0x0060 (0x0060 - 0x0000)
struct LensFile_GetNodalOffsetPoint final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNodalPointOffset                      OutNodalPointOffset;                               // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_GetNodalOffsetPoint;

// Function CameraCalibrationCore.LensFile.GetNodalOffsetPoints
// 0x0010 (0x0010 - 0x0000)
struct LensFile_GetNodalOffsetPoints final
{
public:
	TArray<struct FNodalOffsetPointInfo>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetNodalOffsetPoints;

// Function CameraCalibrationCore.LensFile.GetSTMapPoint
// 0x0020 (0x0020 - 0x0000)
struct LensFile_GetSTMapPoint final
{
public:
	float                                         InFocus;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InZoom;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTMapInfo                             OutSTMapInfo;                                      // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_GetSTMapPoint;

// Function CameraCalibrationCore.LensFile.GetSTMapPoints
// 0x0010 (0x0010 - 0x0000)
struct LensFile_GetSTMapPoints final
{
public:
	TArray<struct FSTMapPointInfo>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetSTMapPoints;

// Function CameraCalibrationCore.LensFile.GetTotalPointNum
// 0x0008 (0x0008 - 0x0000)
struct LensFile_GetTotalPointNum final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_GetTotalPointNum;

// Function CameraCalibrationCore.LensFile.HasFocusEncoderMapping
// 0x0001 (0x0001 - 0x0000)
struct LensFile_HasFocusEncoderMapping final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_HasFocusEncoderMapping;

// Function CameraCalibrationCore.LensFile.HasFocusPoint
// 0x000C (0x000C - 0x0000)
struct LensFile_HasFocusPoint final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFocus;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LensFile_HasFocusPoint;

// Function CameraCalibrationCore.LensFile.HasIrisEncoderMapping
// 0x0001 (0x0001 - 0x0000)
struct LensFile_HasIrisEncoderMapping final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_HasIrisEncoderMapping;

// Function CameraCalibrationCore.LensFile.HasSamples
// 0x0002 (0x0002 - 0x0000)
struct LensFile_HasSamples final
{
public:
	ELensDataCategory                             InDataCategory;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LensFile_HasSamples;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
