#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosMover

#include "Basic.hpp"

#include "ChaosMover_structs.hpp"
#include "Mover_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class ChaosMover.ChaosMovementModeTransition
// 0x0008 (0x0048 - 0x0040)
class UChaosMovementModeTransition : public UBaseMovementModeTransition
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UChaosMoverSimulation* GetSimulation_Mutable();

	const class UChaosMoverSimulation* GetSimulation() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosMovementModeTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMovementModeTransition")
	}
	static class UChaosMovementModeTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMovementModeTransition>();
	}
};
DUMPER7_ASSERTS_UChaosMovementModeTransition;

// Class ChaosMover.ChaosCharacterLaunchCheck
// 0x0008 (0x0050 - 0x0048)
class UChaosCharacterLaunchCheck final : public UChaosMovementModeTransition
{
public:
	class FName                                   TransitionToMode;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterLaunchCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterLaunchCheck")
	}
	static class UChaosCharacterLaunchCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterLaunchCheck>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterLaunchCheck;

// Class ChaosMover.ChaosCharacterMoverComponent
// 0x0150 (0x0650 - 0x0500)
class UChaosCharacterMoverComponent final : public UCharacterMoverComponent
{
public:
	TMulticastInlineDelegate<void(const class FName& NextMovementModeName, const struct FHitResult& HitResult)> OnLanded; // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_510[0x140];                                    // 0x0510(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Launch(const struct FVector& VelocityOrImpulse, EChaosMoverVelocityEffectMode Mode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterMoverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterMoverComponent")
	}
	static class UChaosCharacterMoverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterMoverComponent>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterMoverComponent;

// Class ChaosMover.ChaosGroundMovementUtils
// 0x0000 (0x0028 - 0x0028)
class UChaosGroundMovementUtils final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector ComputeLocalGroundVelocity_Internal(const struct FVector& position, const struct FFloorCheckResult& FloorResult);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosGroundMovementUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosGroundMovementUtils")
	}
	static class UChaosGroundMovementUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosGroundMovementUtils>();
	}
};
DUMPER7_ASSERTS_UChaosGroundMovementUtils;

// Class ChaosMover.ChaosCharacterMovementModeInterface
// 0x0000 (0x0000 - 0x0000)
class IChaosCharacterMovementModeInterface final
{
public:
	float GetGroundQueryRadius() const;
	float GetMaxWalkSlopeCosine() const;
	float GetTargetHeight() const;
	bool ShouldCharacterRemainUpright() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterMovementModeInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterMovementModeInterface")
	}
	static class IChaosCharacterMovementModeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosCharacterMovementModeInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChaosCharacterMovementModeInterface;

// Class ChaosMover.ChaosCharacterConstraintMovementModeInterface
// 0x0000 (0x0000 - 0x0000)
class IChaosCharacterConstraintMovementModeInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterConstraintMovementModeInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterConstraintMovementModeInterface")
	}
	static class IChaosCharacterConstraintMovementModeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosCharacterConstraintMovementModeInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChaosCharacterConstraintMovementModeInterface;

// Class ChaosMover.ChaosPathedMovementModeInterface
// 0x0000 (0x0000 - 0x0000)
class IChaosPathedMovementModeInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosPathedMovementModeInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosPathedMovementModeInterface")
	}
	static class IChaosPathedMovementModeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosPathedMovementModeInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChaosPathedMovementModeInterface;

// Class ChaosMover.SharedChaosCharacterMovementSettings
// 0x0048 (0x0070 - 0x0028)
class USharedChaosCharacterMovementSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Deceleration;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRate;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAccelerationForVelocityMove;                   // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundFriction;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseSeparateBrakingFriction : 1;                   // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingFriction;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakingFrictionFactor;                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxStepHeight;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultFallingMode;                                // 0x005C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkableSlopeAngle;                             // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMaxWalkableSlopeAngle(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SharedChaosCharacterMovementSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SharedChaosCharacterMovementSettings")
	}
	static class USharedChaosCharacterMovementSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharedChaosCharacterMovementSettings>();
	}
};
DUMPER7_ASSERTS_USharedChaosCharacterMovementSettings;

// Class ChaosMover.ChaosMoverBackendComponent
// 0x0450 (0x0508 - 0x00B8)
class UChaosMoverBackendComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetworkPhysicsComponent*               NetworkPhysicsComponent;                           // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UNullMovementMode*                      NullMovementMode;                                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UImmediateMovementModeTransition*       ImmediateModeTransition;                           // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UChaosMoverSimulation*                  Simulation;                                        // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_E0[0x428];                                     // 0x00E0(0x0428)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOwningPawnControllerChanged_Server(class APawn* OwnerPawn, class AController* OldController, class AController* NewController);
	void HandleUpdatedComponentPhysicsStateChanged(class UPrimitiveComponent* ChangedComponent, EComponentPhysicsStateChange StateChange);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosMoverBackendComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMoverBackendComponent")
	}
	static class UChaosMoverBackendComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMoverBackendComponent>();
	}
};
DUMPER7_ASSERTS_UChaosMoverBackendComponent;

// Class ChaosMover.ChaosMoverSubsystem
// 0x0028 (0x0058 - 0x0030)
class UChaosMoverSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosMoverSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMoverSubsystem")
	}
	static class UChaosMoverSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMoverSubsystem>();
	}
};
DUMPER7_ASSERTS_UChaosMoverSubsystem;

// Class ChaosMover.ChaosMovementMode
// 0x0010 (0x0080 - 0x0070)
class UChaosMovementMode : public UBaseMovementMode
{
public:
	EChaosMoverIgnoredCollisionMode               IgnoredCollisionMode;                              // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class UChaosMoverSimulation* GetSimulation() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosMovementMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMovementMode")
	}
	static class UChaosMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMovementMode>();
	}
};
DUMPER7_ASSERTS_UChaosMovementMode;

// Class ChaosMover.ChaosMoverSimulation
// 0x01E0 (0x0210 - 0x0030)
class UChaosMoverSimulation final : public UMoverSimulation
{
public:
	uint8                                         Pad_30[0x1E0];                                     // 0x0030(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FMoverDataCollection GetDebugSimData();
	struct FMoverDataCollection GetLocalSimInput_Mutable();
	void K2_QueueInstantMovementEffect(const int32& EffectAsRawData);

	const class UBaseMovementMode* FindMovementModeByName(const class FName& Name_0) const;
	const class UBaseMovementMode* GetCurrentMovementMode() const;
	const struct FMoverDataCollection GetLocalSimInput() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosMoverSimulation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMoverSimulation")
	}
	static class UChaosMoverSimulation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMoverSimulation>();
	}
};
DUMPER7_ASSERTS_UChaosMoverSimulation;

// Class ChaosMover.ChaosCharacterMovementMode
// 0x0040 (0x00C0 - 0x0080)
class UChaosCharacterMovementMode : public UChaosMovementMode
{
public:
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadialForceLimit;                                  // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TwistTorqueLimit;                                  // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SwingTorqueLimit;                                  // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldCharacterRemainUpright;                     // 0x00A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<float>                              TargetHeightOverride;                              // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TOptional<float>                              QueryRadiusOverride;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterMovementMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterMovementMode")
	}
	static class UChaosCharacterMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterMovementMode>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterMovementMode;

// Class ChaosMover.ChaosFallingMode
// 0x0020 (0x00E0 - 0x00C0)
class UChaosFallingMode final : public UChaosCharacterMovementMode
{
public:
	bool                                          bCancelVerticalSpeedOnLanding;                     // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AirControlPercentage;                              // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallingDeceleration;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OverTerminalSpeedFallingDeceleration;              // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TerminalMovementPlaneSpeed;                        // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldClampTerminalVerticalSpeed;                 // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VerticalFallingDeceleration;                       // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TerminalVerticalSpeed;                             // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosFallingMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosFallingMode")
	}
	static class UChaosFallingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosFallingMode>();
	}
};
DUMPER7_ASSERTS_UChaosFallingMode;

// Class ChaosMover.ChaosFlyingMode
// 0x0000 (0x00C0 - 0x00C0)
class UChaosFlyingMode final : public UChaosCharacterMovementMode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosFlyingMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosFlyingMode")
	}
	static class UChaosFlyingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosFlyingMode>();
	}
};
DUMPER7_ASSERTS_UChaosFlyingMode;

// Class ChaosMover.ChaosSwimmingMode
// 0x0050 (0x0110 - 0x00C0)
class UChaosSwimmingMode final : public UChaosCharacterMovementMode
{
public:
	float                                         SwimmingIdealImmersionDepth;                       // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSwimmingSettings                      SurfaceSwimmingWaterControlSettings;               // 0x00C4(0x0044)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosSwimmingMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosSwimmingMode")
	}
	static class UChaosSwimmingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosSwimmingMode>();
	}
};
DUMPER7_ASSERTS_UChaosSwimmingMode;

// Class ChaosMover.ChaosWalkingMode
// 0x0018 (0x00D8 - 0x00C0)
class UChaosWalkingMode final : public UChaosCharacterMovementMode
{
public:
	float                                         GroundDamping;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrictionForceLimit;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionalRadialForceLimitScaling;                 // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionalGroundReaction;                          // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionalDownwardVelocityToTarget;                // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosWalkingMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosWalkingMode")
	}
	static class UChaosWalkingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosWalkingMode>();
	}
};
DUMPER7_ASSERTS_UChaosWalkingMode;

// Class ChaosMover.ChaosCharacterFallingCheck
// 0x0018 (0x0060 - 0x0048)
class UChaosCharacterFallingCheck final : public UChaosMovementModeTransition
{
public:
	class FName                                   TransitionToFallingMode;                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxUnsupportedTimeBeforeFalling;                   // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterFallingCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterFallingCheck")
	}
	static class UChaosCharacterFallingCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterFallingCheck>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterFallingCheck;

// Class ChaosMover.ChaosCharacterJumpCheck
// 0x0010 (0x0058 - 0x0048)
class UChaosCharacterJumpCheck final : public UChaosMovementModeTransition
{
public:
	float                                         JumpUpwardsSpeed;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionalGroundReactionImpulse;                   // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TransitionToMode;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterJumpCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterJumpCheck")
	}
	static class UChaosCharacterJumpCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterJumpCheck>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterJumpCheck;

// Class ChaosMover.ChaosCharacterLandingCheck
// 0x0010 (0x0058 - 0x0048)
class UChaosCharacterLandingCheck final : public UChaosMovementModeTransition
{
public:
	float                                         SwimmingStartImmersionDepth;                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorDistanceTolerance;                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TransitionToGroundMode;                            // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterLandingCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterLandingCheck")
	}
	static class UChaosCharacterLandingCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterLandingCheck>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterLandingCheck;

// Class ChaosMover.ChaosCharacterWaterCheck
// 0x0020 (0x0068 - 0x0048)
class UChaosCharacterWaterCheck final : public UChaosMovementModeTransition
{
public:
	float                                         WaterModeStartImmersionDepth;                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterModeStopImmersionDepth;                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WaterModeName;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroundModeName;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AirModeName;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosCharacterWaterCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosCharacterWaterCheck")
	}
	static class UChaosCharacterWaterCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosCharacterWaterCheck>();
	}
};
DUMPER7_ASSERTS_UChaosCharacterWaterCheck;

SDK_NAMESPACE_END
