#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CopyVAT_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CopyVAT_Animation.CopyVAT_Animation_C
// 0x0068 (0x0310 - 0x02A8)
class ACopyVAT_Animation_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         VATAnimationTimeLine_MoveLerp_9347C0BE41DCBD7586BFC5A91BA3DECB; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VATAnimationTimeLine_VAT_OverrideTime_9347C0BE41DCBD7586BFC5A91BA3DECB; // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            VATAnimationTimeLine__Direction_9347C0BE41DCBD7586BFC5A91BA3DECB; // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     VATAnimationTimeLine;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VAT_Instance;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultLocation;                                   // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultScale;                                      // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VATAnimationTimeLine__UpdateFunc();
	void VATAnimationTimeLine__FinishedFunc();
	void ExecuteUbergraph_CopyVAT_Animation(int32 EntryPoint);
	void AnimationStart(class UStaticMeshComponent* ToComponent, const struct FST_VAT_Datas& VAT_Datas);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CopyVAT_Animation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CopyVAT_Animation_C")
	}
	static class ACopyVAT_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACopyVAT_Animation_C>();
	}
};
DUMPER7_ASSERTS_ACopyVAT_Animation_C;

SDK_NAMESPACE_END
