#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_NewPenguin

#include "Basic.hpp"

#include "ControlRig_classes.hpp"


SDK_NAMESPACE_START

// ControlRigBlueprintGeneratedClass CR_NewPenguin.CR_NewPenguin_C
// 0x0030 (0x0BA0 - 0x0B70)
class UCR_NewPenguin_C final : public UControlRig
{
public:
	bool                                          Use_IK;                                            // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Foot_L_Origine;                                    // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Foot_R_Origine;                                    // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Foot_L_Offset;                                     // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Foot_R_Offset;                                     // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Peivis_Offset;                                     // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_NewPenguin_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_NewPenguin_C")
	}
	static class UCR_NewPenguin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_NewPenguin_C>();
	}
};
DUMPER7_ASSERTS_UCR_NewPenguin_C;

SDK_NAMESPACE_END
