#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEngine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataflowCore_structs.hpp"


SDK_NAMESPACE_START

// Enum DataflowEngine.EDataflowDebugDrawRenderType
// NumValues: 0x0003
enum class EDataflowDebugDrawRenderType : uint8
{
	Wireframe                                = 0,
	Shaded                                   = 1,
	EDataflowDebugDrawRenderType_MAX         = 2,
};

// Enum DataflowEngine.EDataflowSphereCoveringColorMethod
// NumValues: 0x0004
enum class EDataflowSphereCoveringColorMethod : uint8
{
	Single                                   = 0,
	ColorByRadius                            = 1,
	Random                                   = 2,
	EDataflowSphereCoveringColorMethod_MAX   = 3,
};

// Enum DataflowEngine.EDataflowType
// NumValues: 0x0003
enum class EDataflowType : uint8
{
	Construction                             = 0,
	Simulation                               = 1,
	EDataflowType_MAX                        = 2,
};

// ScriptStruct DataflowEngine.DataflowNodeDebugDrawSettings
// 0x0018 (0x0018 - 0x0000)
struct FDataflowNodeDebugDrawSettings final
{
public:
	EDataflowDebugDrawRenderType                  RenderType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTranslucent;                                      // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineWidthMultiplier;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataflowNodeDebugDrawSettings;

// ScriptStruct DataflowEngine.DataflowNodeSphereCoveringDebugDrawSettings
// 0x0040 (0x0040 - 0x0000)
struct FDataflowNodeSphereCoveringDebugDrawSettings final
{
public:
	bool                                          bDisplaySphereCovering;                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowDebugDrawRenderType                  RenderType;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTranslucent;                                      // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineWidthMultiplier;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowSphereCoveringColorMethod            ColorMethod;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x000C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorRandomSeed;                                   // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorA;                                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorB;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataflowNodeSphereCoveringDebugDrawSettings;

// ScriptStruct DataflowEngine.DataflowProxyElement
// 0x0008 (0x0068 - 0x0060)
struct FDataflowProxyElement final : public FDataflowBaseElement
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowProxyElement;

// ScriptStruct DataflowEngine.DataflowDynamicConnections
// 0x0078 (0x0078 - 0x0000)
struct FDataflowDynamicConnections final
{
public:
	TArray<struct FDataflowAllTypes>              DynamicProperties;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x68];                                      // 0x0010(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowDynamicConnections;

// ScriptStruct DataflowEngine.StringValuePair
// 0x0020 (0x0020 - 0x0000)
struct FStringValuePair final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStringValuePair;

// ScriptStruct DataflowEngine.DataflowVariableOverrides
// 0x0028 (0x0028 - 0x0000)
struct FDataflowVariableOverrides final
{
public:
	struct FInstancedPropertyBag                  Variables;                                         // 0x0000(0x0010)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          OverriddenVariableGuids;                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowVariableOverrides;

// ScriptStruct DataflowEngine.DataflowInstance
// 0x0040 (0x0040 - 0x0000)
struct FDataflowInstance final
{
public:
	class UDataflow*                              DataflowAsset;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FName                                   DataflowTerminal;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataflowVariableOverrides             VariableOverrides;                                 // 0x0010(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class UObject*                                Owner;                                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FDataflowInstance;

// ScriptStruct DataflowEngine.DataflowPreviewCacheParams
// 0x0024 (0x0024 - 0x0000)
struct FDataflowPreviewCacheParams final
{
public:
	int32                                         FrameRate;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubframeRate;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditSubframeRate;                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2f                              TimeRange;                                         // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestartSimulation;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2f                              RestartTimeRange;                                  // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsyncCaching;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowPreviewCacheParams;

// ScriptStruct DataflowEngine.DataflowSubGraphInputNode
// 0x0090 (0x0310 - 0x0280)
struct FDataflowSubGraphInputNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowDynamicConnections            DynamicConnections;                                // 0x0288(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  PropertyBag;                                       // 0x0300(0x0010)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FDataflowSubGraphInputNode;

// ScriptStruct DataflowEngine.DataflowSubGraphOutputNode
// 0x0090 (0x0310 - 0x0280)
struct FDataflowSubGraphOutputNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowDynamicConnections            DynamicConnections;                                // 0x0288(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  PropertyBag;                                       // 0x0300(0x0010)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FDataflowSubGraphOutputNode;

// ScriptStruct DataflowEngine.DataflowSubGraphGetCurrentIndexNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowSubGraphGetCurrentIndexNode final : public FDataflowNode
{
public:
	int32                                         Index;                                             // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowSubGraphGetCurrentIndexNode;

// ScriptStruct DataflowEngine.DataflowCallSubGraphNode
// 0x0140 (0x03C0 - 0x0280)
struct FDataflowCallSubGraphNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SubGraphGuid;                                      // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataflowDynamicConnections            DynamicInputs;                                     // 0x02A0(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  InputsPropertyBag;                                 // 0x0318(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowDynamicConnections            DynamicOutputs;                                    // 0x0328(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  OutputsPropertyBag;                                // 0x03A0(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x10];                                     // 0x03B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowCallSubGraphNode;

// ScriptStruct DataflowEngine.DataflowTextureTerminalNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowTextureTerminalNode final : public FDataflowTerminalNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	class UTexture2D*                             TextureAsset;                                      // 0x02A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FDataflowTextureTerminalNode;

// ScriptStruct DataflowEngine.DataflowTextureToImageNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowTextureToImageNode final : public FDataflowNode
{
public:
	class UTexture2D*                             TextureAsset;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FDataflowImage                         Image;                                             // 0x0288(0x0028)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FDataflowTextureToImageNode;

// ScriptStruct DataflowEngine.DataflowImageToTextureNode
// 0x0038 (0x02B8 - 0x0280)
struct FDataflowImageToTextureNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	class FName                                   TextureName;                                       // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             TransientTexture;                                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FDataflowImageToTextureNode;

// ScriptStruct DataflowEngine.GetDataflowVariableNode
// 0x0038 (0x02B8 - 0x0280)
struct FGetDataflowVariableNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  VariablePropertyBag;                               // 0x0288(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   VariableName;                                      // 0x0298(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGetDataflowVariableNode;

SDK_NAMESPACE_END
