#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeviceComponent

#include "Basic.hpp"

#include "ST_EventValue_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_DeviceOnlineMode_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass DeviceComponent.DeviceComponent_C
// 0x0040 (0x00F8 - 0x00B8)
class UDeviceComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(const struct FST_EventValue& SignalValue)> signal;                 // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class AActor*>                         SignalActors;                                      // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMulticastInlineDelegate<void(const struct FST_EventValue& SignalValue)> OnSignal;               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EN_DeviceOnlineMode                           DeviceOnlineMode;                                  // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Bind_End();
	void CallSignal_Client_(const struct FST_EventValue& SignalValue);
	void CallSignal_Replicate_(const struct FST_EventValue& SignalValue);
	void CallSignal_Server_(const struct FST_EventValue& SignalValue);
	void ExecuteUbergraph_DeviceComponent(int32 EntryPoint);
	void OnSignal_Event(const struct FST_EventValue& SignalValue);
	void ReceiveBeginPlay();
	void Recive_Bind(class UDeviceComponent_C* DeviceComp);
	void Send_To_Signal(const struct FST_EventValue& SignalValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DeviceComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeviceComponent_C")
	}
	static class UDeviceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeviceComponent_C>();
	}
};
DUMPER7_ASSERTS_UDeviceComponent_C;

SDK_NAMESPACE_END
