#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeviceComponent

#include "Basic.hpp"

#include "ST_EventValue_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function DeviceComponent.DeviceComponent_C.CallSignal(Client)
// 0x0028 (0x0028 - 0x0000)
struct DeviceComponent_C_CallSignal_Client_ final
{
public:
	struct FST_EventValue                         SignalValue;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_CallSignal_Client_;

// Function DeviceComponent.DeviceComponent_C.CallSignal(Replicate)
// 0x0028 (0x0028 - 0x0000)
struct DeviceComponent_C_CallSignal_Replicate_ final
{
public:
	struct FST_EventValue                         SignalValue;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_CallSignal_Replicate_;

// Function DeviceComponent.DeviceComponent_C.CallSignal(Server)
// 0x0028 (0x0028 - 0x0000)
struct DeviceComponent_C_CallSignal_Server_ final
{
public:
	struct FST_EventValue                         SignalValue;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_CallSignal_Server_;

// Function DeviceComponent.DeviceComponent_C.ExecuteUbergraph_DeviceComponent
// 0x0178 (0x0178 - 0x0000)
struct DeviceComponent_C_ExecuteUbergraph_DeviceComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_EventValue                         K2Node_CustomEvent_SignalValue;                    // 0x0008(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_EventValue                         K2Node_CustomEvent_SignalValue_4;                  // 0x0048(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDeviceComponent_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDeviceComponent_C*                     K2Node_CustomEvent_DeviceComp;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_EventValue                         K2Node_CustomEvent_SignalValue_3;                  // 0x00A0(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FST_EventValue& SignalValue)> K2Node_CreateDelegate_OutputDelegate;  // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_EventValue                         K2Node_CustomEvent_SignalValue_2;                  // 0x0128(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	struct FST_EventValue                         K2Node_CustomEvent_SignalValue_1;                  // 0x0150(0x0028)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_ExecuteUbergraph_DeviceComponent;

// Function DeviceComponent.DeviceComponent_C.OnSignal_Event
// 0x0028 (0x0028 - 0x0000)
struct DeviceComponent_C_OnSignal_Event final
{
public:
	struct FST_EventValue                         SignalValue;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_OnSignal_Event;

// Function DeviceComponent.DeviceComponent_C.Recive Bind
// 0x0008 (0x0008 - 0x0000)
struct DeviceComponent_C_Recive_Bind final
{
public:
	class UDeviceComponent_C*                     DeviceComp;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_Recive_Bind;

// Function DeviceComponent.DeviceComponent_C.Send To Signal
// 0x0028 (0x0028 - 0x0000)
struct DeviceComponent_C_Send_To_Signal final
{
public:
	struct FST_EventValue                         SignalValue;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DeviceComponent_C_Send_To_Signal;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
