#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StateTreeModule_structs.hpp"


SDK_NAMESPACE_START

// Enum GameplayCameras.EBuiltInDoubleCameraVariable
// NumValues: 0x0006
enum class EBuiltInDoubleCameraVariable : uint32
{
	None                                     = 0,
	Yaw                                      = 1,
	Pitch                                    = 2,
	Roll                                     = 3,
	Zoom                                     = 4,
	EBuiltInDoubleCameraVariable_MAX         = 5,
};

// Enum GameplayCameras.EBuiltInVector2dCameraVariable
// NumValues: 0x0003
enum class EBuiltInVector2dCameraVariable : uint32
{
	None                                     = 0,
	YawPitch                                 = 1,
	EBuiltInVector2dCameraVariable_MAX       = 2,
};

// Enum GameplayCameras.EBuiltInRotator3dCameraVariable
// NumValues: 0x0003
enum class EBuiltInRotator3dCameraVariable : uint8
{
	None                                     = 0,
	ControlRotation                          = 1,
	EBuiltInRotator3dCameraVariable_MAX      = 2,
};

// Enum GameplayCameras.ECameraTargetShape
// NumValues: 0x0004
enum class ECameraTargetShape : uint8
{
	Point                                    = 0,
	AutomaticBounds                          = 1,
	ManualBounds                             = 2,
	ECameraTargetShape_MAX                   = 3,
};

// Enum GameplayCameras.ECameraBuildStatus
// NumValues: 0x0005
enum class ECameraBuildStatus : uint8
{
	Clean                                    = 0,
	CleanWithWarnings                        = 1,
	WithErrors                               = 2,
	Dirty                                    = 3,
	ECameraBuildStatus_MAX                   = 4,
};

// Enum GameplayCameras.ECameraContextDataType
// NumValues: 0x0008
enum class ECameraContextDataType : uint32
{
	Name                                     = 0,
	String                                   = 1,
	Enum                                     = 2,
	Struct                                   = 3,
	Object                                   = 4,
	Class                                    = 5,
	Count                                    = 6,
	ECameraContextDataType_MAX               = 7,
};

// Enum GameplayCameras.ECameraContextDataContainerType
// NumValues: 0x0003
enum class ECameraContextDataContainerType : uint32
{
	None                                     = 0,
	Array                                    = 1,
	ECameraContextDataContainerType_MAX      = 2,
};

// Enum GameplayCameras.ECameraEvaluationDataCondition
// NumValues: 0x0002
enum class ECameraEvaluationDataCondition : uint8
{
	ActiveCameraRig                          = 0,
	ECameraEvaluationDataCondition_MAX       = 1,
};

// Enum GameplayCameras.ECameraNodeOriginPosition
// NumValues: 0x0006
enum class ECameraNodeOriginPosition : uint8
{
	CameraPose                               = 0,
	ActiveContext                            = 1,
	OwningContext                            = 2,
	Pivot                                    = 3,
	Pawn                                     = 4,
	ECameraNodeOriginPosition_MAX            = 5,
};

// Enum GameplayCameras.ECameraNodeSpace
// NumValues: 0x0007
enum class ECameraNodeSpace : uint8
{
	CameraPose                               = 0,
	ActiveContext                            = 1,
	OwningContext                            = 2,
	Pivot                                    = 3,
	Pawn                                     = 4,
	World                                    = 5,
	ECameraNodeSpace_MAX                     = 6,
};

// Enum GameplayCameras.ECameraObjectInterfaceParameterType
// NumValues: 0x0003
enum class ECameraObjectInterfaceParameterType : uint8
{
	Blendable                                = 0,
	Data                                     = 1,
	ECameraObjectInterfaceParameterType_MAX  = 2,
};

// Enum GameplayCameras.ECameraRigLayer
// NumValues: 0x0006
enum class ECameraRigLayer : uint8
{
	None                                     = 0,
	Base                                     = 1,
	Main                                     = 2,
	Global                                   = 3,
	Visual                                   = 4,
	ECameraRigLayer_MAX                      = 5,
};

// Enum GameplayCameras.ECameraVariableSetterBlendType
// NumValues: 0x0005
enum class ECameraVariableSetterBlendType : uint8
{
	None                                     = 0,
	Linear                                   = 1,
	SmoothStep                               = 2,
	SmootherStep                             = 3,
	ECameraVariableSetterBlendType_MAX       = 4,
};

// Enum GameplayCameras.ECameraVariableType
// NumValues: 0x0010
enum class ECameraVariableType : uint32
{
	Boolean                                  = 0,
	Integer32                                = 1,
	Float                                    = 2,
	Double                                   = 3,
	Vector2f                                 = 4,
	Vector2d                                 = 5,
	Vector3f                                 = 6,
	Vector3d                                 = 7,
	Vector4f                                 = 8,
	Vector4d                                 = 9,
	Rotator3f                                = 10,
	Rotator3d                                = 11,
	Transform3f                              = 12,
	Transform3d                              = 13,
	BlendableStruct                          = 14,
	ECameraVariableType_MAX                  = 15,
};

// Enum GameplayCameras.EGameplayCamerasViewRotationMode
// NumValues: 0x0003
enum class EGameplayCamerasViewRotationMode : uint32
{
	None                                     = 0,
	PreviewUpdate                            = 1,
	EGameplayCamerasViewRotationMode_MAX     = 2,
};

// Enum GameplayCameras.ECameraBlendStackType
// NumValues: 0x0003
enum class ECameraBlendStackType : uint32
{
	IsolatedTransient                        = 0,
	AdditivePersistent                       = 1,
	ECameraBlendStackType_MAX                = 2,
};

// Enum GameplayCameras.ECameraRigInitialOrientation
// NumValues: 0x0006
enum class ECameraRigInitialOrientation : uint32
{
	None                                     = 0,
	ContextYawPitch                          = 1,
	PreviousYawPitch                         = 2,
	PreviousAbsoluteTarget                   = 3,
	PreviousRelativeTarget                   = 4,
	ECameraRigInitialOrientation_MAX         = 5,
};

// Enum GameplayCameras.EGameplayCameraComponentActivationMode
// NumValues: 0x0004
enum class EGameplayCameraComponentActivationMode : uint8
{
	Push                                     = 0,
	PushAndInsert                            = 1,
	InsertOrPush                             = 2,
	EGameplayCameraComponentActivationMode_MAX = 3,
};

// Enum GameplayCameras.ESmoothCameraBlendType
// NumValues: 0x0003
enum class ESmoothCameraBlendType : uint32
{
	SmoothStep                               = 0,
	SmootherStep                             = 1,
	ESmoothCameraBlendType_MAX               = 2,
};

// Enum GameplayCameras.ECollisionSafePosition
// NumValues: 0x0005
enum class ECollisionSafePosition : uint8
{
	ActiveContext                            = 0,
	OwningContext                            = 1,
	Pivot                                    = 2,
	Pawn                                     = 3,
	ECollisionSafePosition_MAX               = 4,
};

// Enum GameplayCameras.ECollisionSafePositionOffsetSpace
// NumValues: 0x0006
enum class ECollisionSafePositionOffsetSpace : uint8
{
	ActiveContext                            = 0,
	OwningContext                            = 1,
	Pivot                                    = 2,
	CameraPose                               = 3,
	Pawn                                     = 4,
	ECollisionSafePositionOffsetSpace_MAX    = 5,
};

// Enum GameplayCameras.ECameraAutoRotateDirection
// NumValues: 0x0004
enum class ECameraAutoRotateDirection : uint32
{
	Facing                                   = 0,
	Movement                                 = 1,
	MovementOrFacing                         = 2,
	ECameraAutoRotateDirection_MAX           = 3,
};

// Enum GameplayCameras.ECameraShakeEvaluationMode
// NumValues: 0x0003
enum class ECameraShakeEvaluationMode : uint8
{
	Inline                                   = 0,
	VisualLayer                              = 1,
	ECameraShakeEvaluationMode_MAX           = 2,
};

// ScriptStruct GameplayCameras.BlueprintCameraEvaluationDataRef
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FBlueprintCameraEvaluationDataRef final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBlueprintCameraEvaluationDataRef;

// ScriptStruct GameplayCameras.CameraActorAttachmentInfo
// 0x0020 (0x0020 - 0x0000)
struct FCameraActorAttachmentInfo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraActorAttachmentInfo;

// ScriptStruct GameplayCameras.CameraActorTargetInfo
// 0x0028 (0x0028 - 0x0000)
struct FCameraActorTargetInfo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraTargetShape                            TargetShape;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetSize;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraActorTargetInfo;

// ScriptStruct GameplayCameras.CameraContextDataID
// 0x0004 (0x0004 - 0x0000)
struct FCameraContextDataID final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraContextDataID;

// ScriptStruct GameplayCameras.CameraContextDataDefinition
// 0x0020 (0x0020 - 0x0000)
struct FCameraContextDataDefinition final
{
public:
	struct FCameraContextDataID                   DataID;                                            // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataType                        DataType;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataContainerType               DataContainerType;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataTypeObject;                                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bAutoReset;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraContextDataDefinition;

// ScriptStruct GameplayCameras.CameraContextDataTableAllocationInfo
// 0x0010 (0x0010 - 0x0000)
struct FCameraContextDataTableAllocationInfo final
{
public:
	TArray<struct FCameraContextDataDefinition>   DataDefinitions;                                   // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraContextDataTableAllocationInfo;

// ScriptStruct GameplayCameras.CameraFramingZone
// 0x0020 (0x0020 - 0x0000)
struct FCameraFramingZone final
{
public:
	double                                        Left;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Top;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Right;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Bottom;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraFramingZone;

// ScriptStruct GameplayCameras.CameraVariableID
// 0x0004 (0x0004 - 0x0000)
struct FCameraVariableID final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraVariableID;

// ScriptStruct GameplayCameras.CameraFramingZoneParameter
// 0x0028 (0x0028 - 0x0000)
struct FCameraFramingZoneParameter final
{
public:
	struct FCameraFramingZone                     Value;                                             // 0x0000(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0020(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraFramingZoneParameter;

// ScriptStruct GameplayCameras.CameraNodeEvaluatorAllocationInfo
// 0x0004 (0x0004 - 0x0000)
struct FCameraNodeEvaluatorAllocationInfo final
{
public:
	int16                                         TotalSizeof;                                       // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MaxAlignof;                                        // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraNodeEvaluatorAllocationInfo;

// ScriptStruct GameplayCameras.CameraObjectInterfaceParameterDefinition
// 0x0048 (0x0048 - 0x0000)
struct FCameraObjectInterfaceParameterDefinition final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ParameterGuid;                                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraObjectInterfaceParameterType           ParameterType;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableID                      VariableID;                                        // 0x001C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableType                           VariableType;                                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          BlendableStructType;                               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FCameraContextDataID                   DataID;                                            // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataType                        DataType;                                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataContainerType               DataContainerType;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataTypeObject;                                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCameraObjectInterfaceParameterDefinition;

// ScriptStruct GameplayCameras.BooleanCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FBooleanCameraParameter final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableID                      VariableID;                                        // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FBooleanCameraParameter;

// ScriptStruct GameplayCameras.Integer32CameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FInteger32CameraParameter final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FInteger32CameraParameter;

// ScriptStruct GameplayCameras.FloatCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FFloatCameraParameter final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FFloatCameraParameter;

// ScriptStruct GameplayCameras.DoubleCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FDoubleCameraParameter final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDoubleCameraVariable*                  Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FDoubleCameraParameter;

// ScriptStruct GameplayCameras.Vector2fCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FVector2fCameraParameter final
{
public:
	struct FVector2f                              Value;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector2fCameraVariable*                Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector2fCameraParameter;

// ScriptStruct GameplayCameras.Vector2dCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct FVector2dCameraParameter final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector2dCameraParameter;

// ScriptStruct GameplayCameras.Vector3fCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FVector3fCameraParameter final
{
public:
	struct FVector3f                              Value;                                             // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x000C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector3fCameraVariable*                Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector3fCameraParameter;

// ScriptStruct GameplayCameras.Vector3dCameraParameter
// 0x0028 (0x0028 - 0x0000)
struct FVector3dCameraParameter final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector3dCameraVariable*                Variable;                                          // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector3dCameraParameter;

// ScriptStruct GameplayCameras.Vector4fCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct FVector4fCameraParameter final
{
public:
	struct FVector4f                              Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector4fCameraVariable*                Variable;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector4fCameraParameter;

// ScriptStruct GameplayCameras.Vector4dCameraParameter
// 0x0030 (0x0030 - 0x0000)
struct FVector4dCameraParameter final
{
public:
	struct FVector4                               Value;                                             // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0020(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector4dCameraVariable*                Variable;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector4dCameraParameter;

// ScriptStruct GameplayCameras.Rotator3fCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FRotator3fCameraParameter final
{
public:
	struct FRotator3f                             Value;                                             // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x000C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URotator3fCameraVariable*               Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRotator3fCameraParameter;

// ScriptStruct GameplayCameras.Rotator3dCameraParameter
// 0x0028 (0x0028 - 0x0000)
struct FRotator3dCameraParameter final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotator3dCameraVariable*               Variable;                                          // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRotator3dCameraParameter;

// ScriptStruct GameplayCameras.Transform3fCameraParameter
// 0x0040 (0x0040 - 0x0000)
struct FTransform3fCameraParameter final
{
public:
	struct FTransform3f                           Value;                                             // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransform3fCameraVariable*             Variable;                                          // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FTransform3fCameraParameter;

// ScriptStruct GameplayCameras.Transform3dCameraParameter
// 0x0070 (0x0070 - 0x0000)
struct FTransform3dCameraParameter final
{
public:
	struct FTransform                             Value;                                             // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      VariableID;                                        // 0x0060(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransform3dCameraVariable*             Variable;                                          // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FTransform3dCameraParameter;

// ScriptStruct GameplayCameras.CameraRigInputSlotParameters
// 0x0002 (0x0002 - 0x0000)
struct FCameraRigInputSlotParameters final
{
public:
	bool                                          bIsAccumulated;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPreBlended;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraRigInputSlotParameters;

// ScriptStruct GameplayCameras.CameraParameterClamping
// 0x0018 (0x0018 - 0x0000)
struct FCameraParameterClamping final
{
public:
	double                                        MinValue;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxValue;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMin;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMax;                                         // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraParameterClamping;

// ScriptStruct GameplayCameras.CameraParameterNormalization
// 0x0010 (0x0010 - 0x0000)
struct FCameraParameterNormalization final
{
public:
	double                                        MaxValue;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraParameterNormalization;

// ScriptStruct GameplayCameras.CameraRigInstanceID
// 0x0008 (0x0008 - 0x0000)
struct FCameraRigInstanceID final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECameraRigLayer                               Layer;                                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraRigInstanceID;

// ScriptStruct GameplayCameras.CameraRotatorCurve
// 0x0180 (0x0180 - 0x0000)
struct FCameraRotatorCurve final
{
public:
	struct FRichCurve                             Curves[0x3];                                       // 0x0000(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraRotatorCurve;

// ScriptStruct GameplayCameras.CameraSingleCurve
// 0x0080 (0x0080 - 0x0000)
struct FCameraSingleCurve final
{
public:
	struct FRichCurve                             Curve;                                             // 0x0000(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraSingleCurve;

// ScriptStruct GameplayCameras.BooleanCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FBooleanCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBooleanCameraVariable*                 Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FBooleanCameraVariableReference;

// ScriptStruct GameplayCameras.Integer32CameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FInteger32CameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteger32CameraVariable*               Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FInteger32CameraVariableReference;

// ScriptStruct GameplayCameras.FloatCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FFloatCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFloatCameraVariable*                   Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FFloatCameraVariableReference;

// ScriptStruct GameplayCameras.DoubleCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FDoubleCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDoubleCameraVariable*                  Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FDoubleCameraVariableReference;

// ScriptStruct GameplayCameras.Vector2fCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector2fCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector2fCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector2fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector2dCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector2dCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector2dCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector2dCameraVariableReference;

// ScriptStruct GameplayCameras.Vector3fCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector3fCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector3fCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector3fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector3dCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector3dCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector3dCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector3dCameraVariableReference;

// ScriptStruct GameplayCameras.Vector4fCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector4fCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector4fCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector4fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector4dCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FVector4dCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector4dCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FVector4dCameraVariableReference;

// ScriptStruct GameplayCameras.Rotator3fCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FRotator3fCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotator3fCameraVariable*               Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRotator3fCameraVariableReference;

// ScriptStruct GameplayCameras.Rotator3dCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FRotator3dCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotator3dCameraVariable*               Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRotator3dCameraVariableReference;

// ScriptStruct GameplayCameras.Transform3fCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FTransform3fCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransform3fCameraVariable*             Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FTransform3fCameraVariableReference;

// ScriptStruct GameplayCameras.Transform3dCameraVariableReference
// 0x0010 (0x0010 - 0x0000)
struct FTransform3dCameraVariableReference final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransform3dCameraVariable*             Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FTransform3dCameraVariableReference;

// ScriptStruct GameplayCameras.CameraVariableSetterHandle
// 0x0008 (0x0008 - 0x0000)
struct FCameraVariableSetterHandle final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        SerialNumber;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraVariableSetterHandle;

// ScriptStruct GameplayCameras.CameraVariableDefinition
// 0x0018 (0x0018 - 0x0000)
struct FCameraVariableDefinition final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableType                           VariableType;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptStruct*                          BlendableStructType;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bIsPrivate;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInput;                                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoReset;                                        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraVariableDefinition;

// ScriptStruct GameplayCameras.CameraVariableTableAllocationInfo
// 0x0010 (0x0010 - 0x0000)
struct FCameraVariableTableAllocationInfo final
{
public:
	TArray<struct FCameraVariableDefinition>      VariableDefinitions;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraVariableTableAllocationInfo;

// ScriptStruct GameplayCameras.CameraVectorCurve
// 0x0180 (0x0180 - 0x0000)
struct FCameraVectorCurve final
{
public:
	struct FRichCurve                             Curves[0x3];                                       // 0x0000(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraVectorCurve;

// ScriptStruct GameplayCameras.CustomCameraNodeBlendableParameter
// 0x0028 (0x0028 - 0x0000)
struct FCustomCameraNodeBlendableParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableType                           ParameterType;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          BlendableStructType;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FCameraVariableID                      OverrideVariableID;                                // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraVariableAsset*                   OverrideVariable;                                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCustomCameraNodeBlendableParameter;

// ScriptStruct GameplayCameras.CustomCameraNodeDataParameter
// 0x0020 (0x0020 - 0x0000)
struct FCustomCameraNodeDataParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataType                        ParameterType;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataContainerType               ParameterContainerType;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ParameterTypeObject;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FCameraContextDataID                   OverrideDataID;                                    // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCustomCameraNodeDataParameter;

// ScriptStruct GameplayCameras.CustomCameraNodeParameters
// 0x0020 (0x0020 - 0x0000)
struct FCustomCameraNodeParameters final
{
public:
	TArray<struct FCustomCameraNodeBlendableParameter> BlendableParameters;                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomCameraNodeDataParameter> DataParameters;                                    // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCustomCameraNodeParameters;

// ScriptStruct GameplayCameras.CameraObjectAllocationInfo
// 0x0028 (0x0028 - 0x0000)
struct FCameraObjectAllocationInfo final
{
public:
	struct FCameraNodeEvaluatorAllocationInfo     EvaluatorInfo;                                     // 0x0000(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableTableAllocationInfo     VariableTableInfo;                                 // 0x0008(0x0010)(NativeAccessSpecifierPublic)
	struct FCameraContextDataTableAllocationInfo  ContextDataTableInfo;                              // 0x0018(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraObjectAllocationInfo;

// ScriptStruct GameplayCameras.CameraObjectInterfaceParameterMetaData
// 0x001C (0x001C - 0x0000)
struct FCameraObjectInterfaceParameterMetaData final
{
public:
	struct FGuid                                  ParameterGuid;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      OverrideVariableID;                                // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   OverrideDataID;                                    // 0x0014(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOverridden;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAnimated;                                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraObjectInterfaceParameterMetaData;

// ScriptStruct GameplayCameras.BaseCameraObjectReference
// 0x0028 (0x0028 - 0x0000)
struct FBaseCameraObjectReference
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCameraObjectInterfaceParameterMetaData> ParameterMetaData;                        // 0x0018(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FBaseCameraObjectReference;

// ScriptStruct GameplayCameras.CameraAssetAllocationInfo
// 0x0020 (0x0020 - 0x0000)
struct FCameraAssetAllocationInfo final
{
public:
	struct FCameraVariableTableAllocationInfo     VariableTableInfo;                                 // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FCameraContextDataTableAllocationInfo  ContextDataTableInfo;                              // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraAssetAllocationInfo;

// ScriptStruct GameplayCameras.CameraAssetReference
// 0x0038 (0x0038 - 0x0000)
struct FCameraAssetReference final
{
public:
	class UCameraAsset*                           CameraAsset;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          ParameterOverrideGuids;                            // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          ParameterAnimatedGuids;                            // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraAssetReference;

// ScriptStruct GameplayCameras.CameraObjectInterface
// 0x0030 (0x0030 - 0x0000)
struct FCameraObjectInterface final
{
public:
	TArray<class UCameraObjectInterfaceBlendableParameter*> BlendableParameters;                     // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UCameraObjectInterfaceDataParameter*> DataParameters;                               // 0x0010(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 DisplayName;                                       // 0x0020(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraObjectInterface;

// ScriptStruct GameplayCameras.CameraPose
// 0x0088 (0x0088 - 0x0000)
struct FCameraPose final
{
public:
