#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.BlendCameraEvaluationData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      FromCameraData;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraEvaluationDataRef      ToCameraData;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Factor;                                            // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData;

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.GetCameraPose
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0018(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose;

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.MakeCameraEvaluationData
// 0x0018 (0x0018 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData;

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.SetCameraPose
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0018(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose;

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.SetDefaultCameraRigParameters
// 0x0020 (0x0020 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UCameraRigAsset*                  CameraRig;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Value;                                             // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Value;                                             // 0x0020(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetClassData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetClassData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetClassData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetEnumData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetEnumData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            EnumType;                                          // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetEnumData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetNameData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetNameData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetNameData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetObjectData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetObjectData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetObjectData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetStringData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetStringData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetStringData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetStructData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetStructData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UScriptStruct*                    DataStructType;                                    // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_GetStructData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetClassData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetClassData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Data;                                              // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetClassData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetEnumData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetEnumData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            EnumType;                                          // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Data;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetEnumData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetNameData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetNameData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Data;                                              // 0x001C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetNameData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetObjectData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetObjectData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Data;                                              // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetObjectData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetStringData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetStringData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetStringData;

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetStructData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetStructData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Data;                                              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraContextDataTableFunctionLibrary_SetStructData;

// Function GameplayCameras.CameraRigInstanceFunctions.IsValid
// 0x000C (0x000C - 0x0000)
struct CameraRigInstanceFunctions_IsValid final
{
public:
	struct FCameraRigInstanceID                   InstanceId;                                        // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CameraRigInstanceFunctions_IsValid;

// Function GameplayCameras.GameplayCameraParameterSetterComponent.OnActorBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct GameplayCameraParameterSetterComponent_OnActorBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraParameterSetterComponent_OnActorBeginOverlap;

// Function GameplayCameras.GameplayCameraParameterSetterComponent.OnActorEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct GameplayCameraParameterSetterComponent_OnActorEndOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraParameterSetterComponent_OnActorEndOverlap;

// Function GameplayCameras.GameplayCameraParameterSetterComponent.StopParameterSetters
// 0x0001 (0x0001 - 0x0000)
struct GameplayCameraParameterSetterComponent_StopParameterSetters final
{
public:
	bool                                          bImmediately;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraParameterSetterComponent_StopParameterSetters;

// Function GameplayCameras.GameplayCamerasPlayerCameraManager.StartGlobalCameraModifierRig
// 0x0018 (0x0018 - 0x0000)
struct GameplayCamerasPlayerCameraManager_StartGlobalCameraModifierRig final
{
public:
	const class UCameraRigAsset*                  CameraRig;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OrderKey;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraRigInstanceID                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameplayCamerasPlayerCameraManager_StartGlobalCameraModifierRig;

// Function GameplayCameras.GameplayCamerasPlayerCameraManager.StartVisualCameraModifierRig
// 0x0018 (0x0018 - 0x0000)
struct GameplayCamerasPlayerCameraManager_StartVisualCameraModifierRig final
{
public:
	const class UCameraRigAsset*                  CameraRig;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OrderKey;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraRigInstanceID                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameplayCamerasPlayerCameraManager_StartVisualCameraModifierRig;

// Function GameplayCameras.GameplayCamerasPlayerCameraManager.StealPlayerController
// 0x0008 (0x0008 - 0x0000)
struct GameplayCamerasPlayerCameraManager_StealPlayerController final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCamerasPlayerCameraManager_StealPlayerController;

// Function GameplayCameras.GameplayCamerasPlayerCameraManager.StopCameraModifierRig
// 0x000C (0x000C - 0x0000)
struct GameplayCamerasPlayerCameraManager_StopCameraModifierRig final
{
public:
	struct FCameraRigInstanceID                   InstanceId;                                        // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameplayCamerasPlayerCameraManager_StopCameraModifierRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraDirector
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraDirector final
{
public:
	class UObject*                                EvaluationContextOwner;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraDirectorActivateParams Params_0;                                          // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraRig
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNewInstance;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraRigViaProxy
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraRigViaProxy final
{
public:
	class UCameraRigProxyAsset*                   CameraRigProxy;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNewInstance;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraRigViaProxy;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentBaseCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentBaseCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentBaseCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentGlobalCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentGlobalCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentGlobalCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentVisualCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentVisualCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.AddChildEvaluationContext
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_AddChildEvaluationContext final
{
public:
	class UObject*                                ChildEvaluationContextOwner;                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_AddChildEvaluationContext;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivateCameraDirector
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivateCameraDirector final
{
public:
	class UObject*                                EvaluationContextOwner;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraDirectorDeactivateParams Params_0;                                        // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivateCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentBaseCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentBaseCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentBaseCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentGlobalCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentGlobalCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentGlobalCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentVisualCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentVisualCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.RemoveChildEvaluationContext
// 0x0018 (0x0018 - 0x0000)
struct BlueprintCameraDirectorEvaluator_RemoveChildEvaluationContext final
{
public:
	class UObject*                                ChildEvaluationContextOwner;                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildSlotName;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_RemoveChildEvaluationContext;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.RunCameraDirector
// 0x0020 (0x0020 - 0x0000)
struct BlueprintCameraDirectorEvaluator_RunCameraDirector final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EvaluationContextOwner;                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraDirectorEvaluationParams Params_0;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_RunCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.RunChildCameraDirector
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_RunChildCameraDirector final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildSlotName;                                     // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_RunChildCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.FindEvaluationContextOwnerActor
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_FindEvaluationContextOwnerActor final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_FindEvaluationContextOwnerActor;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.GetConditionalContextResult
// 0x0020 (0x0020 - 0x0000)
struct BlueprintCameraDirectorEvaluator_GetConditionalContextResult final
{
public:
	ECameraEvaluationDataCondition                Condition;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintCameraEvaluationDataRef      ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_GetConditionalContextResult;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.GetInitialContextResult
// 0x0018 (0x0018 - 0x0000)
struct BlueprintCameraDirectorEvaluator_GetInitialContextResult final
{
public:
	struct FBlueprintCameraEvaluationDataRef      ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_GetInitialContextResult;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentBaseCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentBaseCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentBaseCameraRig;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentGlobalCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentGlobalCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentGlobalCameraRig;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentVisualCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentVisualCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetAimDir
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetAimDir final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetAimDir;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetAimRay
// 0x00B8 (0x00B8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetAimRay final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRay                                   ReturnValue;                                       // 0x0088(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetAimRay;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetEffectiveFieldOfView
// 0x0090 (0x0090 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetEffectiveFieldOfView final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
