#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "GameplayCameras_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


SDK_NAMESPACE_START

// Class GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraEvaluationDataFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BlendCameraEvaluationData(const struct FBlueprintCameraEvaluationDataRef& FromCameraData, const struct FBlueprintCameraEvaluationDataRef& ToCameraData, float Factor);
	static struct FBlueprintCameraPose GetCameraPose(const struct FBlueprintCameraEvaluationDataRef& CameraData);
	static struct FBlueprintCameraEvaluationDataRef MakeCameraEvaluationData();
	static void SetCameraPose(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FBlueprintCameraPose& CameraPose);
	static void SetDefaultCameraRigParameters(const struct FBlueprintCameraEvaluationDataRef& CameraData, const class UCameraRigAsset* CameraRig);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraEvaluationDataFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraEvaluationDataFunctionLibrary")
	}
	static class UBlueprintCameraEvaluationDataFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraEvaluationDataFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraEvaluationDataFunctionLibrary;

// Class GameplayCameras.BlueprintCameraVariableTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraVariableTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBooleanCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UBooleanCameraVariable* Variable);
	static double GetDoubleCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UDoubleCameraVariable* Variable);
	static float GetFloatCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UFloatCameraVariable* Variable);
	static int32 GetInteger32CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UInteger32CameraVariable* Variable);
	static struct FRotator GetRotatorCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class URotator3dCameraVariable* Variable);
	static struct FTransform GetTransformCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UTransform3dCameraVariable* Variable);
	static struct FVector2D GetVector2CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector2dCameraVariable* Variable);
	static struct FVector GetVector3CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector3dCameraVariable* Variable);
	static struct FVector4 GetVector4CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector4dCameraVariable* Variable);
	static void SetBooleanCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UBooleanCameraVariable* Variable, bool Value);
	static void SetDoubleCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UDoubleCameraVariable* Variable, double Value);
	static void SetFloatCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UFloatCameraVariable* Variable, float Value);
	static void SetInteger32CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UInteger32CameraVariable* Variable, int32 Value);
	static void SetRotatorCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class URotator3dCameraVariable* Variable, const struct FRotator& Value);
	static void SetTransformCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UTransform3dCameraVariable* Variable, const struct FTransform& Value);
	static void SetVector2CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector2dCameraVariable* Variable, const struct FVector2D& Value);
	static void SetVector3CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector3dCameraVariable* Variable, const struct FVector& Value);
	static void SetVector4CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector4dCameraVariable* Variable, const struct FVector4& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraVariableTableFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraVariableTableFunctionLibrary")
	}
	static class UBlueprintCameraVariableTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraVariableTableFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraVariableTableFunctionLibrary;

// Class GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraContextDataTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* GetClassData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static uint8 GetEnumData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UEnum* EnumType);
	static class FName GetNameData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static class UObject* GetObjectData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static class FString GetStringData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static struct FInstancedStruct GetStructData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UScriptStruct* DataStructType);
	static bool SetClassData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, class UClass* Data);
	static bool SetEnumData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UEnum* EnumType, uint8 Data);
	static bool SetNameData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class FName& Data);
	static bool SetObjectData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, class UObject* Data);
	static bool SetStringData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class FString& Data);
	static bool SetStructData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const struct FInstancedStruct& Data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraContextDataTableFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraContextDataTableFunctionLibrary")
	}
	static class UBlueprintCameraContextDataTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraContextDataTableFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraContextDataTableFunctionLibrary;

// Class GameplayCameras.HasCameraBuildStatus
// 0x0000 (0x0000 - 0x0000)
class IHasCameraBuildStatus final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HasCameraBuildStatus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HasCameraBuildStatus")
	}
	static class IHasCameraBuildStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasCameraBuildStatus>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHasCameraBuildStatus;

// Class GameplayCameras.CameraNode
// 0x0010 (0x0038 - 0x0028)
class UCameraNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraNode")
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};
DUMPER7_ASSERTS_UCameraNode;

// Class GameplayCameras.CombinedCameraRigsCameraNode
// 0x0010 (0x0048 - 0x0038)
class UCombinedCameraRigsCameraNode final : public UCameraNode
{
public:
	TArray<struct FCameraRigAssetReference>       CameraRigReferences;                               // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombinedCameraRigsCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombinedCameraRigsCameraNode")
	}
	static class UCombinedCameraRigsCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombinedCameraRigsCameraNode>();
	}
};
DUMPER7_ASSERTS_UCombinedCameraRigsCameraNode;

// Class GameplayCameras.Input1DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput1DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Input1DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Input1DCameraNode")
	}
	static class UInput1DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput1DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInput1DCameraNode;

// Class GameplayCameras.CameraRigInput1DSlot
// 0x0050 (0x0088 - 0x0038)
class UCameraRigInput1DSlot final : public UInput1DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraParameterClamping               clamp;                                             // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          Normalize;                                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInDoubleCameraVariable                  BuiltInVariable;                                   // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDoubleCameraVariableReference         CustomVariable;                                    // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x0080(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x0084(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInput1DSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInput1DSlot")
	}
	static class UCameraRigInput1DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput1DSlot>();
	}
};
DUMPER7_ASSERTS_UCameraRigInput1DSlot;

// Class GameplayCameras.Input2DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput2DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Input2DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Input2DCameraNode")
	}
	static class UInput2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput2DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInput2DCameraNode;

// Class GameplayCameras.CameraRigInput2DSlot
// 0x0078 (0x00B0 - 0x0038)
class UCameraRigInput2DSlot : public UInput2DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraParameterClamping               ClampX;                                            // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterClamping               ClampY;                                            // 0x0058(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeX;                                        // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeY;                                        // 0x0080(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInVector2dCameraVariable                BuiltInVariable;                                   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2dCameraVariableReference       CustomVariable;                                    // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x00AC(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInput2DSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInput2DSlot")
	}
	static class UCameraRigInput2DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput2DSlot>();
	}
};
DUMPER7_ASSERTS_UCameraRigInput2DSlot;

// Class GameplayCameras.CameraRigInstanceFunctions
// 0x0000 (0x0028 - 0x0028)
class UCameraRigInstanceFunctions final : public UBlueprintFunctionLibrary
{
public:
	static bool IsValid(const struct FCameraRigInstanceID& InstanceId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInstanceFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInstanceFunctions")
	}
	static class UCameraRigInstanceFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInstanceFunctions>();
	}
};
DUMPER7_ASSERTS_UCameraRigInstanceFunctions;

// Class GameplayCameras.ShakeCameraNode
// 0x0000 (0x0038 - 0x0038)
class UShakeCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShakeCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShakeCameraNode")
	}
	static class UShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShakeCameraNode>();
	}
};
DUMPER7_ASSERTS_UShakeCameraNode;

// Class GameplayCameras.CompositeShakeCameraNode
// 0x0010 (0x0048 - 0x0038)
class UCompositeShakeCameraNode final : public UShakeCameraNode
{
public:
	TArray<class UShakeCameraNode*>               Shakes;                                            // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CompositeShakeCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CompositeShakeCameraNode")
	}
	static class UCompositeShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeShakeCameraNode>();
	}
};
DUMPER7_ASSERTS_UCompositeShakeCameraNode;

// Class GameplayCameras.EnvelopeShakeCameraNode
// 0x0038 (0x0070 - 0x0038)
class UEnvelopeShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  EaseInTime;                                        // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  EaseOutTime;                                       // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  TotalTime;                                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UShakeCameraNode*                       Shake;                                             // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvelopeShakeCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvelopeShakeCameraNode")
	}
	static class UEnvelopeShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvelopeShakeCameraNode>();
	}
};
DUMPER7_ASSERTS_UEnvelopeShakeCameraNode;

// Class GameplayCameras.GameplayCameraParameterSetterComponent
// 0x0140 (0x01F8 - 0x00B8)
class UGameplayCameraParameterSetterComponent final : public UActorComponent
{
public:
	struct FCameraRigAssetReference               CameraRigReference;                                // 0x00B8(0x0120)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableSetterBlendType                BlendType;                                         // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x17];                                     // 0x01E1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnActorEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void StartParameterSetters();
	void StopParameterSetters(bool bImmediately);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraParameterSetterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraParameterSetterComponent")
	}
	static class UGameplayCameraParameterSetterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraParameterSetterComponent>();
	}
};
DUMPER7_ASSERTS_UGameplayCameraParameterSetterComponent;

// Class GameplayCameras.GameplayCamerasPlayerCameraManager
// 0x0900 (0x30E0 - 0x27E0)
class AGameplayCamerasPlayerCameraManager final : public APlayerCameraManager
{
public:
	uint8                                         Pad_27E0[0x10];                                    // 0x27E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayCamerasViewRotationMode              ViewRotationMode;                                  // 0x27F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideViewRotationMode;                         // 0x27F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27F5[0x3];                                     // 0x27F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   OriginalCameraManager;                             // 0x27F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2800[0x8E0];                                   // 0x2800(0x08E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReleasePlayerController();
	struct FCameraRigInstanceID StartGlobalCameraModifierRig(const class UCameraRigAsset* CameraRig, int32 OrderKey);
	struct FCameraRigInstanceID StartVisualCameraModifierRig(const class UCameraRigAsset* CameraRig, int32 OrderKey);
	void StealPlayerController(class APlayerController* PlayerController);
	void StopCameraModifierRig(const struct FCameraRigInstanceID& InstanceId, bool bImmediately);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCamerasPlayerCameraManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCamerasPlayerCameraManager")
	}
	static class AGameplayCamerasPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCamerasPlayerCameraManager>();
	}
};
DUMPER7_ASSERTS_AGameplayCamerasPlayerCameraManager;

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendCameraNode")
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendCameraNode;

// Class GameplayCameras.SimpleBlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class USimpleBlendCameraNode : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleBlendCameraNode")
	}
	static class USimpleBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBlendCameraNode>();
	}
};
DUMPER7_ASSERTS_USimpleBlendCameraNode;

// Class GameplayCameras.ViewTargetTransitionParamsBlendCameraNode
// 0x0010 (0x0048 - 0x0038)
class UViewTargetTransitionParamsBlendCameraNode final : public USimpleBlendCameraNode
{
public:
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ViewTargetTransitionParamsBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ViewTargetTransitionParamsBlendCameraNode")
	}
	static class UViewTargetTransitionParamsBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewTargetTransitionParamsBlendCameraNode>();
	}
};
DUMPER7_ASSERTS_UViewTargetTransitionParamsBlendCameraNode;

// Class GameplayCameras.UpdateTrackerCameraNode
// 0x0040 (0x0078 - 0x0038)
class UUpdateTrackerCameraNode final : public UCameraNode
{
public:
	struct FDoubleCameraParameter                 DoubleParameter;                                   // 0x0038(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector3dCameraParameter               VectorParameter;                                   // 0x0050(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UpdateTrackerCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UpdateTrackerCameraNode")
	}
	static class UUpdateTrackerCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdateTrackerCameraNode>();
	}
};
DUMPER7_ASSERTS_UUpdateTrackerCameraNode;

// Class GameplayCameras.AssetReferenceCameraNode
// 0x0000 (0x0000 - 0x0000)
class IAssetReferenceCameraNode final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetReferenceCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetReferenceCameraNode")
	}
	static class IAssetReferenceCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAssetReferenceCameraNode>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAssetReferenceCameraNode;

// Class GameplayCameras.CustomCameraNodeParameterProvider
// 0x0000 (0x0000 - 0x0000)
class ICustomCameraNodeParameterProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomCameraNodeParameterProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomCameraNodeParameterProvider")
	}
	static class ICustomCameraNodeParameterProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICustomCameraNodeParameterProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICustomCameraNodeParameterProvider;

// Class GameplayCameras.GameplayCameraSystemHost
// 0x0000 (0x0000 - 0x0000)
class IGameplayCameraSystemHost final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraSystemHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraSystemHost")
	}
	static class IGameplayCameraSystemHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameplayCameraSystemHost>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameplayCameraSystemHost;

// Class GameplayCameras.InputAxisBinding2DCameraNode
// 0x0050 (0x0100 - 0x00B0)
class UInputAxisBinding2DCameraNode final : public UCameraRigInput2DSlot
{
public:
	TArray<class UInputAction*>                   AxisActions;                                       // 0x00B0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	struct FBooleanCameraParameter                RevertAxisX;                                       // 0x00C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBooleanCameraParameter                RevertAxisY;                                       // 0x00D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2dCameraParameter               Multiplier;                                        // 0x00E0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputAxisBinding2DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputAxisBinding2DCameraNode")
	}
	static class UInputAxisBinding2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAxisBinding2DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInputAxisBinding2DCameraNode;

// Class GameplayCameras.ObjectTreeGraphObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectTreeGraphObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectTreeGraphObject")
	}
	static class IObjectTreeGraphObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IObjectTreeGraphObject;

// Class GameplayCameras.ObjectTreeGraphRootObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphRootObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectTreeGraphRootObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectTreeGraphRootObject")
	}
	static class IObjectTreeGraphRootObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphRootObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IObjectTreeGraphRootObject;

// Class GameplayCameras.PerlinNoiseLocationShakeCameraNode
// 0x0048 (0x0080 - 0x0038)
class UPerlinNoiseLocationShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  AmplitudeMultiplier;                               // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FrequencyMultiplier;                               // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteger32CameraParameter              Octaves;                                           // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       X;                                                 // 0x0068(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Y;                                                 // 0x0070(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Z;                                                 // 0x0078(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PerlinNoiseLocationShakeCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PerlinNoiseLocationShakeCameraNode")
	}
	static class UPerlinNoiseLocationShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseLocationShakeCameraNode>();
	}
};
DUMPER7_ASSERTS_UPerlinNoiseLocationShakeCameraNode;

// Class GameplayCameras.PerlinNoiseRotationShakeCameraNode
// 0x0048 (0x0080 - 0x0038)
class UPerlinNoiseRotationShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  AmplitudeMultiplier;                               // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FrequencyMultiplier;                               // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteger32CameraParameter              Octaves;                                           // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Yaw;                                               // 0x0068(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Pitch;                                             // 0x0070(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Roll;                                              // 0x0078(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PerlinNoiseRotationShakeCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PerlinNoiseRotationShakeCameraNode")
	}
	static class UPerlinNoiseRotationShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseRotationShakeCameraNode>();
	}
};
DUMPER7_ASSERTS_UPerlinNoiseRotationShakeCameraNode;

// Class GameplayCameras.BaseCameraObject
// 0x0080 (0x00A8 - 0x0028)
class UBaseCameraObject : public UObject
{
public:
	struct FCameraObjectInterface                 Interface;                                         // 0x0028(0x0030)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraObjectAllocationInfo            AllocationInfo;                                    // 0x0060(0x0028)(NativeAccessSpecifierPublic)
	struct FInstancedPropertyBag                  DefaultParameters;                                 // 0x0088(0x0010)(NativeAccessSpecifierPrivate)
	TArray<struct FCameraObjectInterfaceParameterDefinition> ParameterDefinitions;                   // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCameraObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCameraObject")
	}
	static class UBaseCameraObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCameraObject>();
	}
};
DUMPER7_ASSERTS_UBaseCameraObject;

// Class GameplayCameras.BlendStackCameraNode
// 0x0008 (0x0040 - 0x0038)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	ECameraBlendStackType                         BlendStackType;                                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraRigLayer                               Layer;                                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackCameraNode")
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendStackCameraNode;

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0010 (0x0048 - 0x0038)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCameraNode*                            RootNode;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackRootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackRootCameraNode")
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendStackRootCameraNode;

// Class GameplayCameras.CameraAsset
// 0x00B0 (0x00D8 - 0x0028)
class UCameraAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraDirector*                        CameraDirector;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0050(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  DefaultParameters;                                 // 0x0078(0x0010)(NativeAccessSpecifierPrivate)
	TArray<struct FCameraObjectInterfaceParameterDefinition> ParameterDefinitions;                   // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigAsset*>                ParameterOwners;                                   // 0x0098(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FCameraAssetAllocationInfo             AllocationInfo;                                    // 0x00A8(0x0020)(NativeAccessSpecifierPrivate)
	TArray<class UCameraRigAsset*>                CameraRigs;                                        // 0x00C8(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraAsset")
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};
DUMPER7_ASSERTS_UCameraAsset;

// Class GameplayCameras.CameraDirector
// 0x0018 (0x0040 - 0x0028)
class UCameraDirector : public UObject
{
public:
	struct FCameraRigProxyRedirectTable           CameraRigProxyRedirectTable;                       // 0x0028(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UCameraRigProxyTable*                   CameraRigProxyTable;                               // 0x0038(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraDirector")
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};
DUMPER7_ASSERTS_UCameraDirector;

// Class GameplayCameras.CameraObjectInterfaceParameterBase
// 0x0038 (0x0060 - 0x0028)
class UCameraObjectInterfaceParameterBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InterfaceParameterName;                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraNode*                            Target;                                            // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   TargetPropertyName;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraObjectInterfaceParameterBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraObjectInterfaceParameterBase")
	}
	static class UCameraObjectInterfaceParameterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceParameterBase>();
	}
};
DUMPER7_ASSERTS_UCameraObjectInterfaceParameterBase;

// Class GameplayCameras.CameraObjectInterfaceBlendableParameter
// 0x0020 (0x0080 - 0x0060)
class UCameraObjectInterfaceBlendableParameter final : public UCameraObjectInterfaceParameterBase
{
public:
	ECameraVariableType                           ParameterType;                                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          BlendableStructType;                               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bIsPreBlended;                                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableID                      PrivateVariableID;                                 // 0x0074(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraVariableAsset*                   PrivateVariable;                                   // 0x0078(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraObjectInterfaceBlendableParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraObjectInterfaceBlendableParameter")
	}
	static class UCameraObjectInterfaceBlendableParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceBlendableParameter>();
	}
};
DUMPER7_ASSERTS_UCameraObjectInterfaceBlendableParameter;

// Class GameplayCameras.CameraObjectInterfaceDataParameter
// 0x0018 (0x0078 - 0x0060)
class UCameraObjectInterfaceDataParameter final : public UCameraObjectInterfaceParameterBase
{
public:
	ECameraContextDataType                        DataType;                                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataContainerType               DataContainerType;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                DataTypeObject;                                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FCameraContextDataID                   PrivateDataID;                                     // 0x0070(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraObjectInterfaceDataParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraObjectInterfaceDataParameter")
	}
	static class UCameraObjectInterfaceDataParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceDataParameter>();
	}
};
DUMPER7_ASSERTS_UCameraObjectInterfaceDataParameter;

// Class GameplayCameras.CameraRigAsset
// 0x0080 (0x0128 - 0x00A8)
class UCameraRigAsset final : public UBaseCameraObject
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            RootNode;                                          // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x00D0(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0100(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0114(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigAsset")
	}
	static class UCameraRigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigAsset>();
	}
};
DUMPER7_ASSERTS_UCameraRigAsset;

// Class GameplayCameras.CameraRigProxyAsset
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyAsset final : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigProxyAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigProxyAsset")
	}
	static class UCameraRigProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyAsset>();
	}
};
DUMPER7_ASSERTS_UCameraRigProxyAsset;

// Class GameplayCameras.CameraRigProxyTable
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyTable final : public UObject
{
public:
	TArray<struct FCameraRigProxyRedirectTableEntry> Entries;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigProxyTable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigProxyTable")
	}
	static class UCameraRigProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyTable>();
	}
};
DUMPER7_ASSERTS_UCameraRigProxyTable;

// Class GameplayCameras.CameraRigTransitionCondition
// 0x0008 (0x0030 - 0x0028)
class UCameraRigTransitionCondition : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigTransitionCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigTransitionCondition")
	}
	static class UCameraRigTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransitionCondition>();
	}
};
DUMPER7_ASSERTS_UCameraRigTransitionCondition;

// Class GameplayCameras.CameraRigTransition
// 0x0028 (0x0050 - 0x0028)
class UCameraRigTransition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCameraRigTransitionCondition*>  Conditions;                                        // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UBlendCameraNode*                       Blend;                                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideInitialOrientation;                       // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCameraRigMerging;                            // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigTransition")
	}
	static class UCameraRigTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransition>();
	}
};
DUMPER7_ASSERTS_UCameraRigTransition;

// Class GameplayCameras.CameraShakeAsset
// 0x0048 (0x00F0 - 0x00A8)
class UCameraShakeAsset final : public UBaseCameraObject
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UShakeCameraNode*                       RootNode;                                          // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USimpleFixedTimeBlendCameraNode*        BlendIn;                                           // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USimpleFixedTimeBlendCameraNode*        BlendOut;                                          // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bIsSingleInstance;                                 // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x00D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraShakeAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraShakeAsset")
	}
	static class UCameraShakeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraShakeAsset>();
	}
};
DUMPER7_ASSERTS_UCameraShakeAsset;

// Class GameplayCameras.CameraValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UCameraValueInterpolator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraValueInterpolator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraValueInterpolator")
	}
	static class UCameraValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraValueInterpolator>();
	}
};
DUMPER7_ASSERTS_UCameraValueInterpolator;

// Class GameplayCameras.PopValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UPopValueInterpolator final : public UCameraValueInterpolator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PopValueInterpolator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PopValueInterpolator")
	}
	static class UPopValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopValueInterpolator>();
	}
};
DUMPER7_ASSERTS_UPopValueInterpolator;

// Class GameplayCameras.CameraVariableAsset
// 0x0018 (0x0040 - 0x0028)
class UCameraVariableAsset : public UObject
{
public:
	bool                                          bAutoReset;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInput;                                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraVariableAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraVariableAsset")
	}
	static class UCameraVariableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableAsset>();
	}
};
DUMPER7_ASSERTS_UCameraVariableAsset;

// Class GameplayCameras.BooleanCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UBooleanCameraVariable final : public UCameraVariableAsset
{
public:
	bool                                          bDefaultValue;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BooleanCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BooleanCameraVariable")
	}
	static class UBooleanCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBooleanCameraVariable>();
	}
};
DUMPER7_ASSERTS_UBooleanCameraVariable;

// Class GameplayCameras.Integer32CameraVariable
// 0x0008 (0x0048 - 0x0040)
class UInteger32CameraVariable final : public UCameraVariableAsset
{
public:
	int32                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Integer32CameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Integer32CameraVariable")
	}
	static class UInteger32CameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteger32CameraVariable>();
	}
};
DUMPER7_ASSERTS_UInteger32CameraVariable;

// Class GameplayCameras.FloatCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UFloatCameraVariable final : public UCameraVariableAsset
{
public:
	float                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FloatCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FloatCameraVariable")
	}
	static class UFloatCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatCameraVariable>();
	}
};
DUMPER7_ASSERTS_UFloatCameraVariable;

// Class GameplayCameras.DoubleCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UDoubleCameraVariable final : public UCameraVariableAsset
{
public:
	double                                        DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DoubleCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DoubleCameraVariable")
	}
	static class UDoubleCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoubleCameraVariable>();
	}
};
DUMPER7_ASSERTS_UDoubleCameraVariable;

// Class GameplayCameras.Vector2fCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UVector2fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2f                              DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector2fCameraVariable")
	}
	static const class FName& StaticName()
	{
