#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HttpBlueprint

#include "Basic.hpp"

#include "HttpBlueprint_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.AddHeader
// 0x0070 (0x0070 - 0x0000)
struct HttpBlueprintFunctionLibrary_AddHeader final
{
public:
	struct FHttpHeader                            HeaderObject;                                      // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NewHeader;                                         // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewHeaderValue;                                    // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_AddHeader;

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.GetAllHeaders
// 0x0060 (0x0060 - 0x0000)
struct HttpBlueprintFunctionLibrary_GetAllHeaders final
{
public:
	struct FHttpHeader                            HeaderObject;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_GetAllHeaders;

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.GetAllHeaders_Map
// 0x00A0 (0x00A0 - 0x0000)
struct HttpBlueprintFunctionLibrary_GetAllHeaders_Map final
{
public:
	struct FHttpHeader                            HeaderObject;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0050(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_GetAllHeaders_Map;

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.GetHeaderValue
// 0x0078 (0x0078 - 0x0000)
struct HttpBlueprintFunctionLibrary_GetHeaderValue final
{
public:
	struct FHttpHeader                            HeaderObject;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 HeaderName;                                        // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutHeaderValue;                                    // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_GetHeaderValue;

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.MakeRequestHeader
// 0x00A0 (0x00A0 - 0x0000)
struct HttpBlueprintFunctionLibrary_MakeRequestHeader final
{
public:
	TMap<class FString, class FString>            Headers;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHttpHeader                            OutHeader;                                         // 0x0050(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_MakeRequestHeader;

// Function HttpBlueprint.HttpBlueprintFunctionLibrary.RemoveHeader
// 0x0068 (0x0068 - 0x0000)
struct HttpBlueprintFunctionLibrary_RemoveHeader final
{
public:
	struct FHttpHeader                            HeaderObject;                                      // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 HeaderToRemove;                                    // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HttpBlueprintFunctionLibrary_RemoveHeader;

// Function HttpBlueprint.HttpRequestProxyObject.CreateHttpRequestProxyObject
// 0x0088 (0x0088 - 0x0000)
struct HttpRequestProxyObject_CreateHttpRequestProxyObject final
{
public:
	class FString                                 InURL;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InVerb;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHttpHeader                            InHeader;                                          // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FString                                 InBody;                                            // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHttpRequestProxyObject*                ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpRequestProxyObject_CreateHttpRequestProxyObject;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
