#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PBIK_structs.hpp"


SDK_NAMESPACE_START

// Enum IKRig.EFKChainTranslationMode
// NumValues: 0x0006
enum class EFKChainTranslationMode : uint8
{
	None                                     = 0,
	GloballyScaled                           = 1,
	Absolute                                 = 2,
	StretchBoneLengthUniformly               = 3,
	StretchBoneLengthNonUniformly            = 4,
	EFKChainTranslationMode_MAX              = 5,
};

// Enum IKRig.EFKChainRotationMode
// NumValues: 0x0007
enum class EFKChainRotationMode : uint8
{
	Interpolated                             = 0,
	OneToOne                                 = 1,
	OneToOneReversed                         = 2,
	MatchChain                               = 3,
	MatchScaledChain                         = 4,
	None                                     = 5,
	EFKChainRotationMode_MAX                 = 6,
};

// Enum IKRig.EAutoMapChainType
// NumValues: 0x0004
enum class EAutoMapChainType : uint8
{
	Exact                                    = 0,
	Fuzzy                                    = 1,
	Clear                                    = 2,
	EAutoMapChainType_MAX                    = 3,
};

// Enum IKRig.ERetargetTranslationMode
// NumValues: 0x0006
enum class ERetargetTranslationMode : uint8
{
	None                                     = 0,
	GloballyScaled                           = 1,
	Absolute                                 = 2,
	StretchBoneLengthUniformly               = 3,
	StretchBoneLengthNonUniformly            = 4,
	ERetargetTranslationMode_MAX             = 5,
};

// Enum IKRig.ERetargetRotationMode
// NumValues: 0x0007
enum class ERetargetRotationMode : uint8
{
	Interpolated                             = 0,
	OneToOne                                 = 1,
	OneToOneReversed                         = 2,
	MatchChain                               = 3,
	MatchScaledChain                         = 4,
	None                                     = 5,
	ERetargetRotationMode_MAX                = 6,
};

// Enum IKRig.ECopyOpSettingsContext
// NumValues: 0x0003
enum class ECopyOpSettingsContext : uint8
{
	PreInitialize                            = 0,
	Runtime                                  = 1,
	ECopyOpSettingsContext_MAX               = 2,
};

// Enum IKRig.EPinBoneType
// NumValues: 0x0005
enum class EPinBoneType : uint8
{
	FullTransform                            = 0,
	TranslateOnly                            = 1,
	RotateOnly                               = 2,
	ScaleOnly                                = 3,
	EPinBoneType_MAX                         = 4,
};

// Enum IKRig.EPinBoneTranslationMode
// NumValues: 0x0006
enum class EPinBoneTranslationMode : uint8
{
	CopyGlobalPosition                       = 0,
	CopyLocalPosition                        = 1,
	CopyLocalPositionRelativeOffset          = 2,
	CopyLocalPositionRelativeScaled          = 3,
	CopyGlobalPositionAndMaintainOffset      = 4,
	EPinBoneTranslationMode_MAX              = 5,
};

// Enum IKRig.EPinBoneRotationMode
// NumValues: 0x0003
enum class EPinBoneRotationMode : uint8
{
	CopyGlobalRotation                       = 0,
	MaintainOffsetFromBoneToCopyFrom         = 1,
	EPinBoneRotationMode_MAX                 = 2,
};

// Enum IKRig.ERootMotionSource
// NumValues: 0x0003
enum class ERootMotionSource : uint8
{
	CopyFromSourceRoot                       = 0,
	GenerateFromTargetPelvis                 = 1,
	ERootMotionSource_MAX                    = 2,
};

// Enum IKRig.ERootMotionHeightSource
// NumValues: 0x0003
enum class ERootMotionHeightSource : uint8
{
	CopyHeightFromSource                     = 0,
	SnapToGround                             = 1,
	ERootMotionHeightSource_MAX              = 2,
};

// Enum IKRig.EWarpingDirectionSource
// NumValues: 0x0004
enum class EWarpingDirectionSource : uint32
{
	Goals                                    = 0,
	Chain                                    = 1,
	RootBone                                 = 2,
	EWarpingDirectionSource_MAX              = 3,
};

// Enum IKRig.ERetargetSourceMode
// NumValues: 0x0004
enum class ERetargetSourceMode : uint8
{
	ParentSkeletalMeshComponent              = 0,
	CustomSkeletalMeshComponent              = 1,
	SourcePosePin                            = 2,
	ERetargetSourceMode_MAX                  = 3,
};

// Enum IKRig.ERetargetSourceOrTarget
// NumValues: 0x0003
enum class ERetargetSourceOrTarget : uint8
{
	Source                                   = 0,
	Target                                   = 1,
	ERetargetSourceOrTarget_MAX              = 2,
};

// Enum IKRig.EBasicAxis
// NumValues: 0x0007
enum class EBasicAxis : uint32
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	NegX                                     = 3,
	NegY                                     = 4,
	NegZ                                     = 5,
	EBasicAxis_MAX                           = 6,
};

// Enum IKRig.EIKRigGoalSpace
// NumValues: 0x0004
enum class EIKRigGoalSpace : uint8
{
	Component                                = 0,
	Additive                                 = 1,
	World                                    = 2,
	EIKRigGoalSpace_MAX                      = 3,
};

// Enum IKRig.EIKRigGoalTransformSource
// NumValues: 0x0004
enum class EIKRigGoalTransformSource : uint8
{
	Manual                                   = 0,
	Bone                                     = 1,
	ActorComponent                           = 2,
	EIKRigGoalTransformSource_MAX            = 3,
};

// ScriptStruct IKRig.RetargetPoleVectorSettings
// 0x0028 (0x0028 - 0x0000)
struct FRetargetPoleVectorSettings final
{
public:
	class FName                                   TargetChainName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AlignAlpha;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StaticAngularOffset;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MaintainOffset;                                    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRetargetPoleVectorSettings;

// ScriptStruct IKRig.IKRetargetOpSettingsBase
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FIKRetargetOpSettingsBase
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetOpSettingsBase;

// ScriptStruct IKRig.IKRetargetAlignPoleVectorOpSettings
// 0x0018 (0x0028 - 0x0010)
struct FIKRetargetAlignPoleVectorOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	class UIKRigDefinition*                       IKRigAsset;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FRetargetPoleVectorSettings>    ChainsToAlign;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetAlignPoleVectorOpSettings;

// ScriptStruct IKRig.IKRetargetOpBase
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FIKRetargetOpBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnabled;                                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParentOpName;                                      // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetOpBase;

// ScriptStruct IKRig.RetargetChainPair
// 0x0010 (0x0010 - 0x0000)
struct FRetargetChainPair final
{
public:
	class FName                                   TargetChainName;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceChainName;                                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetChainPair;

// ScriptStruct IKRig.RetargetChainMapping
// 0x0020 (0x0020 - 0x0000)
struct FRetargetChainMapping final
{
public:
	TArray<struct FRetargetChainPair>             ChainMap;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UIKRigDefinition*                       SourceIKRig;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UIKRigDefinition*                       TargetIKRig;                                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FRetargetChainMapping;

// ScriptStruct IKRig.IKRetargetAlignPoleVectorOp
// 0x0058 (0x0078 - 0x0020)
struct FIKRetargetAlignPoleVectorOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetAlignPoleVectorOpSettings   Settings;                                          // 0x0020(0x0028)(NativeAccessSpecifierPublic)
	struct FRetargetChainMapping                  ChainMapping;                                      // 0x0048(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetAlignPoleVectorOp;

// ScriptStruct IKRig.IKRetargetCopyBasePoseOpSettings
// 0x0010 (0x0020 - 0x0010)
struct FIKRetargetCopyBasePoseOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	bool                                          bCopyBasePose;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CopyBasePoseRoot;                                  // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetCopyBasePoseOpSettings;

// ScriptStruct IKRig.IKRetargetCopyBasePoseOp
// 0x0020 (0x0040 - 0x0020)
struct FIKRetargetCopyBasePoseOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetCopyBasePoseOpSettings      Settings;                                          // 0x0020(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetCopyBasePoseOp;

// ScriptStruct IKRig.CurveRemapPair
// 0x0010 (0x0010 - 0x0000)
struct FCurveRemapPair final
{
public:
	class FName                                   SourceCurve;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetCurve;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCurveRemapPair;

// ScriptStruct IKRig.IKRetargetCurveRemapOpSettings
// 0x0018 (0x0028 - 0x0010)
struct FIKRetargetCurveRemapOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	bool                                          bCopyAllSourceCurves;                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemapCurves;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCurveRemapPair>                CurvesToRemap;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetCurveRemapOpSettings;

// ScriptStruct IKRig.IKRetargetCurveRemapOp
// 0x0048 (0x0068 - 0x0020)
struct FIKRetargetCurveRemapOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetCurveRemapOpSettings        Settings;                                          // 0x0020(0x0028)(NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetCurveRemapOp;

// ScriptStruct IKRig.RetargetFKChainSettings
// 0x0028 (0x0028 - 0x0000)
struct FRetargetFKChainSettings final
{
public:
	class FName                                   TargetChainName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableFK;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFKChainRotationMode                          RotationMode;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotationAlpha;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFKChainTranslationMode                       TranslationMode;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TranslationAlpha;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetFKChainSettings;

// ScriptStruct IKRig.IKRetargetFKChainsOpSettings
// 0x0030 (0x0040 - 0x0010)
struct FIKRetargetFKChainsOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	class UIKRigDefinition*                       IKRigAsset;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FRetargetFKChainSettings>       ChainsToRetarget;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawChainLines;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawSingleBoneChains;                             // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ChainDrawThickness;                                // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ChainDrawSize;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetFKChainsOpSettings;

// ScriptStruct IKRig.IKRetargetFKChainsOp
// 0x0090 (0x00B0 - 0x0020)
struct FIKRetargetFKChainsOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetFKChainsOpSettings          Settings;                                          // 0x0020(0x0040)(NativeAccessSpecifierPublic)
	struct FRetargetChainMapping                  ChainMapping;                                      // 0x0060(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetFKChainsOp;

// ScriptStruct IKRig.RetargetIKChainSettings
// 0x0098 (0x0098 - 0x0000)
struct FRetargetIKChainSettings final
{
public:
	class FName                                   TargetChainName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableIK;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendToSource;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        BlendToSourceTranslation;                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        BlendToSourceRotation;                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BlendToSourceWeights;                              // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticOffset;                                      // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticLocalOffset;                                 // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StaticRotationOffset;                              // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ScaleVertical;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Extension;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetIKChainSettings;

// ScriptStruct IKRig.IKRetargetIKChainsOpSettings
// 0x0028 (0x0038 - 0x0010)
struct FIKRetargetIKChainsOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	TArray<struct FRetargetIKChainSettings>       ChainsToRetarget;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawFinalGoals;                                   // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawSourceLocations;                              // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GoalDrawSize;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GoalDrawThickness;                                 // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetIKChainsOpSettings;

// ScriptStruct IKRig.IKRetargetIKChainsOp
// 0x0048 (0x0068 - 0x0020)
struct FIKRetargetIKChainsOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetIKChainsOpSettings          Settings;                                          // 0x0020(0x0038)(NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetIKChainsOp;

// ScriptStruct IKRig.TargetChainSpeedPlantSettings
// 0x0018 (0x0018 - 0x0000)
struct FTargetChainSpeedPlantSettings final
{
public:
	bool                                          EnableSpeedPlanting;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpeedCurveName;                                    // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedThreshold;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnplantStiffness;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnplantCriticalDamping;                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetChainSpeedPlantSettings;

// ScriptStruct IKRig.TargetChainFKSettings
// 0x001C (0x001C - 0x0000)
struct FTargetChainFKSettings final
{
public:
	bool                                          EnableFK;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERetargetRotationMode                         RotationMode;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationAlpha;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERetargetTranslationMode                      TranslationMode;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TranslationAlpha;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoleVectorMatching;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PoleVectorMaintainOffset;                          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PoleVectorOffset;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetChainFKSettings;

// ScriptStruct IKRig.TargetChainIKSettings
// 0x0080 (0x0080 - 0x0000)
struct FTargetChainIKSettings final
{
public:
	bool                                          EnableIK;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendToSource;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendToSourceTranslation;                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendToSourceRotation;                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BlendToSourceWeights;                              // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticOffset;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticLocalOffset;                                 // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StaticRotationOffset;                              // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ScaleVertical;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Extension;                                         // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByIKWarping;                              // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTargetChainIKSettings;

// ScriptStruct IKRig.TargetChainSettings
// 0x00B8 (0x00B8 - 0x0000)
struct FTargetChainSettings final
{
public:
	struct FTargetChainFKSettings                 FK;                                                // 0x0000(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetChainIKSettings                 IK;                                                // 0x0020(0x0080)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetChainSpeedPlantSettings         SpeedPlanting;                                     // 0x00A0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetChainSettings;

// ScriptStruct IKRig.TargetRootSettings
// 0x0068 (0x0068 - 0x0000)
struct FTargetRootSettings final
{
public:
	float                                         RotationAlpha;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslationAlpha;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendToSource;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BlendToSourceWeights;                              // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleHorizontal;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleVertical;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TranslationOffset;                                 // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AffectIKHorizontal;                                // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AffectIKVertical;                                  // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetRootSettings;

// ScriptStruct IKRig.RetargetGlobalSettings
// 0x0034 (0x0034 - 0x0000)
struct FRetargetGlobalSettings final
{
public:
	bool                                          bEnableRoot;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFK;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableIK;                                         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePost;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyBasePose;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CopyBasePoseRoot;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceScaleFactor;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarping;                                          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EWarpingDirectionSource                       DirectionSource;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBasicAxis                                    ForwardDirection;                                  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DirectionChain;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpForwards;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SidewaysOffset;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpSplay;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetGlobalSettings;

// ScriptStruct IKRig.RetargetOpProfile
// 0x0020 (0x0020 - 0x0000)
struct FRetargetOpProfile final
{
public:
	class FName                                   OpToApplySettingsTo;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       SettingsToApply;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRetargetOpProfile;

// ScriptStruct IKRig.RetargetProfile
// 0x0128 (0x0128 - 0x0000)
struct FRetargetProfile final
{
public:
	TArray<struct FRetargetOpProfile>             RetargetOpProfiles;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bApplyTargetRetargetPose;                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetRetargetPoseName;                            // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplySourceRetargetPose;                          // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceRetargetPoseName;                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAllIKOff;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyChainSettings;                               // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FTargetChainSettings> ChainSettings;                                    // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bApplyRootSettings;                                // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetRootSettings                    RootSettings;                                      // 0x0088(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bApplyGlobalSettings;                              // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRetargetGlobalSettings                GlobalSettings;                                    // 0x00F4(0x0034)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetProfile;

// ScriptStruct IKRig.IKRetargetPelvisMotionOpSettings
// 0x00B8 (0x00C8 - 0x0010)
struct FIKRetargetPelvisMotionOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	struct FBoneReference                         SourcePelvisBone;                                  // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetPelvisBone;                                  // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	double                                        RotationAlpha;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        TranslationAlpha;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TranslationOffset;                                 // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        BlendToSourceTranslation;                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BlendToSourceTranslationWeights;                   // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ScaleHorizontal;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ScaleVertical;                                     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AffectIKHorizontal;                                // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AffectIKVertical;                                  // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebugDraw;                                  // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DebugDrawSize;                                     // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DebugDrawThickness;                                // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetPelvisMotionOpSettings;

// ScriptStruct IKRig.IKRetargetPelvisMotionOp
// 0x0220 (0x0240 - 0x0020)
struct alignas(0x10) FIKRetargetPelvisMotionOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetPelvisMotionOpSettings      Settings;                                          // 0x0020(0x00C8)(NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x158];                                     // 0x00E8(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetPelvisMotionOp;

// ScriptStruct IKRig.PinBoneData
// 0x0160 (0x0160 - 0x0000)
struct alignas(0x10) FPinBoneData final
{
public:
	struct FBoneReference                         BoneToCopyFrom;                                    // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         BoneToCopyTo;                                      // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x130];                                     // 0x0020(0x0130)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneToPin;                                         // 0x0150(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneToPinTo;                                       // 0x0158(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPinBoneData;

// ScriptStruct IKRig.IKRetargetPinBoneOpSettings
// 0x00E0 (0x00F0 - 0x0010)
struct FIKRetargetPinBoneOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	TArray<struct FPinBoneData>                   BonesToPin;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	ERetargetSourceOrTarget                       SkeletonToCopyFrom;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyTranslation;                                  // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPinBoneTranslationMode                       TranslationMode;                                   // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyRotation;                                     // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPinBoneRotationMode                          RotationMode;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyScale;                                        // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0026(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x9];                                       // 0x0027(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GlobalOffset;                                      // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             LocalOffset;                                       // 0x0090(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetPinBoneOpSettings;

// ScriptStruct IKRig.IKRetargetPinBoneOp
// 0x0100 (0x0120 - 0x0020)
struct FIKRetargetPinBoneOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetPinBoneOpSettings           Settings;                                          // 0x0020(0x00F0)(NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetPinBoneOp;

// ScriptStruct IKRig.IKRetargetAdditivePoseOpSettings
// 0x0010 (0x0020 - 0x0010)
struct FIKRetargetAdditivePoseOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	class FName                                   PoseToApply;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetAdditivePoseOpSettings;

// ScriptStruct IKRig.IKRetargetAdditivePoseOp
// 0x0028 (0x0048 - 0x0020)
struct FIKRetargetAdditivePoseOp final : public FIKRetargetOpBase
{
public:
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIKRetargetAdditivePoseOpSettings      Settings;                                          // 0x0028(0x0020)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FIKRetargetAdditivePoseOp;

// ScriptStruct IKRig.IKRetargetRootMotionOpSettings
// 0x00B0 (0x00C0 - 0x0010)
struct FIKRetargetRootMotionOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	struct FBoneReference                         SourceRoot;                                        // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetRoot;                                        // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ERootMotionSource                             RootMotionSource;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         TargetPelvis;                                      // 0x0034(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRotateWithPelvis;                                 // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionHeightSource                       RootHeightSource;                                  // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0xA];                                       // 0x0046(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GlobalOffset;                                      // 0x0050(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainOffsetFromPelvis;                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToNonRetargetedChildren;                 // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0xE];                                       // 0x00B2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetRootMotionOpSettings;

// ScriptStruct IKRig.IKRetargetRootMotionOp
// 0x0260 (0x0280 - 0x0020)
struct FIKRetargetRootMotionOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetRootMotionOpSettings        Settings;                                          // 0x0020(0x00C0)(NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x1A0];                                     // 0x00E0(0x01A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetRootMotionOp;

// ScriptStruct IKRig.IKRetargetRunIKRigOpSettings
// 0x0030 (0x0040 - 0x0010)
struct FIKRetargetRunIKRigOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	class UIKRigDefinition*                       IKRigAsset;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class FName>                           ExcludedGoals;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawGoals;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawGoalBoneLocations;                            // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GoalDrawSize;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GoalDrawThickness;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetRunIKRigOpSettings;

// ScriptStruct IKRig.IKRetargetRunIKRigOp
// 0x0188 (0x01A8 - 0x0020)
struct FIKRetargetRunIKRigOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetRunIKRigOpSettings          Settings;                                          // 0x0020(0x0040)(NativeAccessSpecifierPublic)
	struct FRetargetChainMapping                  ChainMapping;                                      // 0x0060(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x128];                                     // 0x0080(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIKRetargetRunIKRigOp;

// ScriptStruct IKRig.IKRetargetScaleSourceOpSettings
// 0x0008 (0x0018 - 0x0010)
struct FIKRetargetScaleSourceOpSettings final : public FIKRetargetOpSettingsBase
{
public:
	double                                        SourceScaleFactor;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetScaleSourceOpSettings;

// ScriptStruct IKRig.IKRetargetScaleSourceOp
// 0x0018 (0x0038 - 0x0020)
struct FIKRetargetScaleSourceOp final : public FIKRetargetOpBase
{
public:
	struct FIKRetargetScaleSourceOpSettings       Settings;                                          // 0x0020(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRetargetScaleSourceOp;

// ScriptStruct IKRig.RetargetSpeedPlantingSettings
// 0x0010 (0x0010 - 0x0000)
struct FRetargetSpeedPlantingSettings final
{
public:
	class FName                                   TargetChainName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpeedCurveName;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRetargetSpeedPlantingSettings;

// ScriptStruct IKRig.IKRetargetSpeedPlantingOpSettings
