#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKRig

#include "Basic.hpp"

#include "IKRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "PBIK_structs.hpp"


SDK_NAMESPACE_START

// Class IKRig.IKRetargetOpControllerBase
// 0x0008 (0x0030 - 0x0028)
class UIKRetargetOpControllerBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetOpControllerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetOpControllerBase")
	}
	static class UIKRetargetOpControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetOpControllerBase>();
	}
};
DUMPER7_ASSERTS_UIKRetargetOpControllerBase;

// Class IKRig.RetargetChainSettings
// 0x0160 (0x0188 - 0x0028)
class URetargetChainSettings final : public UObject
{
public:
	class FName                                   SourceChain;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetChain;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetChainSettings                   Settings;                                          // 0x0038(0x00B8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CopyPoseUsingFK;                                   // 0x00F0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERetargetRotationMode                         RotationMode;                                      // 0x00F1(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationAlpha;                                     // 0x00F4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERetargetTranslationMode                      TranslationMode;                                   // 0x00F8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TranslationAlpha;                                  // 0x00FC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DriveIKGoal;                                       // 0x0100(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendToSource;                                     // 0x0104(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BlendToSourceWeights;                              // 0x0108(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticOffset;                                      // 0x0120(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticLocalOffset;                                 // 0x0138(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StaticRotationOffset;                              // 0x0150(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Extension;                                         // 0x0168(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSpeedCurveToPlantIK;                            // 0x016C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpeedCurveName;                                    // 0x0170(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityThreshold;                                 // 0x0178(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnplantStiffness;                                  // 0x017C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnplantCriticalDamping;                            // 0x0180(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RetargetChainSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RetargetChainSettings")
	}
	static class URetargetChainSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetChainSettings>();
	}
};
DUMPER7_ASSERTS_URetargetChainSettings;

// Class IKRig.IKRetargetAlignPoleVectorController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetAlignPoleVectorController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetAlignPoleVectorOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetAlignPoleVectorOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetAlignPoleVectorController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetAlignPoleVectorController")
	}
	static class UIKRetargetAlignPoleVectorController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetAlignPoleVectorController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetAlignPoleVectorController;

// Class IKRig.IKRetargetCopyBasePoseController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetCopyBasePoseController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetCopyBasePoseOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetCopyBasePoseOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetCopyBasePoseController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetCopyBasePoseController")
	}
	static class UIKRetargetCopyBasePoseController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetCopyBasePoseController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetCopyBasePoseController;

// Class IKRig.IKRetargetCurveRemapController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetCurveRemapController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetCurveRemapOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetCurveRemapOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetCurveRemapController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetCurveRemapController")
	}
	static class UIKRetargetCurveRemapController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetCurveRemapController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetCurveRemapController;

// Class IKRig.RetargetOpBase
// 0x0008 (0x0030 - 0x0028)
class URetargetOpBase : public UObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RetargetOpBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RetargetOpBase")
	}
	static class URetargetOpBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetOpBase>();
	}
};
DUMPER7_ASSERTS_URetargetOpBase;

// Class IKRig.RetargetProfileLibrary
// 0x0000 (0x0028 - 0x0028)
class URetargetProfileLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FRetargetProfile CopyRetargetProfileFromRetargetAsset(const class UIKRetargeter* InRetargetAsset);
	static class UIKRetargetOpControllerBase* GetOpControllerFromRetargetProfile(struct FRetargetProfile& InRetargetProfile, const class FName InRetargetOpName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RetargetProfileLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RetargetProfileLibrary")
	}
	static class URetargetProfileLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetProfileLibrary>();
	}
};
DUMPER7_ASSERTS_URetargetProfileLibrary;

// Class IKRig.CurveRemapOp
// 0x0018 (0x0048 - 0x0030)
class UCurveRemapOp final : public URetargetOpBase
{
public:
	TArray<struct FCurveRemapPair>                CurvesToRemap;                                     // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bCopyAllSourceCurves;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveRemapOp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveRemapOp")
	}
	static class UCurveRemapOp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveRemapOp>();
	}
};
DUMPER7_ASSERTS_UCurveRemapOp;

// Class IKRig.IKRetargetIKChainsController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetIKChainsController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetIKChainsOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetIKChainsOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetIKChainsController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetIKChainsController")
	}
	static class UIKRetargetIKChainsController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetIKChainsController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetIKChainsController;

// Class IKRig.IKRetargetFKChainsController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetFKChainsController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetFKChainsOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetFKChainsOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetFKChainsController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetFKChainsController")
	}
	static class UIKRetargetFKChainsController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetFKChainsController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetFKChainsController;

// Class IKRig.RetargetRootSettings
// 0x00C0 (0x00E8 - 0x0028)
class URetargetRootSettings final : public UObject
{
public:
	struct FTargetRootSettings                    Settings;                                          // 0x0028(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          RetargetRootTranslation;                           // 0x0090(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GlobalScaleHorizontal;                             // 0x0094(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalScaleVertical;                               // 0x0098(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BlendToSource;                                     // 0x00A0(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticOffset;                                      // 0x00B8(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StaticRotationOffset;                              // 0x00D0(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RetargetRootSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RetargetRootSettings")
	}
	static class URetargetRootSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetRootSettings>();
	}
};
DUMPER7_ASSERTS_URetargetRootSettings;

// Class IKRig.IKRetargetGlobalSettings
// 0x0038 (0x0060 - 0x0028)
class UIKRetargetGlobalSettings final : public UObject
{
public:
	struct FRetargetGlobalSettings                Settings;                                          // 0x0028(0x0034)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetGlobalSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetGlobalSettings")
	}
	static class UIKRetargetGlobalSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetGlobalSettings>();
	}
};
DUMPER7_ASSERTS_UIKRetargetGlobalSettings;

// Class IKRig.RetargetOpStack
// 0x0010 (0x0038 - 0x0028)
class URetargetOpStack final : public UObject
{
public:
	TArray<class URetargetOpBase*>                RetargetOps;                                       // 0x0028(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RetargetOpStack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RetargetOpStack")
	}
	static class URetargetOpStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetOpStack>();
	}
};
DUMPER7_ASSERTS_URetargetOpStack;

// Class IKRig.IKGoalCreatorInterface
// 0x0000 (0x0000 - 0x0000)
class IIKGoalCreatorInterface final
{
public:
	void AddIKGoals(TMap<class FName, struct FIKRigGoal>* OutGoals);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKGoalCreatorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKGoalCreatorInterface")
	}
	static class IIKGoalCreatorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IIKGoalCreatorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IIKGoalCreatorInterface;

// Class IKRig.IKRetargetPelvisMotionController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetPelvisMotionController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetPelvisMotionOpSettings GetSettings();
	class FName GetSourcePelvisBone();
	class FName GetTargetPelvisBone();
	void SetSettings(const struct FIKRetargetPelvisMotionOpSettings& InSettings);
	void SetSourcePelvisBone(const class FName InSourcePelvisBone);
	void SetTargetPelvisBone(const class FName InTargetPelvisBone);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetPelvisMotionController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetPelvisMotionController")
	}
	static class UIKRetargetPelvisMotionController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetPelvisMotionController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetPelvisMotionController;

// Class IKRig.IKRetargetPinBoneController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetPinBoneController final : public UIKRetargetOpControllerBase
{
public:
	void ClearAllBonePairs();
	TMap<class FName, class FName> GetAllBonePairs();
	struct FIKRetargetPinBoneOpSettings GetSettings();
	void SetBonePair(const class FName InBoneToCopyFrom, const class FName InBoneToCopyTo);
	void SetSettings(const struct FIKRetargetPinBoneOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetPinBoneController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetPinBoneController")
	}
	static class UIKRetargetPinBoneController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetPinBoneController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetPinBoneController;

// Class IKRig.PinBoneOp
// 0x00F0 (0x0120 - 0x0030)
class UPinBoneOp final : public URetargetOpBase
{
public:
	TArray<struct FPinBoneData>                   BonesToPin;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ERetargetSourceOrTarget                       PinTo;                                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyTranslation;                                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyRotation;                                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyScale;                                        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPinBoneTranslationMode                       TranslationMode;                                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPinBoneRotationMode                          RotationMode;                                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0xA];                                       // 0x0046(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GlobalOffset;                                      // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             LocalOffset;                                       // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainOffset;                                   // 0x0110(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPinBoneType                                  PinType;                                           // 0x0111(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_112[0xE];                                      // 0x0112(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PinBoneOp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PinBoneOp")
	}
	static class UPinBoneOp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPinBoneOp>();
	}
};
DUMPER7_ASSERTS_UPinBoneOp;

// Class IKRig.IKRetargetAdditivePoseController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetAdditivePoseController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetAdditivePoseOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetAdditivePoseOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetAdditivePoseController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetAdditivePoseController")
	}
	static class UIKRetargetAdditivePoseController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetAdditivePoseController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetAdditivePoseController;

// Class IKRig.IKRetargetRootMotionController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetRootMotionController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetRootMotionOpSettings GetSettings();
	class FName GetSourceRootBone();
	class FName GetTargetPelvisBone();
	class FName GetTargetRootBone();
	void SetSettings(const struct FIKRetargetRootMotionOpSettings& InSettings);
	void SetSourceRootBone(const class FName InSourceRootBone);
	void SetTargetPelvisBone(const class FName InTargetPelvisBone);
	void SetTargetRootBone(const class FName InTargetRootBone);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetRootMotionController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetRootMotionController")
	}
	static class UIKRetargetRootMotionController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetRootMotionController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetRootMotionController;

// Class IKRig.RootMotionGeneratorOp
// 0x0080 (0x00B0 - 0x0030)
class URootMotionGeneratorOp final : public URetargetOpBase
{
public:
	class FName                                   SourceRootBone;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetRootBone;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetPelvisBone;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionSource                             RootMotionSource;                                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionHeightSource                       RootHeightSource;                                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToNonRetargetedChildren;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainOffsetFromPelvis;                         // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateWithPelvis;                                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GlobalOffset;                                      // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RootMotionGeneratorOp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RootMotionGeneratorOp")
	}
	static class URootMotionGeneratorOp* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionGeneratorOp>();
	}
};
DUMPER7_ASSERTS_URootMotionGeneratorOp;

// Class IKRig.IKRetargetRunIKRigController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetRunIKRigController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetRunIKRigOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetRunIKRigOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetRunIKRigController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetRunIKRigController")
	}
	static class UIKRetargetRunIKRigController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetRunIKRigController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetRunIKRigController;

// Class IKRig.IKRetargetScaleSourceController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetScaleSourceController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetScaleSourceOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetScaleSourceOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetScaleSourceController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetScaleSourceController")
	}
	static class UIKRetargetScaleSourceController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetScaleSourceController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetScaleSourceController;

// Class IKRig.IKRetargetSpeedPlantingController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetSpeedPlantingController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetSpeedPlantingOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetSpeedPlantingOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetSpeedPlantingController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetSpeedPlantingController")
	}
	static class UIKRetargetSpeedPlantingController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetSpeedPlantingController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetSpeedPlantingController;

// Class IKRig.IKRetargetStrideWarpingController
// 0x0000 (0x0030 - 0x0030)
class UIKRetargetStrideWarpingController final : public UIKRetargetOpControllerBase
{
public:
	struct FIKRetargetStrideWarpingOpSettings GetSettings();
	void SetSettings(const struct FIKRetargetStrideWarpingOpSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetStrideWarpingController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetStrideWarpingController")
	}
	static class UIKRetargetStrideWarpingController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetStrideWarpingController>();
	}
};
DUMPER7_ASSERTS_UIKRetargetStrideWarpingController;

// Class IKRig.IKRigComponent
// 0x0020 (0x00D8 - 0x00B8)
class UIKRigComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAllGoals();
	void SetIKRigGoal(const struct FIKRigGoal& Goal);
	void SetIKRigGoalPositionAndRotation(const class FName GoalName, const struct FVector& position, const struct FQuat& Rotation, const float PositionAlpha, const float RotationAlpha);
	void SetIKRigGoalTransform(const class FName GoalName, const struct FTransform& Transform, const float PositionAlpha, const float RotationAlpha);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigComponent")
	}
	static class UIKRigComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigComponent>();
	}
};
DUMPER7_ASSERTS_UIKRigComponent;

// Class IKRig.IKRetargeter
// 0x01E0 (0x0208 - 0x0028)
class UIKRetargeter final : public UObject
{
public:
	int32                                         Version;                                           // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKRigDefinition*                       SourceIKRigAsset;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UIKRigDefinition*                       TargetIKRigAsset;                                  // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FInstancedStruct>               RetargetOps;                                       // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FRetargetProfile>    Profiles;                                          // 0x0050(0x0050)(NativeAccessSpecifierPrivate)
	class FName                                   CurrentProfile;                                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FIKRetargetPose>     SourceRetargetPoses;                               // 0x00A8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FIKRetargetPose>     TargetRetargetPoses;                               // 0x00F8(0x0050)(NativeAccessSpecifierPrivate)
	class FName                                   CurrentSourceRetargetPose;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CurrentTargetRetargetPose;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRetargetRoot;                                     // 0x0158(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRetargetFK;                                       // 0x0159(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRetargetIK;                                       // 0x015A(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetActorOffset;                                 // 0x015C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TargetActorScale;                                  // 0x0160(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FIKRetargetPose>     RetargetPoses;                                     // 0x0168(0x0050)(NativeAccessSpecifierPrivate)
	class FName                                   CurrentRetargetPose;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRetargetChainMapping                  ChainMap;                                          // 0x01C0(0x0020)(Deprecated, NativeAccessSpecifierPrivate)
	TArray<class URetargetChainSettings*>         ChainSettings;                                     // 0x01E0(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	class URetargetRootSettings*                  RootSettings;                                      // 0x01F0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UIKRetargetGlobalSettings*              GlobalSettings;                                    // 0x01F8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class URetargetOpStack*                       OpStack;                                           // 0x0200(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static struct FTargetChainSettings GetChainSettingsFromRetargetAsset(const class UIKRetargeter* RetargetAsset, const class FName TargetChainName, const class FName OptionalProfileName);
	static struct FTargetChainSettings GetChainSettingsFromRetargetProfile(struct FRetargetProfile& RetargetProfile, const class FName TargetChainName);
	static struct FTargetChainSettings GetChainUsingGoalFromRetargetAsset(const class UIKRetargeter* RetargetAsset, const class FName IKGoalName);
	static void GetGlobalSettingsFromRetargetAsset(const class UIKRetargeter* RetargetAsset, const class FName OptionalProfileName, struct FRetargetGlobalSettings* OutSettings);
	static struct FRetargetGlobalSettings GetGlobalSettingsFromRetargetProfile(struct FRetargetProfile& RetargetProfile);
	static void GetRootSettingsFromRetargetAsset(const class UIKRetargeter* RetargetAsset, const class FName OptionalProfileName, struct FTargetRootSettings* OutSettings);
	static struct FTargetRootSettings GetRootSettingsFromRetargetProfile(struct FRetargetProfile& RetargetProfile);
	static void SetChainFKSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FTargetChainFKSettings& FKSettings, const class FName TargetChainName);
	static void SetChainIKSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FTargetChainIKSettings& IKSettings, const class FName TargetChainName);
	static void SetChainSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FTargetChainSettings& ChainSettings_0, const class FName TargetChainName);
	static void SetChainSpeedPlantSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FTargetChainSpeedPlantSettings& SpeedPlantSettings, const class FName TargetChainName);
	static void SetGlobalSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FRetargetGlobalSettings& GlobalSettings_0);
	static void SetRootSettingsInRetargetProfile(struct FRetargetProfile& RetargetProfile, const struct FTargetRootSettings& RootSettings_0);

	bool HasSourceIKRig() const;
	bool HasTargetIKRig() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargeter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargeter")
	}
	static class UIKRetargeter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargeter>();
	}
};
DUMPER7_ASSERTS_UIKRetargeter;

// Class IKRig.IKRetargetProcessor
// 0x02B0 (0x02D8 - 0x0028)
class UIKRetargetProcessor final : public UObject
{
public:
	uint8                                         Pad_28[0x2B0];                                     // 0x0028(0x02B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRetargetProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRetargetProcessor")
	}
	static class UIKRetargetProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetProcessor>();
	}
};
DUMPER7_ASSERTS_UIKRetargetProcessor;

// Class IKRig.IKRigEffectorGoal
// 0x00D8 (0x0100 - 0x0028)
class UIKRigEffectorGoal final : public UObject
{
public:
	class FName                                   GoalName;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionAlpha;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationAlpha;                                     // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CurrentTransform;                                  // 0x0040(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             InitialTransform;                                  // 0x00A0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigEffectorGoal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigEffectorGoal")
	}
	static class UIKRigEffectorGoal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigEffectorGoal>();
	}
};
DUMPER7_ASSERTS_UIKRigEffectorGoal;

// Class IKRig.IKRigDefinition
// 0x00E8 (0x0110 - 0x0028)
class UIKRigDefinition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           PreviewSkeletalMesh;                               // 0x0030(0x0028)(Edit, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIKRigSkeleton                         Skeleton;                                          // 0x0058(0x0070)(NativeAccessSpecifierPrivate)
	TArray<class UIKRigEffectorGoal*>             Goals;                                             // 0x00C8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FInstancedStruct>               SolverStack;                                       // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FRetargetDefinition                    RetargetDefinition;                                // 0x00E8(0x0018)(NativeAccessSpecifierPrivate)
	TArray<class UIKRigSolver*>                   Solvers;                                           // 0x0100(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigDefinition")
	}
	static class UIKRigDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigDefinition>();
	}
};
DUMPER7_ASSERTS_UIKRigDefinition;

// Class IKRig.IKRigProcessor
// 0x0160 (0x0188 - 0x0028)
class UIKRigProcessor final : public UObject
{
public:
	uint8                                         Pad_28[0x160];                                     // 0x0028(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigProcessor")
	}
	static class UIKRigProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigProcessor>();
	}
};
DUMPER7_ASSERTS_UIKRigProcessor;

// Class IKRig.IKRigSolverControllerBase
// 0x0008 (0x0030 - 0x0028)
class UIKRigSolverControllerBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetEnabled();
	void SetEnabled(bool bIsEnabled);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigSolverControllerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigSolverControllerBase")
	}
	static class UIKRigSolverControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigSolverControllerBase>();
	}
};
DUMPER7_ASSERTS_UIKRigSolverControllerBase;

// Class IKRig.IKRigBodyMoverController
// 0x0000 (0x0030 - 0x0030)
class UIKRigBodyMoverController final : public UIKRigSolverControllerBase
{
public:
	struct FIKRigBodyMoverGoalSettings GetGoalSettings(const class FName InGoalName);
	struct FIKRigBodyMoverSettings GetSolverSettings();
	void SetGoalSettings(const class FName InGoalName, const struct FIKRigBodyMoverGoalSettings& InSettings);
	void SetSolverSettings(const struct FIKRigBodyMoverSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigBodyMoverController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigBodyMoverController")
	}
	static class UIKRigBodyMoverController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigBodyMoverController>();
	}
};
DUMPER7_ASSERTS_UIKRigBodyMoverController;

// Class IKRig.IKRig_BodyMoverEffector
// 0x0018 (0x0040 - 0x0028)
class UIKRig_BodyMoverEffector final : public UObject
{
public:
	class FName                                   GoalName;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InfluenceMultiplier;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRig_BodyMoverEffector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRig_BodyMoverEffector")
	}
	static class UIKRig_BodyMoverEffector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRig_BodyMoverEffector>();
	}
};
DUMPER7_ASSERTS_UIKRig_BodyMoverEffector;

// Class IKRig.IKRigSolver
// 0x0008 (0x0030 - 0x0028)
class UIKRigSolver : public UObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigSolver")
	}
	static class UIKRigSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigSolver>();
	}
};
DUMPER7_ASSERTS_UIKRigSolver;

// Class IKRig.IKRig_BodyMover
// 0x0048 (0x0078 - 0x0030)
class UIKRig_BodyMover final : public UIKRigSolver
{
public:
	class FName                                   RootBone;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionAlpha;                                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionPositiveX;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionNegativeX;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionPositiveY;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionNegativeY;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionPositiveZ;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionNegativeZ;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationAlpha;                                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateXAlpha;                                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateYAlpha;                                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateZAlpha;                                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UIKRig_BodyMoverEffector*>       Effectors;                                         // 0x0068(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRig_BodyMover")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRig_BodyMover")
	}
	static class UIKRig_BodyMover* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRig_BodyMover>();
	}
};
DUMPER7_ASSERTS_UIKRig_BodyMover;

// Class IKRig.IKRigFBIKController
// 0x0000 (0x0030 - 0x0030)
class UIKRigFBIKController final : public UIKRigSolverControllerBase
{
public:
	struct FIKRigFBIKBoneSettings GetBoneSettings(const class FName InBoneName);
	struct FIKRigFBIKGoalSettings GetGoalSettings(const class FName InGoalName);
	struct FIKRigFBIKSettings GetSolverSettings();
	void SetBoneSettings(const class FName InBoneName, const struct FIKRigFBIKBoneSettings& InSettings);
	void SetGoalSettings(const class FName InGoalName, const struct FIKRigFBIKGoalSettings& InSettings);
	void SetSolverSettings(const struct FIKRigFBIKSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigFBIKController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigFBIKController")
	}
	static class UIKRigFBIKController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigFBIKController>();
	}
};
DUMPER7_ASSERTS_UIKRigFBIKController;

// Class IKRig.IKRig_FBIKEffector
// 0x0020 (0x0048 - 0x0028)
class UIKRig_FBIKEffector final : public UObject
{
public:
	class FName                                   GoalName;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChainDepth;                                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StrengthAlpha;                                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PullChainAlpha;                                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PinRotation;                                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRig_FBIKEffector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRig_FBIKEffector")
	}
	static class UIKRig_FBIKEffector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRig_FBIKEffector>();
	}
};
DUMPER7_ASSERTS_UIKRig_FBIKEffector;

// Class IKRig.IKRig_FBIKBoneSettings
// 0x0050 (0x0078 - 0x0028)
class UIKRig_FBIKBoneSettings final : public UObject
{
public:
	class FName                                   bone;                                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationStiffness;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionStiffness;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBIKLimitType                                X;                                                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinX;                                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxX;                                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBIKLimitType                                Y;                                                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinY;                                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxY;                                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBIKLimitType                                Z;                                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinZ;                                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxZ;                                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePreferredAngles;                               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreferredAngles;                                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRig_FBIKBoneSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRig_FBIKBoneSettings")
	}
	static class UIKRig_FBIKBoneSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRig_FBIKBoneSettings>();
	}
};
DUMPER7_ASSERTS_UIKRig_FBIKBoneSettings;

// Class IKRig.IKRigFBIKSolver
// 0x0068 (0x0098 - 0x0030)
class UIKRigFBIKSolver final : public UIKRigSolver
{
public:
	class FName                                   RootBone;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Iterations;                                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubIterations;                                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MassMultiplier;                                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowStretch;                                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBIKRootBehavior                             RootBehavior;                                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRootPrePullSettings                   PrePullRootSettings;                               // 0x0048(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         PullChainAlpha;                                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle;                                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverRelaxation;                                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UIKRig_FBIKEffector*>            Effectors;                                         // 0x0078(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UIKRig_FBIKBoneSettings*>        BoneSettings;                                      // 0x0088(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	TArray<class UIKRig_FBIKBoneSettings*> GetBoneSettings();
	TArray<class UIKRig_FBIKEffector*> GetEffectors();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigFBIKSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigFBIKSolver")
	}
	static class UIKRigFBIKSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigFBIKSolver>();
	}
};
DUMPER7_ASSERTS_UIKRigFBIKSolver;

// Class IKRig.IKRigLimbSolverController
// 0x0000 (0x0030 - 0x0030)
class UIKRigLimbSolverController final : public UIKRigSolverControllerBase
{
public:
	struct FIKRigLimbSolverSettings GetSolverSettings();
	void SetSolverSettings(const struct FIKRigLimbSolverSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRigLimbSolverController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRigLimbSolverController")
	}
	static class UIKRigLimbSolverController* GetDefaultObj()
	{
