#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImgMedia

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum ImgMedia.EMediaSourceEncoding
// NumValues: 0x0006
enum class EMediaSourceEncoding : uint8
{
	MSE_None                                 = 0,
	MSE_Linear                               = 1,
	MSE_sRGB                                 = 2,
	MSE_ST2084                               = 3,
	MSE_SLog3                                = 12,
	MSE_MAX                                  = 13,
};

// ScriptStruct ImgMedia.MediaSourceColorSettings
// 0x0050 (0x0050 - 0x0000)
struct FMediaSourceColorSettings final
{
public:
	EMediaSourceEncoding                          EncodingOverride;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureColorSpace                            ColorSpaceOverride;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RedChromaticityCoordinate;                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              GreenChromaticityCoordinate;                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BlueChromaticityCoordinate;                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WhiteChromaticityCoordinate;                       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureChromaticAdaptationMethod             ChromaticAdaptationMethod;                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMediaSourceColorSettings;

// ScriptStruct ImgMedia.ImgMediaSourceCustomizationSequenceProxy
// 0x0001 (0x0001 - 0x0000)
struct FImgMediaSourceCustomizationSequenceProxy final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FImgMediaSourceCustomizationSequenceProxy;

SDK_NAMESPACE_END
