#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Landscape

#include "Basic.hpp"

#include "Landscape_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class Landscape.MaterialExpressionLandscapeLayerSwitch
// 0x0060 (0x0110 - 0x00B0)
class UMaterialExpressionLandscapeLayerSwitch final : public UMaterialExpression
{
public:
	struct FExpressionInput                       LayerUsed;                                         // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       LayerNotUsed;                                      // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviewUsed : 1;                                   // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapeLayerSwitch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapeLayerSwitch")
	}
	static class UMaterialExpressionLandscapeLayerSwitch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapeLayerSwitch>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapeLayerSwitch;

// Class Landscape.ControlPointMeshComponent
// 0x0010 (0x0620 - 0x0610)
class UControlPointMeshComponent final : public UStaticMeshComponent
{
public:
	float                                         VirtualTextureMainPassMaxDrawDistance;             // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_614[0xC];                                      // 0x0614(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ControlPointMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControlPointMeshComponent")
	}
	static class UControlPointMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlPointMeshComponent>();
	}
};
DUMPER7_ASSERTS_UControlPointMeshComponent;

// Class Landscape.LandscapeHeightmapTextureEdgeFixup
// 0x0068 (0x0090 - 0x0028)
class ULandscapeHeightmapTextureEdgeFixup final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeHeightmapTextureEdgeFixup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeHeightmapTextureEdgeFixup")
	}
	static class ULandscapeHeightmapTextureEdgeFixup* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeHeightmapTextureEdgeFixup>();
	}
};
DUMPER7_ASSERTS_ULandscapeHeightmapTextureEdgeFixup;

// Class Landscape.MaterialExpressionLandscapeLayerWeight
// 0x0078 (0x0128 - 0x00B0)
class UMaterialExpressionLandscapeLayerWeight final : public UMaterialExpression
{
public:
	struct FExpressionInput                       base;                                              // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Layer;                                             // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviewWeight;                                     // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ConstBase;                                         // 0x0110(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapeLayerWeight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapeLayerWeight")
	}
	static class UMaterialExpressionLandscapeLayerWeight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapeLayerWeight>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapeLayerWeight;

// Class Landscape.LandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport
// 0x0000 (0x0000 - 0x0000)
class ILandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport")
	}
	static class ILandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ILandscapeBrushRenderCallAdapter_GlobalMergeLegacySupport;

// Class Landscape.MaterialExpressionLandscapePhysicalMaterialOutput
// 0x0010 (0x00C0 - 0x00B0)
class UMaterialExpressionLandscapePhysicalMaterialOutput final : public UMaterialExpressionCustomOutput
{
public:
	TArray<struct FPhysicalMaterialInput>         Inputs;                                            // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapePhysicalMaterialOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapePhysicalMaterialOutput")
	}
	static class UMaterialExpressionLandscapePhysicalMaterialOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapePhysicalMaterialOutput>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapePhysicalMaterialOutput;

// Class Landscape.LandscapeSplineInterface
// 0x0000 (0x0000 - 0x0000)
class ILandscapeSplineInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeSplineInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeSplineInterface")
	}
	static class ILandscapeSplineInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILandscapeSplineInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ILandscapeSplineInterface;

// Class Landscape.MaterialExpressionLandscapeVisibilityMask
// 0x0000 (0x00B0 - 0x00B0)
class UMaterialExpressionLandscapeVisibilityMask final : public UMaterialExpression
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapeVisibilityMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapeVisibilityMask")
	}
	static class UMaterialExpressionLandscapeVisibilityMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapeVisibilityMask>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapeVisibilityMask;

// Class Landscape.LandscapeProxy
// 0x0518 (0x07C0 - 0x02A8)
class ALandscapeProxy : public APartitionActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULandscapeSplinesComponent*             SplineComponent;                                   // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FGuid                                  LandscapeGuid;                                     // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OriginalLandscapeGuid;                             // 0x02C8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNanite;                                     // 0x02D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLandscapePerLODMaterialOverride> PerLODOverrideMaterials;                         // 0x02E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDisableRuntimeGrassMapGeneration;                 // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              LandscapeSectionOffset;                            // 0x02F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLODLevel;                                       // 0x02FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD0ScreenSize;                                    // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LODGroupKey;                                       // 0x0304(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD0DistributionSetting;                           // 0x0308(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODDistributionSetting;                            // 0x030C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerQualityLevelFloat                  ScalableLOD0ScreenSize;                            // 0x0310(0x0068)(Edit, NativeAccessSpecifierPublic)
	struct FPerQualityLevelFloat                  ScalableLOD0DistributionSetting;                   // 0x0378(0x0068)(Edit, NativeAccessSpecifierPublic)
	struct FPerQualityLevelFloat                  ScalableLODDistributionSetting;                    // 0x03E0(0x0068)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseScalableLODSettings;                           // 0x0448(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LODBlendRange;                                     // 0x044C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StaticLightingLOD;                                 // 0x0450(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      DefaultPhysMaterial;                               // 0x0458(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         StreamingDistanceMultiplier;                       // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LandscapeMaterial;                                 // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMaterialInterface*                     LandscapeHoleMaterial;                             // 0x0470(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class URuntimeVirtualTexture*>         RuntimeVirtualTextures;                            // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bSetCreateRuntimeVirtualTextureVolumes;            // 0x0488(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVirtualTextureRenderWithQuad;                     // 0x0489(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVirtualTextureRenderWithQuadHQ;                   // 0x048A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48B[0x1];                                      // 0x048B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureNumLods;                             // 0x048C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureLodBias;                             // 0x0490(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            VirtualTextureRenderPassType;                      // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NegativeZBoundsExtension;                          // 0x0498(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositiveZBoundsExtension;                          // 0x049C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULandscapeComponent*>            LandscapeComponents;                               // 0x04A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class ULandscapeHeightfieldCollisionComponent*> CollisionComponents;                      // 0x04B0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> FoliageComponents;                      // 0x04C0(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class ULandscapeNaniteComponent*              NaniteComponent;                                   // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class ULandscapeNaniteComponent*>      NaniteComponents;                                  // 0x04D8(0x0010)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_4E8[0x64];                                     // 0x04E8(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GrassTypesMaxDiscardDistance;                      // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_550[0x10];                                     // 0x0550(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StaticLightingResolution;                          // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CastShadow : 1;                                    // 0x0564(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastDynamicShadow : 1;                            // 0x0564(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastStaticShadow : 1;                             // 0x0564(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EShadowCacheInvalidationBehavior              ShadowCacheInvalidationBehavior;                   // 0x0565(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCastContactShadow : 1;                            // 0x0566(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_566_1 : 7;                                  // 0x0566(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_567[0x1];                                      // 0x0567(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastFarShadow : 1;                                // 0x0568(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_568_1 : 7;                                  // 0x0568(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastHiddenShadow : 1;                             // 0x056C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_56C_1 : 7;                                  // 0x056C(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastShadowAsTwoSided : 1;                         // 0x0570(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_570_1 : 7;                                  // 0x0570(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAffectDistanceFieldLighting : 1;                  // 0x0574(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectDynamicIndirectLighting : 1;                // 0x0574(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectIndirectLightingWhileHidden : 1;            // 0x0574(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	struct FLightingChannels                      LightingChannels;                                  // 0x0575(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_576[0x2];                                      // 0x0576(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseMaterialPositionOffsetInStaticLighting : 1;    // 0x0578(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NonNaniteVirtualShadowMapConstantDepthBias;        // 0x057C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NonNaniteVirtualShadowMapInvalidationHeightErrorThreshold; // 0x0580(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NonNaniteVirtualShadowMapInvalidationScreenSizeLimit; // 0x0584(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHoldout : 1;                                      // 0x0588(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_588_1 : 7;                                  // 0x0588(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bRenderCustomDepth : 1;                            // 0x058C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ERendererStencilMask                          CustomDepthStencilWriteMask;                       // 0x0590(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomDepthStencilValue;                           // 0x0594(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LDMaxDrawDistance;                                 // 0x0598(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightmassPrimitiveSettings            LightmassSettings;                                 // 0x059C(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CollisionMipLevel;                                 // 0x05B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipLevel;                           // 0x05B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBodyInstance                          BodyInstance;                                      // 0x05C0(0x0180)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         bGenerateOverlapEvents : 1;                        // 0x0740(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBakeMaterialPositionOffsetIntoCollision : 1;      // 0x0740(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULandscapeSubsystem*                    RegisteredToSubsystem;                             // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         ComponentSizeQuads;                                // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubsectionSizeQuads;                               // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSubsections;                                    // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUsedForNavigation : 1;                            // 0x075C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFillCollisionUnderLandscapeForNavmesh : 1;        // 0x075C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENavDataGatheringMode                         NavigationGeometryGatheringMode;                   // 0x0760(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDynamicMaterialInstance;                       // 0x0761(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLandscapeForCullingInvisibleHLODVertices;      // 0x0762(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasLayersContent;                                 // 0x0763(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_764[0x2];                                      // 0x0764(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseCompressedHeightmapStorage;                    // 0x0766(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStripPhysicsWhenCookedClient;                     // 0x0767(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStripPhysicsWhenCookedServer;                     // 0x0768(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStripGrassWhenCookedClient;                       // 0x0769(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStripGrassWhenCookedServer;                       // 0x076A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76B[0x5];                                      // 0x076B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLandscapeTargetLayerSettings> TargetLayers;                            // 0x0770(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)

public:
	void ChangeComponentScreenSizeToUseSubSections(float InComponentScreenSizeToUseSubSections);
	void ChangeLODDistanceFactor(float InLODDistanceFactor);
	void EditorApplySpline(class USplineComponent* InSplineComponent, float StartWidth, float EndWidth, float StartSideFalloff, float EndSideFalloff, float StartRoll, float EndRoll, int32 NumSubdivisions, bool bRaiseHeights, bool bLowerHeights, class ULandscapeLayerInfoObject* PaintLayer, class FName EditLayerName);
	void EditorSetLandscapeMaterial(class UMaterialInterface* NewLandscapeMaterial);
	class ALandscape* GetLandscapeActor();
	bool LandscapeExportHeightmapToRenderTarget(class UTextureRenderTarget2D* InRenderTarget, bool InExportHeightIntoRGChannel, bool InExportLandscapeProxies);
	void SetLandscapeMaterialScalarParameterValue(class FName ParameterName, float Value);
	void SetLandscapeMaterialTextureParameterValue(class FName ParameterName, class UTexture* Value);
	void SetLandscapeMaterialVectorParameterValue(class FName ParameterName, const struct FLinearColor& Value);
	void SetVirtualTextureRenderPassType(ERuntimeVirtualTextureMainPassType InType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeProxy")
	}
	static class ALandscapeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeProxy>();
	}
};
DUMPER7_ASSERTS_ALandscapeProxy;

// Class Landscape.Landscape
// 0x0000 (0x07C0 - 0x07C0)
class ALandscape final : public ALandscapeProxy
{
public:
	bool RenderHeightmap(const struct FTransform& InWorldTransform, const struct FBox2D& InExtents, class UTextureRenderTarget2D* OutRenderTarget);
	bool RenderWeightmap(const struct FTransform& InWorldTransform, const struct FBox2D& InExtents, class FName InWeightmapLayerName, class UTextureRenderTarget2D* OutRenderTarget);
	bool RenderWeightmaps(const struct FTransform& InWorldTransform, const struct FBox2D& InExtents, const TArray<class FName>& InWeightmapLayerNames, class UTextureRenderTarget* OutRenderTarget);

	TArray<class FName> GetTargetLayerNames(bool bInIncludeVisibilityLayer) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Landscape")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Landscape")
	}
	static class ALandscape* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscape>();
	}
};
DUMPER7_ASSERTS_ALandscape;

// Class Landscape.LandscapeLODStreamingProxy_DEPRECATED
// 0x0000 (0x00D0 - 0x00D0)
class ULandscapeLODStreamingProxy_DEPRECATED final : public UStreamableRenderAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeLODStreamingProxy_DEPRECATED")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeLODStreamingProxy_DEPRECATED")
	}
	static class ULandscapeLODStreamingProxy_DEPRECATED* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeLODStreamingProxy_DEPRECATED>();
	}
};
DUMPER7_ASSERTS_ULandscapeLODStreamingProxy_DEPRECATED;

// Class Landscape.LandscapeComponent
// 0x0210 (0x0730 - 0x0520)
class ULandscapeComponent final : public UPrimitiveComponent
{
public:
	int32                                         SectionBaseX;                                      // 0x0520(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionBaseY;                                      // 0x0524(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentSizeQuads;                                // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubsectionSizeQuads;                               // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSubsections;                                    // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMaterialInterface*                     OverrideHoleMaterial;                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UMaterialInstanceConstant*>      MaterialInstances;                                 // 0x0548(0x0010)(ZeroConstructor, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UMaterialInstanceDynamic*>       MaterialInstancesDynamic;                          // 0x0558(0x0010)(ZeroConstructor, Transient, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<int8>                                  LODIndexToMaterialIndex;                           // 0x0568(0x0010)(ZeroConstructor, TextExportTransient, NativeAccessSpecifierPublic)
	class UTexture2D*                             XYOffsetmapTexture;                                // 0x0578(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector4                               WeightmapScaleBias;                                // 0x0580(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightmapSubsectionOffset;                         // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A4[0xC];                                      // 0x05A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               HeightmapScaleBias;                                // 0x05B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   CachedLocalBox;                                    // 0x05D0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                MipToMipMaxDeltas;                                 // 0x0608(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class ULandscapeHeightfieldCollisionComponent* CollisionComponentRef;                            // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bUserTriggeredChangeRequested;                     // 0x0620(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNaniteActive;                                     // 0x0621(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             HeightmapTexture;                                  // 0x0628(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FWeightmapLayerAllocationInfo>  WeightmapLayerAllocations;                         // 0x0630(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UTexture2D*>                     WeightmapTextures;                                 // 0x0640(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FLandscapePerLODMaterialOverride> PerLODOverrideMaterials;                         // 0x0650(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ULandscapeGrassType*>            GrassTypes;                                        // 0x0660(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_670[0x10];                                     // 0x0670(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  MapBuildDataId;                                    // 0x0680(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionMipLevel;                                 // 0x0690(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipLevel;                           // 0x0694(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NegativeZBoundsExtension;                          // 0x0698(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositiveZBoundsExtension;                          // 0x069C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticLightingResolution;                          // 0x06A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ForcedLOD;                                         // 0x06A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODBias;                                           // 0x06A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  StateId;                                           // 0x06AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULandscapeHeightmapTextureEdgeFixup*    RegisteredEdgeFixup;                               // 0x06C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             MobileMaterialInterfaces;                          // 0x06D0(0x0010)(ZeroConstructor, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UTexture2D*>                     MobileWeightmapTextures;                           // 0x06E0(0x0010)(ZeroConstructor, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UTexture2DArray*                        MobileWeightmapTextureArray;                       // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FWeightmapLayerAllocationInfo>  MobileWeightmapLayerAllocations;                   // 0x06F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_708[0x28];                                     // 0x0708(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float EditorGetPaintLayerWeightAtLocation(const struct FVector& InLocation, class ULandscapeLayerInfoObject* PaintLayer);
	float EditorGetPaintLayerWeightByNameAtLocation(const struct FVector& InLocation, const class FName InPaintLayerName);
	void SetForcedLOD(int32 InForcedLOD);
	void SetLODBias(int32 InLODBias);

	class UMaterialInstanceDynamic* GetMaterialInstanceDynamic(int32 InIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeComponent")
	}
	static class ULandscapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeComponent>();
	}
};
DUMPER7_ASSERTS_ULandscapeComponent;

// Class Landscape.LandscapeEditLayerBase
// 0x0000 (0x0028 - 0x0028)
class ULandscapeEditLayerBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayerBase")
	}
	static class ULandscapeEditLayerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayerBase>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditLayerBase;

// Class Landscape.LandscapeEditLayerPersistent
// 0x0008 (0x0030 - 0x0028)
class ULandscapeEditLayerPersistent : public ULandscapeEditLayerBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayerPersistent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayerPersistent")
	}
	static class ULandscapeEditLayerPersistent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayerPersistent>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditLayerPersistent;

// Class Landscape.LandscapeEditLayer
// 0x0000 (0x0030 - 0x0030)
class ULandscapeEditLayer final : public ULandscapeEditLayerPersistent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayer")
	}
	static class ULandscapeEditLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayer>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditLayer;

// Class Landscape.LandscapeEditLayerProcedural
// 0x0000 (0x0028 - 0x0028)
class ULandscapeEditLayerProcedural final : public ULandscapeEditLayerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayerProcedural")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayerProcedural")
	}
	static class ULandscapeEditLayerProcedural* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayerProcedural>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditLayerProcedural;

// Class Landscape.LandscapeEditLayerSplines
// 0x0000 (0x0030 - 0x0030)
class ULandscapeEditLayerSplines final : public ULandscapeEditLayerPersistent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayerSplines")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayerSplines")
	}
	static class ULandscapeEditLayerSplines* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayerSplines>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditLayerSplines;

// Class Landscape.LandscapeEditLayerRenderer
// 0x0000 (0x0000 - 0x0000)
class ILandscapeEditLayerRenderer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditLayerRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditLayerRenderer")
	}
	static class ILandscapeEditLayerRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILandscapeEditLayerRenderer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ILandscapeEditLayerRenderer;

// Class Landscape.LandscapeDefaultEditLayerRenderer
// 0x0000 (0x0028 - 0x0028)
class ULandscapeDefaultEditLayerRenderer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeDefaultEditLayerRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeDefaultEditLayerRenderer")
	}
	static class ULandscapeDefaultEditLayerRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeDefaultEditLayerRenderer>();
	}
};
DUMPER7_ASSERTS_ULandscapeDefaultEditLayerRenderer;

// Class Landscape.LandscapeHeightmapNormalsEditLayerRenderer
// 0x0000 (0x0028 - 0x0028)
class ULandscapeHeightmapNormalsEditLayerRenderer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeHeightmapNormalsEditLayerRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeHeightmapNormalsEditLayerRenderer")
	}
	static class ULandscapeHeightmapNormalsEditLayerRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeHeightmapNormalsEditLayerRenderer>();
	}
};
DUMPER7_ASSERTS_ULandscapeHeightmapNormalsEditLayerRenderer;

// Class Landscape.LandscapeWeightmapWeightBlendedLayersRenderer
// 0x0000 (0x0028 - 0x0028)
class ULandscapeWeightmapWeightBlendedLayersRenderer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeWeightmapWeightBlendedLayersRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeWeightmapWeightBlendedLayersRenderer")
	}
	static class ULandscapeWeightmapWeightBlendedLayersRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeWeightmapWeightBlendedLayersRenderer>();
	}
};
DUMPER7_ASSERTS_ULandscapeWeightmapWeightBlendedLayersRenderer;

// Class Landscape.LandscapeScratchRenderTarget
// 0x0050 (0x0078 - 0x0028)
class ULandscapeScratchRenderTarget final : public UObject
{
public:
	class UTextureRenderTarget*                   RenderTarget;                                      // 0x0028(0x0008)(ZeroConstructor, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeScratchRenderTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeScratchRenderTarget")
	}
	static class ULandscapeScratchRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeScratchRenderTarget>();
	}
};
DUMPER7_ASSERTS_ULandscapeScratchRenderTarget;

// Class Landscape.LandscapeEditResourcesSubsystem
// 0x0010 (0x0040 - 0x0030)
class ULandscapeEditResourcesSubsystem final : public UEngineSubsystem
{
public:
	TArray<class ULandscapeScratchRenderTarget*>  ScratchRenderTargets;                              // 0x0030(0x0010)(ZeroConstructor, Transient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeEditResourcesSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeEditResourcesSubsystem")
	}
	static class ULandscapeEditResourcesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditResourcesSubsystem>();
	}
};
DUMPER7_ASSERTS_ULandscapeEditResourcesSubsystem;

// Class Landscape.LandscapeGizmoActor
// 0x0000 (0x02A8 - 0x02A8)
class ALandscapeGizmoActor : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeGizmoActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeGizmoActor")
	}
	static class ALandscapeGizmoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeGizmoActor>();
	}
};
DUMPER7_ASSERTS_ALandscapeGizmoActor;

// Class Landscape.LandscapeGizmoActiveActor
// 0x0050 (0x02F8 - 0x02A8)
class ALandscapeGizmoActiveActor final : public ALandscapeGizmoActor
{
public:
	uint8                                         Pad_2A8[0x50];                                     // 0x02A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeGizmoActiveActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeGizmoActiveActor")
	}
	static class ALandscapeGizmoActiveActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeGizmoActiveActor>();
	}
};
DUMPER7_ASSERTS_ALandscapeGizmoActiveActor;

// Class Landscape.LandscapeGizmoRenderComponent
// 0x0000 (0x0520 - 0x0520)
class ULandscapeGizmoRenderComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeGizmoRenderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeGizmoRenderComponent")
	}
	static class ULandscapeGizmoRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeGizmoRenderComponent>();
	}
};
DUMPER7_ASSERTS_ULandscapeGizmoRenderComponent;

// Class Landscape.LandscapeGrassType
// 0x0038 (0x0060 - 0x0028)
class ULandscapeGrassType final : public UObject
{
public:
	TArray<struct FGrassVariety>                  GrassVarieties;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bEnableDensityScaling : 1;                         // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        StateHash;                                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            GrassMesh;                                         // 0x0040(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         GrassDensity;                                      // 0x0048(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlacementJitter;                                   // 0x004C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartCullDistance;                                 // 0x0050(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndCullDistance;                                   // 0x0054(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RandomRotation;                                    // 0x0058(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignToSurface;                                    // 0x0059(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeGrassType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeGrassType")
	}
	static class ULandscapeGrassType* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeGrassType>();
	}
};
DUMPER7_ASSERTS_ULandscapeGrassType;

// Class Landscape.LandscapeHeightfieldCollisionComponent
// 0x0100 (0x0620 - 0x0520)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) ULandscapeHeightfieldCollisionComponent : public UPrimitiveComponent
{
public:
	TArray<class ULandscapeLayerInfoObject*>      ComponentLayerInfos;                               // 0x0520(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         SectionBaseX;                                      // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionBaseY;                                      // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionSizeQuads;                                // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionScale;                                    // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionSizeQuads;                          // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CollisionQuadFlags;                                // 0x0548(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                  HeightfieldGuid;                                   // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   CachedLocalBox;                                    // 0x0568(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULandscapeComponent*                    RenderComponentRef;                                // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_5A8[0x10];                                     // 0x05A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
