#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LBPC_ReplicatePrimitiveParamaters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LBPC_ReplicatePrimitiveParamaters.LBPC_ReplicatePrimitiveParamaters_C
// 0x0060 (0x02A0 - 0x0240)
class ULBPC_ReplicatePrimitiveParamaters_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimitiveComponent*                    ParentPrimitive;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Mass;                                              // 0x0250(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        LinearDamping;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        AngularDamping;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultMass;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultLinearDamping;                              // 0x0270(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefualtAngularDamping;                             // 0x0278(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackChangeMass;                                   // 0x0280(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackChangeLinearDamping;                          // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackChangeAngularDamping;                         // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName ParamaterName)> ResetBindEvent;                        // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetMass_Server_(double Mass, bool IsStack);
	void SetLinearDamping_Server_(double Mass, bool IsStack);
	void SetAngularDamping_Server_(double Mass, bool IsStack);
	void RestMass_Server_();
	void ResetLinearDamping_Server_();
	void ResetAngularDamping_Reset_();
	void ReceiveBeginPlay();
	void OnRep_Mass();
	void OnRep_LinearDamping();
	void OnRep_AngularDamping();
	void ExecuteUbergraph_LBPC_ReplicatePrimitiveParamaters(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LBPC_ReplicatePrimitiveParamaters_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBPC_ReplicatePrimitiveParamaters_C")
	}
	static class ULBPC_ReplicatePrimitiveParamaters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBPC_ReplicatePrimitiveParamaters_C>();
	}
};
DUMPER7_ASSERTS_ULBPC_ReplicatePrimitiveParamaters_C;

SDK_NAMESPACE_END
