#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LBPC_ComponentDistanceVisualUpdate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LBPC_ComponentDistanceVisualUpdate.LBPC_ComponentDistanceVisualUpdate_C
// 0x0030 (0x0270 - 0x0240)
class ULBPC_ComponentDistanceVisualUpdate_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        ChildComponent;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CheckInterval;                                     // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistnace;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceHide;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ForceUpdate();
	void ExecuteUbergraph_LBPC_ComponentDistanceVisualUpdate(int32 EntryPoint);
	void Check();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LBPC_ComponentDistanceVisualUpdate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBPC_ComponentDistanceVisualUpdate_C")
	}
	static class ULBPC_ComponentDistanceVisualUpdate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBPC_ComponentDistanceVisualUpdate_C>();
	}
};
DUMPER7_ASSERTS_ULBPC_ComponentDistanceVisualUpdate_C;

SDK_NAMESPACE_END
