#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LINK_ServerSaveData

#include "Basic.hpp"

#include "EN_LINK_GamePhase_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LINK_ServerSaveData.LINK_ServerSaveData_C
// 0x0020 (0x0048 - 0x0028)
class ULINK_ServerSaveData_C final : public UObject
{
public:
	int32                                         GoalRound;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRound;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_LINK_GamePhase                             GamePhase;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BeforeTravelNum;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AController*>                    AllPlayerControllers;                              // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void AddController(const class AController*& Controller);
	void GetController(TArray<class AController*>* AllPlayerControllers_0);
	void GetCurrentGamePhase(EN_LINK_GamePhase* GamePhase_0);
	void GetCurrentRound(int32* Value);
	void Initialization();
	void RemoveController(const class AController*& Controller);
	void SetCurrentGamePhase(EN_LINK_GamePhase GamePhase_0);
	void SetCurrentRound(int32 Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LINK_ServerSaveData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LINK_ServerSaveData_C")
	}
	static class ULINK_ServerSaveData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULINK_ServerSaveData_C>();
	}
};
DUMPER7_ASSERTS_ULINK_ServerSaveData_C;

SDK_NAMESPACE_END
