#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LINK_ServerSaveData

#include "Basic.hpp"

#include "EN_LINK_GamePhase_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.AddController
// 0x0010 (0x0010 - 0x0000)
struct LINK_ServerSaveData_C_AddController final
{
public:
	const class AController*                      Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_AddController;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.GetController
// 0x0010 (0x0010 - 0x0000)
struct LINK_ServerSaveData_C_GetController final
{
public:
	TArray<class AController*>                    AllPlayerControllers_0;                            // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_GetController;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.GetCurrentGamePhase
// 0x0001 (0x0001 - 0x0000)
struct LINK_ServerSaveData_C_GetCurrentGamePhase final
{
public:
	EN_LINK_GamePhase                             GamePhase_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_GetCurrentGamePhase;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.GetCurrentRound
// 0x0004 (0x0004 - 0x0000)
struct LINK_ServerSaveData_C_GetCurrentRound final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_GetCurrentRound;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.RemoveController
// 0x0010 (0x0010 - 0x0000)
struct LINK_ServerSaveData_C_RemoveController final
{
public:
	const class AController*                      Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_RemoveController;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.SetCurrentGamePhase
// 0x0001 (0x0001 - 0x0000)
struct LINK_ServerSaveData_C_SetCurrentGamePhase final
{
public:
	EN_LINK_GamePhase                             GamePhase_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_SetCurrentGamePhase;

// Function LINK_ServerSaveData.LINK_ServerSaveData_C.SetCurrentRound
// 0x0004 (0x0004 - 0x0000)
struct LINK_ServerSaveData_C_SetCurrentRound final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LINK_ServerSaveData_C_SetCurrentRound;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
