#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Matchmaking

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct Matchmaking.DedicatedServerReservationSlot
// 0x0038 (0x0038 - 0x0000)
struct FDedicatedServerReservationSlot final
{
public:
	bool                                          bHasUser;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDedicatedServerReservationSlot;

// ScriptStruct Matchmaking.DedicatedServerReservationTeam
// 0x0010 (0x0010 - 0x0000)
struct FDedicatedServerReservationTeam final
{
public:
	TArray<struct FDedicatedServerReservationSlot> Slots;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDedicatedServerReservationTeam;

// ScriptStruct Matchmaking.DedicatedServerReservation
// 0x0010 (0x0010 - 0x0000)
struct FDedicatedServerReservation final
{
public:
	TArray<struct FDedicatedServerReservationTeam> Teams;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDedicatedServerReservation;

// ScriptStruct Matchmaking.DedicatedServerMatchmakingBeaconClientMatchMember
// 0x0040 (0x0040 - 0x0000)
struct FDedicatedServerMatchmakingBeaconClientMatchMember final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Team;                                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         slot;                                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SlotType;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDedicatedServerMatchmakingBeaconClientMatchMember;

// ScriptStruct Matchmaking.TrackedPlayerController
// 0x0038 (0x0038 - 0x0000)
struct FTrackedPlayerController final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrackedPlayerController;

SDK_NAMESPACE_END
