#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingMatchmaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MatchmakingMatchmaker_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function MatchmakingMatchmaker.Matchmaker.GetMatchmakingStatus
// 0x0068 (0x0068 - 0x0000)
struct Matchmaker_GetMatchmakingStatus final
{
public:
	struct FUniqueNetIdRepl                       UserIdRepl;                                        // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchmakerProgressInfo                ProgressInfo;                                      // 0x0030(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Matchmaker_GetMatchmakingStatus;

// Function MatchmakingMatchmaker.Matchmaker.GetReadyState
// 0x0068 (0x0068 - 0x0000)
struct Matchmaker_GetReadyState final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReady;                                          // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Matchmaker_GetReadyState;

// Function MatchmakingMatchmaker.Matchmaker.IsMatchmaking
// 0x0001 (0x0001 - 0x0000)
struct Matchmaker_IsMatchmaking final
{
public:
	bool                                          bIsMatchmaking;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Matchmaker_IsMatchmaking;

// Function MatchmakingMatchmaker.Matchmaker.OnError
// 0x0010 (0x0010 - 0x0000)
struct Matchmaker_OnError final
{
public:
	class FString                                 MatchmakingError;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Matchmaker_OnError;

// Function MatchmakingMatchmaker.Matchmaker.OnProgress
// 0x0038 (0x0038 - 0x0000)
struct Matchmaker_OnProgress final
{
public:
	struct FMatchmakerProgressInfo                ProgressInfo;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Matchmaker_OnProgress;

// Function MatchmakingMatchmaker.Matchmaker.SetReadyState
// 0x0038 (0x0038 - 0x0000)
struct Matchmaker_SetReadyState final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReady;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Matchmaker_SetReadyState;

// Function MatchmakingMatchmaker.MatchmakerSubmitMatchResults.SubmitMatchResults
// 0x0050 (0x0050 - 0x0000)
struct MatchmakerSubmitMatchResults_SubmitMatchResults final
{
public:
	class UMatchmakerSubsystem*                   Subsystem_0;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId_0;                                     // 0x0008(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 TeamScores_0;                                      // 0x0038(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMatchmakerSubmitMatchResults*          ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MatchmakerSubmitMatchResults_SubmitMatchResults;

// Function MatchmakingMatchmaker.MatchmakerSubsystem.GetTeamAndSlotForPlayer
// 0x0020 (0x0020 - 0x0000)
struct MatchmakerSubsystem_GetTeamAndSlotForPlayer final
{
public:
	class APlayerController*                      LocalPlayerController;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           TargetPlayerState;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         slot;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MatchmakerSubsystem_GetTeamAndSlotForPlayer;

// Function MatchmakingMatchmaker.MatchmakerSubsystem.GetTeamAndSlotForPlayerOnServer
// 0x0018 (0x0018 - 0x0000)
struct MatchmakerSubsystem_GetTeamAndSlotForPlayerOnServer final
{
public:
	class APlayerState*                           TargetPlayerState;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         slot;                                              // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MatchmakerSubsystem_GetTeamAndSlotForPlayerOnServer;

// Function MatchmakingMatchmaker.RedpointMatchmakerBlueprintFunctionLibrary.AreAllExpectedPlayersConnectedFromMatchmaker
// 0x0010 (0x0010 - 0x0000)
struct RedpointMatchmakerBlueprintFunctionLibrary_AreAllExpectedPlayersConnectedFromMatchmaker final
{
public:
	class UGameInstance*                          GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointMatchmakerBlueprintFunctionLibrary_AreAllExpectedPlayersConnectedFromMatchmaker;

// Function MatchmakingMatchmaker.RedpointMatchmakerBlueprintFunctionLibrary.FindMatchmakerTeamPlayerStart
// 0x0010 (0x0010 - 0x0000)
struct RedpointMatchmakerBlueprintFunctionLibrary_FindMatchmakerTeamPlayerStart final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerStart*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointMatchmakerBlueprintFunctionLibrary_FindMatchmakerTeamPlayerStart;

// Function MatchmakingMatchmaker.RedpointMatchmakerTeamComponent.GetSlot
// 0x0004 (0x0004 - 0x0000)
struct RedpointMatchmakerTeamComponent_GetSlot final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointMatchmakerTeamComponent_GetSlot;

// Function MatchmakingMatchmaker.RedpointMatchmakerTeamComponent.GetTeam
// 0x0004 (0x0004 - 0x0000)
struct RedpointMatchmakerTeamComponent_GetTeam final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointMatchmakerTeamComponent_GetTeam;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
