#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Matchmaking

#include "Basic.hpp"

#include "Matchmaking_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Matchmaking.DedicatedServerMatchmakingBeaconClient.OnReserveForMatchResult
// 0x0001 (0x0001 - 0x0000)
struct DedicatedServerMatchmakingBeaconClient_OnReserveForMatchResult final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconClient_OnReserveForMatchResult;

// Function Matchmaking.DedicatedServerMatchmakingBeaconClient.ReserveForMatch
// 0x0020 (0x0020 - 0x0000)
struct DedicatedServerMatchmakingBeaconClient_ReserveForMatch final
{
public:
	TArray<struct FDedicatedServerMatchmakingBeaconClientMatchMember> MatchMembers;                  // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 TeamSizes;                                         // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconClient_ReserveForMatch;

// Function Matchmaking.DedicatedServerMatchmakingBeaconHost.GetCurrentReservation
// 0x0018 (0x0018 - 0x0000)
struct DedicatedServerMatchmakingBeaconHost_GetCurrentReservation final
{
public:
	bool                                          bOutIsReserved;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDedicatedServerReservation            OutReservation;                                    // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconHost_GetCurrentReservation;

// Function Matchmaking.DedicatedServerMatchmakingBeaconHost.GetRemainingReservationMembers
// 0x0050 (0x0050 - 0x0000)
struct DedicatedServerMatchmakingBeaconHost_GetRemainingReservationMembers final
{
public:
	TSet<class FString>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconHost_GetRemainingReservationMembers;

// Function Matchmaking.DedicatedServerMatchmakingBeaconHost.IsMatchPlaying
// 0x0001 (0x0001 - 0x0000)
struct DedicatedServerMatchmakingBeaconHost_IsMatchPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconHost_IsMatchPlaying;

// Function Matchmaking.DedicatedServerMatchmakingBeaconHost.IsReserved
// 0x0001 (0x0001 - 0x0000)
struct DedicatedServerMatchmakingBeaconHost_IsReserved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DedicatedServerMatchmakingBeaconHost_IsReserved;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
