#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaPlate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MediaPlate_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function MediaPlate.MediaPlate.SetHoldoutCompositeEnabled
// 0x0001 (0x0001 - 0x0000)
struct MediaPlate_SetHoldoutCompositeEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlate_SetHoldoutCompositeEnabled;

// Function MediaPlate.MediaPlate.IsHoldoutCompositeEnabled
// 0x0001 (0x0001 - 0x0000)
struct MediaPlate_IsHoldoutCompositeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlate_IsHoldoutCompositeEnabled;

// Function MediaPlate.MediaPlateComponent.GetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct MediaPlateComponent_GetLetterboxAspectRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetLetterboxAspectRatio;

// Function MediaPlate.MediaPlateComponent.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetLoop;

// Function MediaPlate.MediaPlateComponent.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct MediaPlateComponent_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetMediaPlayer;

// Function MediaPlate.MediaPlateComponent.GetMediaTexture
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_GetMediaTexture final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaTexture*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetMediaTexture;

// Function MediaPlate.MediaPlateComponent.Next
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_Next final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_Next;

// Function MediaPlate.MediaPlateComponent.OnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_OnMediaOpened final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_OnMediaOpened;

// Function MediaPlate.MediaPlateComponent.OpenLatent
// 0x0028 (0x0028 - 0x0000)
struct MediaPlateComponent_OpenLatent final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      InLatentInfo;                                      // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InTimeout;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInWaitForTexture;                                 // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0025(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlateComponent_OpenLatent;

// Function MediaPlate.MediaPlateComponent.Previous
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_Previous final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_Previous;

// Function MediaPlate.MediaPlateComponent.Rewind
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_Rewind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_Rewind;

// Function MediaPlate.MediaPlateComponent.Seek
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_Seek final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlateComponent_Seek;

// Function MediaPlate.MediaPlateComponent.SelectExternalMedia
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_SelectExternalMedia final
{
public:
	class FString                                 InFilePath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SelectExternalMedia;

// Function MediaPlate.MediaPlateComponent.SelectMediaPlaylistAsset
// 0x0008 (0x0008 - 0x0000)
struct MediaPlateComponent_SelectMediaPlaylistAsset final
{
public:
	const class UMediaPlaylist*                   InMediaPlaylist;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SelectMediaPlaylistAsset;

// Function MediaPlate.MediaPlateComponent.SelectMediaSourceAsset
// 0x0008 (0x0008 - 0x0000)
struct MediaPlateComponent_SelectMediaSourceAsset final
{
public:
	const class UMediaSource*                     InMediaSource;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SelectMediaSourceAsset;

// Function MediaPlate.MediaPlateComponent.SetEnableAudio
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetEnableAudio final
{
public:
	bool                                          bInEnableAudio;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetEnableAudio;

// Function MediaPlate.MediaPlateComponent.SetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetIsAspectRatioAuto final
{
public:
	bool                                          bInIsAspectRatioAuto;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetIsAspectRatioAuto;

// Function MediaPlate.MediaPlateComponent.SetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct MediaPlateComponent_SetLetterboxAspectRatio final
{
public:
	float                                         AspectRatio;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetLetterboxAspectRatio;

// Function MediaPlate.MediaPlateComponent.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetLoop final
{
public:
	bool                                          bInLoop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetLoop;

// Function MediaPlate.MediaPlateComponent.SetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_SetMeshRange final
{
public:
	struct FVector2D                              InMeshRange;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetMeshRange;

// Function MediaPlate.MediaPlateComponent.SetPlayOnlyWhenVisible
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_SetPlayOnlyWhenVisible final
{
public:
	bool                                          bInPlayOnlyWhenVisible;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_SetPlayOnlyWhenVisible;

// Function MediaPlate.MediaPlateComponent.GetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_GetIsAspectRatioAuto final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetIsAspectRatioAuto;

// Function MediaPlate.MediaPlateComponent.GetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct MediaPlateComponent_GetMeshRange final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_GetMeshRange;

// Function MediaPlate.MediaPlateComponent.IsEventStateChangeAllowed
// 0x0002 (0x0002 - 0x0000)
struct MediaPlateComponent_IsEventStateChangeAllowed final
{
public:
	EMediaPlateEventState                         InRequestEventState;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_IsEventStateChangeAllowed;

// Function MediaPlate.MediaPlateComponent.IsMediaPlatePlaying
// 0x0001 (0x0001 - 0x0000)
struct MediaPlateComponent_IsMediaPlatePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlateComponent_IsMediaPlatePlaying;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
