#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanSDKRuntime

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum MetaHumanSDKRuntime.EMetaHumanBodyType
// NumValues: 0x0015
enum class EMetaHumanBodyType : uint8
{
	f_med_nrw                                = 0,
	f_med_ovw                                = 1,
	f_med_unw                                = 2,
	f_srt_nrw                                = 3,
	f_srt_ovw                                = 4,
	f_srt_unw                                = 5,
	f_tal_nrw                                = 6,
	f_tal_ovw                                = 7,
	f_tal_unw                                = 8,
	m_med_nrw                                = 9,
	m_med_ovw                                = 10,
	m_med_unw                                = 11,
	m_srt_nrw                                = 12,
	m_srt_ovw                                = 13,
	m_srt_unw                                = 14,
	m_tal_nrw                                = 15,
	m_tal_ovw                                = 16,
	m_tal_unw                                = 17,
	BlendableBody                            = 18,
	Count                                    = 19,
	EMetaHumanBodyType_MAX                   = 20,
};

// Enum MetaHumanSDKRuntime.EMetaHumanBodyBodyPartIndex
// NumValues: 0x0007
enum class EMetaHumanBodyBodyPartIndex : uint8
{
	Body                                     = 0,
	Face                                     = 1,
	Torso                                    = 2,
	Legs                                     = 3,
	Feet                                     = 4,
	Count                                    = 5,
	EMetaHumanBodyBodyPartIndex_MAX          = 6,
};

// Enum MetaHumanSDKRuntime.EFaceTextureType
// NumValues: 0x000B
enum class EFaceTextureType : uint8
{
	Basecolor                                = 0,
	Basecolor_Animated_CM1                   = 1,
	Basecolor_Animated_CM2                   = 2,
	Basecolor_Animated_CM3                   = 3,
	Normal                                   = 4,
	Normal_Animated_WM1                      = 5,
	Normal_Animated_WM2                      = 6,
	Normal_Animated_WM3                      = 7,
	Cavity                                   = 8,
	Count                                    = 9,
	EFaceTextureType_MAX                     = 10,
};

// Enum MetaHumanSDKRuntime.EBodyTextureType
// NumValues: 0x000D
enum class EBodyTextureType : uint8
{
	Body_Basecolor                           = 0,
	Body_Normal                              = 1,
	Body_Cavity                              = 2,
	Body_Underwear_Basecolor                 = 3,
	Body_Underwear_Normal                    = 4,
	Body_Underwear_Mask                      = 5,
	Chest_Basecolor                          = 6,
	Chest_Normal                             = 7,
	Chest_Cavity                             = 8,
	Chest_Underwear_Basecolor                = 9,
	Chest_Underwear_Normal                   = 10,
	Count                                    = 11,
	EBodyTextureType_MAX                     = 12,
};

// Enum MetaHumanSDKRuntime.EMetaHumanQualityLevel
// NumValues: 0x0006
enum class EMetaHumanQualityLevel : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Cinematic                                = 3,
	Count                                    = 4,
	EMetaHumanQualityLevel_MAX               = 5,
};

// ScriptStruct MetaHumanSDKRuntime.MetaHumanCustomizableBodyPart
// 0x0030 (0x0030 - 0x0000)
struct FMetaHumanCustomizableBodyPart final
{
public:
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControlRigLODThreshold;                            // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         RigidBodyLODThreshold;                             // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ComponentName;                                     // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaHumanCustomizableBodyPart;

SDK_NAMESPACE_END
