#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoverExamples

#include "Basic.hpp"

#include "Mover_structs.hpp"


SDK_NAMESPACE_START

// Enum MoverExamples.EFollowPathRotationType
// NumValues: 0x0004
enum class EFollowPathRotationType : uint8
{
	Fixed                                    = 0,
	AlignWithPathTangents                    = 1,
	AlignWithPath                            = 2,
	EFollowPathRotationType_MAX              = 3,
};

// Enum MoverExamples.ESplineOffsetUnit
// NumValues: 0x0004
enum class ESplineOffsetUnit : uint8
{
	Percentage                               = 0,
	DurationAbsoluteSeconds                  = 1,
	DistanceAbsolute                         = 2,
	ESplineOffsetUnit_MAX                    = 3,
};

// Enum MoverExamples.EFollowSplineRotationType
// NumValues: 0x0003
enum class EFollowSplineRotationType : uint8
{
	FollowSplineTangent                      = 0,
	NoRotation                               = 1,
	EFollowSplineRotationType_MAX            = 2,
};

// ScriptStruct MoverExamples.MoverExampleAbilityInputs
// 0x0008 (0x0010 - 0x0008)
struct FMoverExampleAbilityInputs final : public FMoverDataStructBase
{
public:
	bool                                          bIsDashJustPressed;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAimPressed;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVaultJustPressed;                               // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsToStartZiplining;                            // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsToBeCrouched;                                // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoverExampleAbilityInputs;

// ScriptStruct MoverExamples.ZipliningState
// 0x0010 (0x0018 - 0x0008)
struct FZipliningState final : public FMoverDataStructBase
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FZipliningState;

// ScriptStruct MoverExamples.FollowPathState
// 0x0020 (0x0028 - 0x0008)
struct FFollowPathState final : public FMoverDataStructBase
{
public:
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFollowPathState;

// ScriptStruct MoverExamples.SplineOffsetRangeInput
// 0x0008 (0x0008 - 0x0000)
struct FSplineOffsetRangeInput final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineOffsetUnit                             OffsetUnit;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSplineOffsetRangeInput;

// ScriptStruct MoverExamples.FollowSplineState
// 0x0008 (0x0010 - 0x0008)
struct FFollowSplineState final : public FMoverDataStructBase
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFollowSplineState;

SDK_NAMESPACE_END
