#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoverExamples

#include "Basic.hpp"

#include "Mover_structs.hpp"
#include "MoverExamples_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function MoverExamples.MoverExampleAbilityInputsLibrary.GetMoverExampleAbilityInputs
// 0x0020 (0x0020 - 0x0000)
struct MoverExampleAbilityInputsLibrary_GetMoverExampleAbilityInputs final
{
public:
	struct FMoverDataCollection                   FromCollection;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverExampleAbilityInputs             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverExampleAbilityInputsLibrary_GetMoverExampleAbilityInputs;

// Function MoverExamples.MoverExamplesCharacter.OnProduceInputInBlueprint
// 0x0028 (0x0028 - 0x0000)
struct MoverExamplesCharacter_OnProduceInputInBlueprint final
{
public:
	float                                         DeltaMs;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoverInputCmdContext                  InputCmd;                                          // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FMoverInputCmdContext                  ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverExamplesCharacter_OnProduceInputInBlueprint;

// Function MoverExamples.MoverExamplesCharacter.RequestMoveByIntent
// 0x0018 (0x0018 - 0x0000)
struct MoverExamplesCharacter_RequestMoveByIntent final
{
public:
	struct FVector                                DesiredIntent;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverExamplesCharacter_RequestMoveByIntent;

// Function MoverExamples.MoverExamplesCharacter.RequestMoveByVelocity
// 0x0018 (0x0018 - 0x0000)
struct MoverExamplesCharacter_RequestMoveByVelocity final
{
public:
	struct FVector                                DesiredVelocity;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverExamplesCharacter_RequestMoveByVelocity;

// Function MoverExamples.MoverExamplesCharacter.GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverExamplesCharacter_GetMoverComponent final
{
public:
	class UCharacterMoverComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverExamplesCharacter_GetMoverComponent;

// Function MoverExamples.Zipline.GetEndComponent
// 0x0008 (0x0008 - 0x0000)
struct Zipline_GetEndComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Zipline_GetEndComponent;

// Function MoverExamples.Zipline.GetStartComponent
// 0x0008 (0x0008 - 0x0000)
struct Zipline_GetStartComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Zipline_GetStartComponent;

// Function MoverExamples.FollowSplineMode.SetControlSpline
// 0x0010 (0x0010 - 0x0000)
struct FollowSplineMode_SetControlSpline final
{
public:
	const class AActor*                           SplineProviderActor;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSplineOffsetRangeInput                Offset;                                            // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FollowSplineMode_SetControlSpline;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
