#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "Mover_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Mover.AirMovementUtils.ComputeControlledFreeMove
// 0x0110 (0x0110 - 0x0000)
struct AirMovementUtils_ComputeControlledFreeMove final
{
public:
	struct FFreeMoveParams                        InParams;                                          // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ReturnValue;                                       // 0x00B0(0x0058)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AirMovementUtils_ComputeControlledFreeMove;

// Function Mover.AirMovementUtils.IsValidLandingSpot
// 0x0250 (0x0250 - 0x0000)
struct AirMovementUtils_IsValidLandingSpot final
{
public:
	struct FMovingComponentSet                    MovingComps;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FloorSweepDistance;                                // 0x0130(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x0134(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloorCheckResult                      OutFloorResult;                                    // 0x0138(0x0110)(Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0248(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AirMovementUtils_IsValidLandingSpot;

// Function Mover.AirMovementUtils.TestFallingMoveAlongHitSurface
// 0x02E0 (0x02E0 - 0x0000)
struct AirMovementUtils_TestFallingMoveAlongHitSurface final
{
public:
	struct FMovingComponentSet                    MovingComps;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                OriginalMoveDelta;                                 // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationAtHit;                                     // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  TargetRotation;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleImpact;                                     // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloorSweepDistance;                                // 0x0074(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             InOutHit;                                          // 0x0080(0x0100)(Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FFloorCheckResult                      OutFloorResult;                                    // 0x0180(0x0110)(Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMovementRecord                        InOutMoveRecord;                                   // 0x0290(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x02D8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AirMovementUtils_TestFallingMoveAlongHitSurface;

// Function Mover.AirMovementUtils.TryMoveToFallAlongSurface
// 0x02F0 (0x02F0 - 0x0000)
struct AirMovementUtils_TryMoveToFallAlongSurface final
{
public:
	struct FMovingComponentSet                    MovingComps;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                Delta;                                             // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PctOfDeltaToMove;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0040(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0060(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0078(0x0100)(Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bHandleImpact;                                     // 0x0178(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloorSweepDistance;                                // 0x017C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x0180(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloorCheckResult                      OutFloorResult;                                    // 0x0188(0x0110)(Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMovementRecord                        MoveRecord;                                        // 0x0298(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x02E0(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0xC];                                      // 0x02E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AirMovementUtils_TryMoveToFallAlongSurface;

// Function Mover.MoverComponent.AddGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_AddGameplayTag final
{
public:
	struct FGameplayTag                           TagToAdd;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_AddGameplayTag;

// Function Mover.MoverComponent.AddGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct MoverComponent_AddGameplayTags final
{
public:
	struct FGameplayTagContainer                  TagsToAdd;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_AddGameplayTags;

// Function Mover.MoverComponent.AddMovementModeFromClass
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_AddMovementModeFromClass final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBaseMovementMode>          MovementMode;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementMode*                      ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_AddMovementModeFromClass;

// Function Mover.MoverComponent.AddMovementModeFromObject
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_AddMovementModeFromObject final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementMode*                      MovementMode;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_AddMovementModeFromObject;

// Function Mover.MoverComponent.BindProcessGeneratedMovement
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_BindProcessGeneratedMovement final
{
public:
	TDelegate<void(const struct FMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove)> ProcessGeneratedMovementEvent; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_BindProcessGeneratedMovement;

// Function Mover.MoverComponent.CancelModifierFromHandle
// 0x0002 (0x0002 - 0x0000)
struct MoverComponent_CancelModifierFromHandle final
{
public:
	struct FMovementModifierHandle                ModifierHandle;                                    // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_CancelModifierFromHandle;

// Function Mover.MoverComponent.GetFutureTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetFutureTrajectory final
{
public:
	float                                         FutureSeconds;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplesPerSecond;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetFutureTrajectory;

// Function Mover.MoverComponent.GetPredictedTrajectory
// 0x00C8 (0x00C8 - 0x0000)
struct MoverComponent_GetPredictedTrajectory final
{
public:
	struct FMoverPredictTrajectoryParams          PredictionParams;                                  // 0x0000(0x00B8)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x00B8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetPredictedTrajectory;

// Function Mover.MoverComponent.HandleImpact
// 0x0120 (0x0120 - 0x0000)
struct MoverComponent_HandleImpact final
{
public:
	struct FMoverOnImpactParams                   ImpactParams;                                      // 0x0000(0x0120)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_HandleImpact;

// Function Mover.MoverComponent.K2_QueueInstantMovementEffect
// 0x0004 (0x0004 - 0x0000)
struct MoverComponent_K2_QueueInstantMovementEffect final
{
public:
	int32                                         EffectAsRawData;                                   // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_K2_QueueInstantMovementEffect;

// Function Mover.MoverComponent.K2_QueueLayeredMove
// 0x0004 (0x0004 - 0x0000)
struct MoverComponent_K2_QueueLayeredMove final
{
public:
	int32                                         MoveAsRawData;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_K2_QueueLayeredMove;

// Function Mover.MoverComponent.K2_QueueMovementModifier
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_K2_QueueMovementModifier final
{
public:
	int32                                         MoveAsRawData;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovementModifierHandle                ReturnValue;                                       // 0x0004(0x0002)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_K2_QueueMovementModifier;

// Function Mover.MoverComponent.OnBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct MoverComponent_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_OnBeginOverlap;

// Function Mover.MoverComponent.PhysicsVolumeChanged
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_PhysicsVolumeChanged final
{
public:
	class APhysicsVolume*                         NewVolume;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_PhysicsVolumeChanged;

// Function Mover.MoverComponent.QueueNextMode
// 0x000C (0x000C - 0x0000)
struct MoverComponent_QueueNextMode final
{
public:
	class FName                                   DesiredModeName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReenter;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_QueueNextMode;

// Function Mover.MoverComponent.RemoveGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           TagToRemove;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_RemoveGameplayTag;

// Function Mover.MoverComponent.RemoveGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct MoverComponent_RemoveGameplayTags final
{
public:
	struct FGameplayTagContainer                  TagsToRemove;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_RemoveGameplayTags;

// Function Mover.MoverComponent.RemoveMovementMode
// 0x000C (0x000C - 0x0000)
struct MoverComponent_RemoveMovementMode final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_RemoveMovementMode;

// Function Mover.MoverComponent.SetBaseVisualComponentTransform
// 0x0060 (0x0060 - 0x0000)
struct MoverComponent_SetBaseVisualComponentTransform final
{
public:
	struct FTransform                             ComponentTransform;                                // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetBaseVisualComponentTransform;

// Function Mover.MoverComponent.SetGravityOverride
// 0x0020 (0x0020 - 0x0000)
struct MoverComponent_SetGravityOverride final
{
public:
	bool                                          bOverrideGravity;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GravityAcceleration;                               // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetGravityOverride;

// Function Mover.MoverComponent.SetPlanarConstraint
// 0x0038 (0x0038 - 0x0000)
struct MoverComponent_SetPlanarConstraint final
{
public:
	struct FPlanarConstraint                      InConstraint;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetPlanarConstraint;

// Function Mover.MoverComponent.SetPrimaryVisualComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_SetPrimaryVisualComponent final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetPrimaryVisualComponent;

// Function Mover.MoverComponent.SetUpdatedComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_SetUpdatedComponent final
{
public:
	class USceneComponent*                        NewUpdatedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetUpdatedComponent;

// Function Mover.MoverComponent.SetUseDeferredGroupMovement
// 0x0001 (0x0001 - 0x0000)
struct MoverComponent_SetUseDeferredGroupMovement final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_SetUseDeferredGroupMovement;

// Function Mover.MoverComponent.FindMovementMode
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_FindMovementMode final
{
public:
	TSubclassOf<class UBaseMovementMode>          MovementMode;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementMode*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_FindMovementMode;

// Function Mover.MoverComponent.FindMovementModeByName
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_FindMovementModeByName final
{
public:
	class FName                                   MovementModeName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseMovementMode*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_FindMovementModeByName;

// Function Mover.MoverComponent.FindSharedSettings_BP
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_FindSharedSettings_BP final
{
public:
	TSubclassOf<class UObject>                    SharedSetting;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_FindSharedSettings_BP;

// Function Mover.MoverComponent.FindSharedSettings_Mutable_BP
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_FindSharedSettings_Mutable_BP final
{
public:
	TSubclassOf<class UObject>                    SharedSetting;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_FindSharedSettings_Mutable_BP;

// Function Mover.MoverComponent.GetBaseVisualComponentTransform
// 0x0060 (0x0060 - 0x0000)
struct MoverComponent_GetBaseVisualComponentTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetBaseVisualComponentTransform;

// Function Mover.MoverComponent.GetGravityAcceleration
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetGravityAcceleration final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetGravityAcceleration;

// Function Mover.MoverComponent.GetLastInputCmd
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_GetLastInputCmd final
{
public:
	struct FMoverInputCmdContext                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetLastInputCmd;

// Function Mover.MoverComponent.GetLastTimeStep
// 0x0010 (0x0010 - 0x0000)
struct MoverComponent_GetLastTimeStep final
{
public:
	struct FMoverTimeStep                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetLastTimeStep;

// Function Mover.MoverComponent.GetMovementBase
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetMovementBase final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetMovementBase;

// Function Mover.MoverComponent.GetMovementBaseBoneName
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetMovementBaseBoneName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetMovementBaseBoneName;

// Function Mover.MoverComponent.GetMovementIntent
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetMovementIntent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetMovementIntent;

// Function Mover.MoverComponent.GetMovementMode
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetMovementMode final
{
public:
	const class UBaseMovementMode*                ReturnValue;                                       // 0x0000(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetMovementMode;

// Function Mover.MoverComponent.GetMovementModeName
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetMovementModeName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetMovementModeName;

// Function Mover.MoverComponent.GetPlanarConstraint
// 0x0038 (0x0038 - 0x0000)
struct MoverComponent_GetPlanarConstraint final
{
public:
	struct FPlanarConstraint                      ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetPlanarConstraint;

// Function Mover.MoverComponent.GetPrimaryVisualComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetPrimaryVisualComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetPrimaryVisualComponent;

// Function Mover.MoverComponent.GetSimBlackboard
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetSimBlackboard final
{
public:
	const class UMoverBlackboard*                 ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetSimBlackboard;

// Function Mover.MoverComponent.GetSyncState
// 0x0078 (0x0078 - 0x0000)
struct MoverComponent_GetSyncState final
{
public:
	struct FMoverSyncState                        ReturnValue;                                       // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetSyncState;

// Function Mover.MoverComponent.GetTargetOrientation
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetTargetOrientation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetTargetOrientation;

// Function Mover.MoverComponent.GetUpdatedComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_GetUpdatedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetUpdatedComponent;

// Function Mover.MoverComponent.GetUpDirection
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetUpDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetUpDirection;

// Function Mover.MoverComponent.GetVelocity
// 0x0018 (0x0018 - 0x0000)
struct MoverComponent_GetVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_GetVelocity;

// Function Mover.MoverComponent.HasGameplayTag
// 0x000C (0x000C - 0x0000)
struct MoverComponent_HasGameplayTag final
{
public:
	struct FGameplayTag                           TagToFind;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_HasGameplayTag;

// Function Mover.MoverComponent.HasGameplayTagInState
// 0x0088 (0x0088 - 0x0000)
struct MoverComponent_HasGameplayTagInState final
{
public:
	struct FMoverSyncState                        SyncState;                                         // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagToFind;                                         // 0x0078(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_HasGameplayTagInState;

// Function Mover.MoverComponent.HasValidCachedInputCmd
// 0x0001 (0x0001 - 0x0000)
struct MoverComponent_HasValidCachedInputCmd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_HasValidCachedInputCmd;

// Function Mover.MoverComponent.HasValidCachedState
// 0x0001 (0x0001 - 0x0000)
struct MoverComponent_HasValidCachedState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_HasValidCachedState;

// Function Mover.MoverComponent.IsModifierActiveOrQueued
// 0x0004 (0x0004 - 0x0000)
struct MoverComponent_IsModifierActiveOrQueued final
{
public:
	struct FMovementModifierHandle                ModifierHandle;                                    // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_IsModifierActiveOrQueued;

// Function Mover.MoverComponent.IsUsingDeferredGroupMovement
// 0x0001 (0x0001 - 0x0000)
struct MoverComponent_IsUsingDeferredGroupMovement final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_IsUsingDeferredGroupMovement;

// Function Mover.MoverComponent.K2_FindActiveLayeredMove
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_K2_FindActiveLayeredMove final
{
public:
	bool                                          DidSucceed;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetAsRawBytes;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_K2_FindActiveLayeredMove;

// Function Mover.MoverComponent.K2_FindMovementModifier
// 0x0008 (0x0008 - 0x0000)
struct MoverComponent_K2_FindMovementModifier final
{
public:
	struct FMovementModifierHandle                ModifierHandle;                                    // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bFoundModifier;                                    // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetAsRawBytes;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverComponent_K2_FindMovementModifier;

// Function Mover.MoverComponent.TryGetFloorCheckHitResult
// 0x0108 (0x0108 - 0x0000)
struct MoverComponent_TryGetFloorCheckHitResult final
{
public:
	struct FHitResult                             OutHitResult;                                      // 0x0000(0x0100)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverComponent_TryGetFloorCheckHitResult;

// Function Mover.PathedPhysicsMoverComponent.SetDefaultPlaybackBehavior
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_SetDefaultPlaybackBehavior final
{
public:
	EPathedPhysicsPlaybackBehavior                PlaybackBehavior;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_SetDefaultPlaybackBehavior;

// Function Mover.PathedPhysicsMoverComponent.SetIsMoving
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_SetIsMoving final
{
public:
	bool                                          bShouldMove;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_SetIsMoving;

// Function Mover.PathedPhysicsMoverComponent.SetPathOriginTransform
// 0x0060 (0x0060 - 0x0000)
struct PathedPhysicsMoverComponent_SetPathOriginTransform final
{
public:
	struct FTransform                             NewPathOrigin;                                     // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_SetPathOriginTransform;

// Function Mover.PathedPhysicsMoverComponent.SetPlaybackDirection
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_SetPlaybackDirection final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_SetPlaybackDirection;

// Function Mover.PathedPhysicsMoverComponent.GetDefaultPlaybackBehavior
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_GetDefaultPlaybackBehavior final
{
public:
	EPathedPhysicsPlaybackBehavior                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_GetDefaultPlaybackBehavior;

// Function Mover.PathedPhysicsMoverComponent.GetPathOriginTransform
// 0x0060 (0x0060 - 0x0000)
struct PathedPhysicsMoverComponent_GetPathOriginTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_GetPathOriginTransform;

// Function Mover.PathedPhysicsMoverComponent.IsInReverse
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_IsInReverse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_IsInReverse;

// Function Mover.PathedPhysicsMoverComponent.IsJointEnabled
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_IsJointEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_IsJointEnabled;

// Function Mover.PathedPhysicsMoverComponent.IsMoving
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMoverComponent_IsMoving final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMoverComponent_IsMoving;

// Function Mover.BaseMovementMode.K2_OnRegistered
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_K2_OnRegistered final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_K2_OnRegistered;

// Function Mover.BaseMovementMode.SimulationTick
// 0x0200 (0x0200 - 0x0000)
struct BaseMovementMode_SimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x0120(0x00E0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_SimulationTick;

// Function Mover.BaseMovementMode.GenerateMove
// 0x0100 (0x0100 - 0x0000)
struct BaseMovementMode_GenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0098(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x00A8(0x0058)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_GenerateMove;

// Function Mover.BaseMovementMode.K2_GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_K2_GetMoverComponent final
{
public:
	class UMoverComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_K2_GetMoverComponent;

// Function Mover.PathedPhysicsMovementMode.SetPathDuration_BeginPlayOnly
// 0x0004 (0x0004 - 0x0000)
struct PathedPhysicsMovementMode_SetPathDuration_BeginPlayOnly final
{
public:
	float                                         NewDuration;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMovementMode_SetPathDuration_BeginPlayOnly;

// Function Mover.PathedPhysicsMovementMode.SetUseJointConstraint
// 0x0001 (0x0001 - 0x0000)
struct PathedPhysicsMovementMode_SetUseJointConstraint final
{
public:
	bool                                          bUseJoint;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMovementMode_SetUseJointConstraint;

// Function Mover.PathedPhysicsMovementMode.BP_FindPattern
// 0x0010 (0x0010 - 0x0000)
struct PathedPhysicsMovementMode_BP_FindPattern final
{
public:
	TSubclassOf<class UPathedMovementPatternBase> PatternType;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPathedMovementPatternBase*             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PathedPhysicsMovementMode_BP_FindPattern;

// Function Mover.CharacterMoverComponent.CanCrouch
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_CanCrouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_CanCrouch;

// Function Mover.CharacterMoverComponent.Jump
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_Jump final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_Jump;

// Function Mover.CharacterMoverComponent.OnMoverPreSimulationTick
// 0x0020 (0x0020 - 0x0000)
struct CharacterMoverComponent_OnMoverPreSimulationTick final
{
public:
	struct FMoverTimeStep                         TimeStep;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverInputCmdContext                  InputCmd;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_OnMoverPreSimulationTick;

// Function Mover.CharacterMoverComponent.SetHandleJump
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_SetHandleJump final
{
public:
	bool                                          bInHandleJump;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_SetHandleJump;

// Function Mover.CharacterMoverComponent.SetHandleStanceChanges
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_SetHandleStanceChanges final
{
public:
	bool                                          bInHandleStanceChanges;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_SetHandleStanceChanges;

// Function Mover.CharacterMoverComponent.CanActorJump
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_CanActorJump final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_CanActorJump;

// Function Mover.CharacterMoverComponent.GetHandleJump
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_GetHandleJump final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_GetHandleJump;

// Function Mover.CharacterMoverComponent.GetHandleStanceChanges
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_GetHandleStanceChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_GetHandleStanceChanges;

// Function Mover.CharacterMoverComponent.IsAirborne
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsAirborne final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsAirborne;

// Function Mover.CharacterMoverComponent.IsCrouching
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsCrouching final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsCrouching;

// Function Mover.CharacterMoverComponent.IsFalling
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsFalling final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsFalling;

// Function Mover.CharacterMoverComponent.IsFlying
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsFlying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsFlying;

// Function Mover.CharacterMoverComponent.IsOnGround
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsOnGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsOnGround;

// Function Mover.CharacterMoverComponent.IsSlopeSliding
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsSlopeSliding final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsSlopeSliding;

// Function Mover.CharacterMoverComponent.IsSwimming
// 0x0001 (0x0001 - 0x0000)
struct CharacterMoverComponent_IsSwimming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMoverComponent_IsSwimming;

// Function Mover.PlanarConstraintUtils.ConstrainDirectionToPlane
// 0x0070 (0x0070 - 0x0000)
struct PlanarConstraintUtils_ConstrainDirectionToPlane final
{
public:
	struct FPlanarConstraint                      Constraint;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0038(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainMagnitude;                                // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlanarConstraintUtils_ConstrainDirectionToPlane;

// Function Mover.PlanarConstraintUtils.ConstrainLocationToPlane
// 0x0068 (0x0068 - 0x0000)
struct PlanarConstraintUtils_ConstrainLocationToPlane final
{
public:
	struct FPlanarConstraint                      Constraint;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0038(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlanarConstraintUtils_ConstrainLocationToPlane;

// Function Mover.PlanarConstraintUtils.ConstrainNormalToPlane
// 0x0068 (0x0068 - 0x0000)
struct PlanarConstraintUtils_ConstrainNormalToPlane final
{
public:
	struct FPlanarConstraint                      Constraint;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0038(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlanarConstraintUtils_ConstrainNormalToPlane;

// Function Mover.PlanarConstraintUtils.SetPlanarConstraintEnabled
// 0x0040 (0x0040 - 0x0000)
struct PlanarConstraintUtils_SetPlanarConstraintEnabled final
{
public:
	struct FPlanarConstraint                      Constraint;                                        // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PlanarConstraintUtils_SetPlanarConstraintEnabled;

