#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Mover_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NetworkPrediction_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AnimGraphRuntime_classes.hpp"
#include "MotionWarping_classes.hpp"


SDK_NAMESPACE_START

// Class Mover.AirMovementUtils
// 0x0000 (0x0028 - 0x0028)
class UAirMovementUtils final : public UBlueprintFunctionLibrary
{
public:
	static struct FProposedMove ComputeControlledFreeMove(const struct FFreeMoveParams& InParams);
	static bool IsValidLandingSpot(const struct FMovingComponentSet& MovingComps, const struct FVector& Location, const struct FHitResult& Hit, float FloorSweepDistance, float MaxWalkSlopeCosine, struct FFloorCheckResult& OutFloorResult);
	static float TestFallingMoveAlongHitSurface(const struct FMovingComponentSet& MovingComps, const struct FVector& OriginalMoveDelta, const struct FVector& LocationAtHit, const struct FQuat& TargetRotation, bool bHandleImpact, float FloorSweepDistance, float MaxWalkSlopeCosine, struct FHitResult& InOutHit, struct FFloorCheckResult& OutFloorResult, struct FMovementRecord& InOutMoveRecord);
	static float TryMoveToFallAlongSurface(const struct FMovingComponentSet& MovingComps, const struct FVector& Delta, float PctOfDeltaToMove, const struct FQuat& Rotation, const struct FVector& Normal, struct FHitResult& Hit, bool bHandleImpact, float FloorSweepDistance, float MaxWalkSlopeCosine, struct FFloorCheckResult& OutFloorResult, struct FMovementRecord& MoveRecord);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AirMovementUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AirMovementUtils")
	}
	static class UAirMovementUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAirMovementUtils>();
	}
};
DUMPER7_ASSERTS_UAirMovementUtils;

// Class Mover.MoverComponent
// 0x0438 (0x04F0 - 0x00B8)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UMoverComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep, const struct FMoverInputCmdContext& InputCmd)> OnPreSimulationTick; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep, struct FMoverSyncState* SyncState, struct FMoverAuxStateContext* AuxState)> OnPostMovement; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep)> OnPostSimulationTick;      // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& CurrentTimeStep, const struct FMoverTimeStep& ExpungedTimeStep)> OnPostSimulationRollback; // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& PreviousMovementModeName, const class FName& NewMovementModeName)> OnMovementModeChanged; // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverSyncState& SyncState, const struct FMoverAuxStateContext& AuxState)> OnPostFinalize; // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UActorComponent>            BackendClass;                                      // 0x0128(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UBaseMovementMode*>   MovementModes;                                     // 0x0130(0x0050)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   StartingMovementMode;                              // 0x0180(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBaseMovementModeTransition*>    Transitions;                                       // 0x0188(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FMoverDataPersistence>          PersistentSyncStateDataTypes;                      // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                InputProducer;                                     // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMovementMixer*                         MovementMixer;                                     // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_1B8[0x20];                                     // 0x01B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep, const struct FMoverInputCmdContext& InputCmd, const struct FMoverSyncState& SyncState, const struct FMoverAuxStateContext& AuxState)> OnPreMovement; // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        UpdatedComponent;                                  // 0x01F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UPrimitiveComponent*                    UpdatedCompAsPrimitive;                            // 0x01F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USceneComponent*                        PrimaryVisualComponent;                            // 0x0200(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_208[0x1C8];                                    // 0x0208(0x01C8)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMoverBackendLiaisonInterface> BackendLiaisonComp;                        // 0x03D0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E0[0x38];                                     // 0x03E0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementModeStateMachine*              ModeFSM;                                           // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMoverBlackboard*                       SimBlackboard;                                     // 0x0420(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UObject*>                        SharedSettings;                                    // 0x0428(0x0010)(Edit, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FVector                                GravityAccelOverride;                              // 0x0438(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPlanarConstraint                      PlanarConstraint;                                  // 0x0450(0x0038)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	EMoverSmoothingMode                           SmoothingMode;                                     // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasGravityOverride;                               // 0x0489(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseDeferredGroupMovement;                         // 0x048A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48B[0x5];                                      // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  WorldToGravityTransform;                           // 0x0490(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQuat                                  GravityToWorldTransform;                           // 0x04B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSupportsKinematicBasedMovement;                   // 0x04D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D1[0x17];                                     // 0x04D1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGameplayTag(const struct FGameplayTag& TagToAdd);
	void AddGameplayTags(const struct FGameplayTagContainer& TagsToAdd);
	class UBaseMovementMode* AddMovementModeFromClass(class FName ModeName, TSubclassOf<class UBaseMovementMode> MovementMode);
	bool AddMovementModeFromObject(class FName ModeName, class UBaseMovementMode* MovementMode);
	void BindProcessGeneratedMovement(TDelegate<void(const struct FMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove)> ProcessGeneratedMovementEvent);
	void CancelModifierFromHandle(const struct FMovementModifierHandle& ModifierHandle);
	TArray<struct FTrajectorySampleInfo> GetFutureTrajectory(float FutureSeconds, float SamplesPerSecond);
	TArray<struct FTrajectorySampleInfo> GetPredictedTrajectory(const struct FMoverPredictTrajectoryParams& PredictionParams);
	void HandleImpact(struct FMoverOnImpactParams* ImpactParams);
	void K2_QueueInstantMovementEffect(const int32& EffectAsRawData);
	void K2_QueueLayeredMove(const int32& MoveAsRawData);
	struct FMovementModifierHandle K2_QueueMovementModifier(const int32& MoveAsRawData);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);
	void QueueNextMode(class FName DesiredModeName, bool bShouldReenter);
	void RemoveGameplayTag(const struct FGameplayTag& TagToRemove);
	void RemoveGameplayTags(const struct FGameplayTagContainer& TagsToRemove);
	bool RemoveMovementMode(class FName ModeName);
	void SetBaseVisualComponentTransform(const struct FTransform& ComponentTransform);
	void SetGravityOverride(bool bOverrideGravity, const struct FVector& GravityAcceleration);
	void SetPlanarConstraint(const struct FPlanarConstraint& InConstraint);
	void SetPrimaryVisualComponent(class USceneComponent* SceneComponent);
	void SetUpdatedComponent(class USceneComponent* NewUpdatedComponent);
	void SetUseDeferredGroupMovement(bool bEnable);
	void UnbindProcessGeneratedMovement();

	class UBaseMovementMode* FindMovementMode(TSubclassOf<class UBaseMovementMode> MovementMode) const;
	class UBaseMovementMode* FindMovementModeByName(class FName MovementModeName) const;
	const class UObject* FindSharedSettings_BP(TSubclassOf<class UObject> SharedSetting) const;
	class UObject* FindSharedSettings_Mutable_BP(TSubclassOf<class UObject> SharedSetting) const;
	struct FTransform GetBaseVisualComponentTransform() const;
	struct FVector GetGravityAcceleration() const;
	const struct FMoverInputCmdContext GetLastInputCmd() const;
	const struct FMoverTimeStep GetLastTimeStep() const;
	class UPrimitiveComponent* GetMovementBase() const;
	class FName GetMovementBaseBoneName() const;
	struct FVector GetMovementIntent() const;
	const class UBaseMovementMode* GetMovementMode() const;
	class FName GetMovementModeName() const;
	const struct FPlanarConstraint GetPlanarConstraint() const;
	class USceneComponent* GetPrimaryVisualComponent() const;
	const class UMoverBlackboard* GetSimBlackboard() const;
	const struct FMoverSyncState GetSyncState() const;
	struct FRotator GetTargetOrientation() const;
	class USceneComponent* GetUpdatedComponent() const;
	struct FVector GetUpDirection() const;
	struct FVector GetVelocity() const;
	bool HasGameplayTag(const struct FGameplayTag& TagToFind, bool bExactMatch) const;
	bool HasGameplayTagInState(const struct FMoverSyncState& SyncState, const struct FGameplayTag& TagToFind, bool bExactMatch) const;
	bool HasValidCachedInputCmd() const;
	bool HasValidCachedState() const;
	bool IsModifierActiveOrQueued(const struct FMovementModifierHandle& ModifierHandle) const;
	bool IsUsingDeferredGroupMovement() const;
	void K2_FindActiveLayeredMove(bool* DidSucceed, int32* TargetAsRawBytes) const;
	void K2_FindMovementModifier(const struct FMovementModifierHandle& ModifierHandle, bool* bFoundModifier, int32* TargetAsRawBytes) const;
	bool TryGetFloorCheckHitResult(struct FHitResult* OutHitResult) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverComponent")
	}
	static class UMoverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UMoverComponent;

// Class Mover.PathedPhysicsMoverComponent
// 0x0020 (0x0510 - 0x04F0)
class UPathedPhysicsMoverComponent final : public UMoverComponent
{
public:
	bool                                          bAutoMoveOnSpawn;                                  // 0x04E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPathedPhysicsPlaybackBehavior                DefaultPlaybackBehavior;                           // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EA[0x2];                                      // 0x04EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementStartDelay;                                // 0x04EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoverPathedPhysicsLiaisonComponent*    PathedPhysicsLiaison;                              // 0x04F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bDisplayProgressPreviewMesh;                       // 0x04F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewMeshProgress;                               // 0x04FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     ProgressPreviewMeshMaterial;                       // 0x0500(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UPathedPhysicsDebugDrawComponent*       DebugDrawComp;                                     // 0x0508(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetDefaultPlaybackBehavior(EPathedPhysicsPlaybackBehavior PlaybackBehavior);
	void SetIsMoving(bool bShouldMove);
	void SetPathOriginTransform(const struct FTransform& NewPathOrigin);
	void SetPlaybackDirection(bool bPlayForward);

	EPathedPhysicsPlaybackBehavior GetDefaultPlaybackBehavior() const;
	const struct FTransform GetPathOriginTransform() const;
	bool IsInReverse() const;
	bool IsJointEnabled() const;
	bool IsMoving() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PathedPhysicsMoverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PathedPhysicsMoverComponent")
	}
	static class UPathedPhysicsMoverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPathedPhysicsMoverComponent>();
	}
};
DUMPER7_ASSERTS_UPathedPhysicsMoverComponent;

// Class Mover.BaseMovementMode
// 0x0048 (0x0070 - 0x0028)
class UBaseMovementMode : public UObject
{
public:
	TArray<TSubclassOf<class UObject>>            SharedSettingsClasses;                             // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UBaseMovementModeTransition*>    Transitions;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0048(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bSupportsAsync;                                    // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnActivated();
	void K2_OnDeactivated();
	void K2_OnRegistered(const class FName ModeName);
	void K2_OnUnregistered();
	void SimulationTick(const struct FSimulationTickParams& Params_0, struct FMoverTickEndData* OutputState);

	void GenerateMove(const struct FMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove) const;
	class UMoverComponent* K2_GetMoverComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMovementMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMovementMode")
	}
	static class UBaseMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMovementMode>();
	}
};
DUMPER7_ASSERTS_UBaseMovementMode;

// Class Mover.PathedPhysicsMovementMode
// 0x0220 (0x0290 - 0x0070)
class alignas(0x10) UPathedPhysicsMovementMode final : public UBaseMovementMode
{
public:
	bool                                          bUseJointConstraint;                               // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConstraintProfileProperties           JointConstraintProperties;                         // 0x0078(0x0160)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TOptional<EPathedPhysicsPlaybackBehavior>     PlaybackBehaviorOverride;                          // 0x01D8(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OneWayTripDuration;                                // 0x01DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPathedMovementPatternBase*>     PathPatterns;                                      // 0x01E0(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	EAlphaBlendOption                             Easing;                                            // 0x01F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CustomEasingCurve;                                 // 0x01F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_200[0x88];                                     // 0x0200(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDebugDrawAggregatePath;                           // 0x0288(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowPatternDebugDrawing;                         // 0x0289(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 PathDebugDrawColor;                                // 0x028C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPathDuration_BeginPlayOnly(float NewDuration);
	void SetUseJointConstraint(bool bUseJoint);

	class UPathedMovementPatternBase* BP_FindPattern(TSubclassOf<class UPathedMovementPatternBase> PatternType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PathedPhysicsMovementMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PathedPhysicsMovementMode")
	}
	static class UPathedPhysicsMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPathedPhysicsMovementMode>();
	}
};
DUMPER7_ASSERTS_UPathedPhysicsMovementMode;

// Class Mover.PathedMovementPatternBase
// 0x0028 (0x0050 - 0x0028)
class UPathedMovementPatternBase : public UObject
{
public:
	uint8                                         TranslationMasks;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         RotationMasks;                                     // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         ScaleMasks;                                        // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStartAfterPreviousPattern;                        // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartAtPathProgress;                               // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndAtPathProgress;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumLoopsPerPath;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPathedPhysicsPlaybackBehavior                PerLoopBehavior;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOrientComponentToPath;                            // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAlphaBlendOption                             Easing;                                            // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CustomEasingCurve;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bDebugDrawPattern;                                 // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 PatternDebugDrawColor;                             // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PathedMovementPatternBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PathedMovementPatternBase")
	}
	static class UPathedMovementPatternBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPathedMovementPatternBase>();
	}
};
DUMPER7_ASSERTS_UPathedMovementPatternBase;

// Class Mover.ArcRotationPattern
// 0x0020 (0x0070 - 0x0050)
class UArcRotationPattern final : public UPathedMovementPatternBase
{
public:
	float                                         RotationArcAngle;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RotationAxis;                                      // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArcRotationPattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArcRotationPattern")
	}
	static class UArcRotationPattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcRotationPattern>();
	}
};
DUMPER7_ASSERTS_UArcRotationPattern;

// Class Mover.CharacterMoverComponent
// 0x0010 (0x0500 - 0x04F0)
class UCharacterMoverComponent : public UMoverComponent
{
public:
	TMulticastInlineDelegate<void(EStanceMode OldStance, EStanceMode NewStance)> OnStanceChanged;    // 0x04E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F8[0x2];                                      // 0x04F8(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bWantsToCrouch : 1;                                // 0x04FA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHandleJump : 1;                                   // 0x04FA(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHandleStanceChanges : 1;                          // 0x04FA(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4FB[0x5];                                      // 0x04FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanCrouch();
	void Crouch();
	bool Jump();
	void OnMoverPreSimulationTick(const struct FMoverTimeStep& TimeStep, const struct FMoverInputCmdContext& InputCmd);
	void SetHandleJump(bool bInHandleJump);
	void SetHandleStanceChanges(bool bInHandleStanceChanges);
	void UnCrouch();

	bool CanActorJump() const;
	bool GetHandleJump() const;
	bool GetHandleStanceChanges() const;
	bool IsAirborne() const;
	bool IsCrouching() const;
	bool IsFalling() const;
	bool IsFlying() const;
	bool IsOnGround() const;
	bool IsSlopeSliding() const;
	bool IsSwimming() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterMoverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterMoverComponent")
	}
	static class UCharacterMoverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterMoverComponent>();
	}
};
DUMPER7_ASSERTS_UCharacterMoverComponent;

// Class Mover.CommonLegacyMovementSettings
// 0x0070 (0x0098 - 0x0028)
class UCommonLegacyMovementSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldRemainVertical;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GroundMovementModeName;                            // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AirMovementModeName;                               // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SwimmingMovementModeName;                          // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorSweepDistance;                                // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxStepHeight;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAccelerationForVelocityMove;                   // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundFriction;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseSeparateBrakingFriction : 1;                   // 0x0064(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingFriction;                                   // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakingFrictionFactor;                             // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRate;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreBaseRotation;                               // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpUpwardsSpeed;                                  // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwimmingStartImmersionDepth;                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwimmingIdealImmersionDepth;                       // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwimmingStopImmersionDepth;                        // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonLegacyMovementSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonLegacyMovementSettings")
	}
	static class UCommonLegacyMovementSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonLegacyMovementSettings>();
	}
};
DUMPER7_ASSERTS_UCommonLegacyMovementSettings;

// Class Mover.PlanarConstraintUtils
// 0x0000 (0x0028 - 0x0028)
class UPlanarConstraintUtils final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector ConstrainDirectionToPlane(const struct FPlanarConstraint& Constraint, const struct FVector& Direction, bool bMaintainMagnitude);
	static struct FVector ConstrainLocationToPlane(const struct FPlanarConstraint& Constraint, const struct FVector& Location);
	static struct FVector ConstrainNormalToPlane(const struct FPlanarConstraint& Constraint, const struct FVector& Normal);
	static void SetPlanarConstraintEnabled(struct FPlanarConstraint& Constraint, bool bEnabled);
	static void SetPlanarConstraintNormal(struct FPlanarConstraint& Constraint, const struct FVector& PlaneNormal);
	static void SetPlaneConstraintOrigin(struct FPlanarConstraint& Constraint, const struct FVector& PlaneOrigin);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlanarConstraintUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlanarConstraintUtils")
	}
	static class UPlanarConstraintUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlanarConstraintUtils>();
	}
};
DUMPER7_ASSERTS_UPlanarConstraintUtils;

// Class Mover.FloorQueryUtils
// 0x0000 (0x0028 - 0x0028)
class UFloorQueryUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool IsHitSurfaceWalkable(const struct FHitResult& Hit, const struct FVector& UpDirection, float MaxWalkSlopeCosine);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FloorQueryUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FloorQueryUtils")
	}
	static class UFloorQueryUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloorQueryUtils>();
	}
};
DUMPER7_ASSERTS_UFloorQueryUtils;

// Class Mover.GroundMovementUtils
// 0x0000 (0x0028 - 0x0028)
class UGroundMovementUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool CanStepUpOnHitSurface(const struct FHitResult& Hit);
	static struct FProposedMove ComputeControlledGroundMove(const struct FGroundMoveParams& InParams);
	static struct FVector ComputeDeflectedMoveOntoRamp(const struct FVector& OrigMoveDelta, const struct FVector& UpDirection, const struct FHitResult& RampHitResult, float MaxWalkSlopeCosine, const bool bHitFromLineTrace);
	static float TestGroundedMoveAlongHitSurface(const struct FMovingComponentSet& MovingComps, const struct FVector& OriginalMoveDelta, const struct FVector& LocationAtHit, const struct FQuat& TargetRotation, bool bHandleImpact, float MaxStepHeight, float MaxWalkSlopeCosine, struct FHitResult& InOutHit, struct FMovementRecord& InOutMoveRecord);
	static struct FVector TestMoveToAdjustToFloor(const struct FMovingComponentSet& MovingComps, const struct FVector& Location, const struct FQuat& Rotation, float MaxWalkSlopeCosine, struct FFloorCheckResult& InOutCurrentFloor, struct FMovementRecord& InOutMoveRecord);
	static float TryWalkToSlideAlongSurface(const struct FMovingComponentSet& MovingComps, const struct FVector& Delta, float PctOfDeltaToMove, const struct FQuat& Rotation, const struct FVector& Normal, struct FHitResult& Hit, bool bHandleImpact, struct FMovementRecord& MoveRecord, float MaxWalkSlopeCosine, float MaxStepHeight);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroundMovementUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroundMovementUtils")
	}
	static class UGroundMovementUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroundMovementUtils>();
	}
};
DUMPER7_ASSERTS_UGroundMovementUtils;

// Class Mover.LookAtRotationPattern
// 0x0018 (0x0068 - 0x0050)
class ULookAtRotationPattern final : public UPathedMovementPatternBase
{
public:
	struct FVector                                RelativeLookAtLocation;                            // 0x0050(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetLookAtLocation(const struct FVector& LookAt);
	void SetRelativeLookAtLocation(const struct FVector& RelativeLookAt);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LookAtRotationPattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LookAtRotationPattern")
	}
	static class ULookAtRotationPattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULookAtRotationPattern>();
	}
};
DUMPER7_ASSERTS_ULookAtRotationPattern;

// Class Mover.TurnGeneratorInterface
// 0x0000 (0x0000 - 0x0000)
class ITurnGeneratorInterface final
{
public:
	struct FRotator GetTurn(const struct FRotator& TargetOrientation, const struct FMoverTickStartData& FullStartState, const struct FMoverDefaultSyncState& MoverState, const struct FMoverTimeStep& TimeStep, const struct FProposedMove& ProposedMove, class UMoverBlackboard* SimBlackboard);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TurnGeneratorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TurnGeneratorInterface")
	}
	static class ITurnGeneratorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITurnGeneratorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITurnGeneratorInterface;

// Class Mover.LinearTurnGenerator
// 0x0018 (0x0040 - 0x0028)
class ULinearTurnGenerator final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadingRate;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchRate;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollRate;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LinearTurnGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LinearTurnGenerator")
	}
	static class ULinearTurnGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearTurnGenerator>();
	}
};
DUMPER7_ASSERTS_ULinearTurnGenerator;

// Class Mover.ExactDampedTurnGenerator
// 0x0010 (0x0038 - 0x0028)
class UExactDampedTurnGenerator final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HalfLifeSeconds;                                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExactDampedTurnGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExactDampedTurnGenerator")
	}
	static class UExactDampedTurnGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExactDampedTurnGenerator>();
	}
};
DUMPER7_ASSERTS_UExactDampedTurnGenerator;

// Class Mover.BlueprintableTurnGenerator
// 0x0008 (0x0030 - 0x0028)
class UBlueprintableTurnGenerator final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintableTurnGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintableTurnGenerator")
	}
	static class UBlueprintableTurnGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintableTurnGenerator>();
	}
};
DUMPER7_ASSERTS_UBlueprintableTurnGenerator;

// Class Mover.MotionWarpingMoverAdapter
// 0x0008 (0x0040 - 0x0038)
class UMotionWarpingMoverAdapter final : public UMotionWarpingBaseAdapter
{
public:
	class UMoverComponent*                        TargetMoverComp;                                   // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionWarpingMoverAdapter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionWarpingMoverAdapter")
	}
	static class UMotionWarpingMoverAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingMoverAdapter>();
	}
};
DUMPER7_ASSERTS_UMotionWarpingMoverAdapter;

// Class Mover.MovementMixer
// 0x0008 (0x0030 - 0x0028)
class UMovementMixer final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovementMixer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovementMixer")
	}
	static class UMovementMixer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementMixer>();
	}
};
DUMPER7_ASSERTS_UMovementMixer;

// Class Mover.MovementRecordUtils
// 0x0000 (0x0028 - 0x0028)
class UMovementRecordUtils final : public UBlueprintFunctionLibrary
{
public:
	static const struct FVector K2_GetRelevantMoveDelta(const struct FMovementRecord& MovementRecord);
	static struct FVector K2_GetRelevantVelocity(const struct FMovementRecord& MovementRecord);
	static const struct FVector K2_GetTotalMoveDelta(const struct FMovementRecord& MovementRecord);
	static void K2_SetDeltaSeconds(struct FMovementRecord& OutMovementRecord, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovementRecordUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovementRecordUtils")
	}
	static class UMovementRecordUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementRecordUtils>();
	}
};
DUMPER7_ASSERTS_UMovementRecordUtils;

// Class Mover.MoverBackendLiaisonInterface
// 0x0000 (0x0000 - 0x0000)
class IMoverBackendLiaisonInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverBackendLiaisonInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverBackendLiaisonInterface")
	}
	static class IMoverBackendLiaisonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMoverBackendLiaisonInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMoverBackendLiaisonInterface;

// Class Mover.MoverBlackboard
// 0x0058 (0x0080 - 0x0028)
class UMoverBlackboard final : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverBlackboard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverBlackboard")
	}
	static class UMoverBlackboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverBlackboard>();
	}
};
DUMPER7_ASSERTS_UMoverBlackboard;

// Class Mover.MoverDataModelBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMoverDataModelBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetLocationFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FVector GetMoveDirectionIntentFromInputs(const struct FCharacterDefaultInputs& Inputs);
	static struct FVector GetMoveDirectionIntentFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FRotator GetOrientationFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FVector GetVelocityFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static void SetMoveIntent(struct FCharacterDefaultInputs& Inputs, const struct FVector& WorldDirectionIntent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverDataModelBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverDataModelBlueprintLibrary")
	}
	static class UMoverDataModelBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverDataModelBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UMoverDataModelBlueprintLibrary;

// Class Mover.MoverDebugComponent
// 0x0078 (0x0130 - 0x00B8)
class UMoverDebugComponent final : public UActorComponent
{
public:
	float                                         LookaheadSeconds;                                  // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LookaheadSamplesPerSecond;                         // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTrajectory;                                   // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTrail;                                        // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCorrections;                                  // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HistoryTrackingSeconds;                            // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HistorySamplesPerSecond;                           // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x64];                                      // 0x00CC(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHistoryTrackingRollback(const struct FMoverTimeStep& NewTimeStep, const struct FMoverTimeStep& InvalidatedTimeStep);
	void OnMovementSimRollback(const struct FMoverTimeStep& NewTimeStep, const struct FMoverTimeStep& InvalidatedTimeStep);
	void OnMovementSimTick(const struct FMoverTimeStep& TimeStep);
	void SetHistoryTracking(float SecondsToTrack, float SamplesPerSecond);

	TArray<struct FTrajectorySampleInfo> GetPastTrajectory() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverDebugComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverDebugComponent")
	}
	static class UMoverDebugComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverDebugComponent>();
	}
};
DUMPER7_ASSERTS_UMoverDebugComponent;

// Class Mover.MoverDeveloperSettings
// 0x0008 (0x0040 - 0x0038)
class UMoverDeveloperSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	int32                                         MaxTimesToRefundSubstep;                           // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverDeveloperSettings")
	}
	static class UMoverDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UMoverDeveloperSettings;

// Class Mover.MoverNetworkPhysicsLiaisonComponentBase
// 0x01C8 (0x0280 - 0x00B8)
class UMoverNetworkPhysicsLiaisonComponentBase : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x90];                                      // 0x00B8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetworkPhysicsComponent*               NetworkPhysicsComponent;                           // 0x0148(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_150[0x130];                                    // 0x0150(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleComponentPhysicsStateChanged(class UPrimitiveComponent* ChangedComponent, EComponentPhysicsStateChange StateChange);
	void HandleOwningPawnControllerChanged_Server(class APawn* OwnerPawn, class AController* OldController, class AController* NewController);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverNetworkPhysicsLiaisonComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverNetworkPhysicsLiaisonComponentBase")
	}
	static class UMoverNetworkPhysicsLiaisonComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverNetworkPhysicsLiaisonComponentBase>();
	}
};
DUMPER7_ASSERTS_UMoverNetworkPhysicsLiaisonComponentBase;

// Class Mover.MoverNetworkPhysicsLiaisonComponent
// 0x0010 (0x0290 - 0x0280)
class UMoverNetworkPhysicsLiaisonComponent final : public UMoverNetworkPhysicsLiaisonComponentBase
{
public:
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverNetworkPhysicsLiaisonComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverNetworkPhysicsLiaisonComponent")
	}
	static class UMoverNetworkPhysicsLiaisonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverNetworkPhysicsLiaisonComponent>();
	}
};
DUMPER7_ASSERTS_UMoverNetworkPhysicsLiaisonComponent;

// Class Mover.MoverNetworkPredictionLiaisonComponent
// 0x0020 (0x0290 - 0x0270)
class UMoverNetworkPredictionLiaisonComponent final : public UNetworkPredictionComponent
{
public:
	uint8                                         Pad_270[0x20];                                     // 0x0270(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverNetworkPredictionLiaisonComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverNetworkPredictionLiaisonComponent")
	}
	static class UMoverNetworkPredictionLiaisonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverNetworkPredictionLiaisonComponent>();
	}
};
DUMPER7_ASSERTS_UMoverNetworkPredictionLiaisonComponent;

// Class Mover.MoverTrajectoryPredictor
// 0x0010 (0x0038 - 0x0028)
class UMoverTrajectoryPredictor final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Setup(class UMoverComponent* InMoverComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverTrajectoryPredictor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverTrajectoryPredictor")
	}
	static class UMoverTrajectoryPredictor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverTrajectoryPredictor>();
	}
};
DUMPER7_ASSERTS_UMoverTrajectoryPredictor;

// Class Mover.MoverInputProducerInterface
// 0x0000 (0x0000 - 0x0000)
class IMoverInputProducerInterface final
{
public:
	void ProduceInput(int32 SimTimeMs, struct FMoverInputCmdContext* InputCmdResult);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoverInputProducerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoverInputProducerInterface")
	}
	static class IMoverInputProducerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMoverInputProducerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
