#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineMP4Encoder

#include "Basic.hpp"

#include "MovieRenderPipelineMP4Encoder_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "MovieRenderPipelineCore_classes.hpp"


SDK_NAMESPACE_START

// Class MovieRenderPipelineMP4Encoder.MovieGraphMP4EncoderNode
// 0x0118 (0x01E0 - 0x00C8)
class UMovieGraphMP4EncoderNode final : public UMovieGraphVideoOutputNode
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_EncodingRateControl : 1;                 // 0x00D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AverageBitrateInMbps : 1;                // 0x00D0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxBitrateInMbps : 1;                    // 0x00D0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ConstantRateFactor : 1;                  // 0x00D0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodingProfile : 1;                     // 0x00D0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodingLevel : 1;                       // 0x00D0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bIncludeAudio : 1;                       // 0x00D0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OCIOConfiguration : 1;                   // 0x00D0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OCIOContext : 1;                         // 0x00D1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EMoviePipelineMP4EncodeRateControlMode        EncodingRateControl;                               // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AverageBitrateInMbps;                              // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBitrateInMbps;                                  // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConstantRateFactor;                                // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineMP4EncodeProfile                EncodingProfile;                                   // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineMP4EncodeLevel                  EncodingLevel;                                     // 0x00E1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAudio;                                     // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenColorIODisplayConfiguration       OCIOConfiguration;                                 // 0x00E8(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            OCIOContext;                                       // 0x0190(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphMP4EncoderNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphMP4EncoderNode")
	}
	static class UMovieGraphMP4EncoderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMP4EncoderNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphMP4EncoderNode;

// Class MovieRenderPipelineMP4Encoder.MoviePipelineMP4EncoderOutput
// 0x0018 (0x00A8 - 0x0090)
class UMoviePipelineMP4EncoderOutput final : public UMoviePipelineVideoOutputBase
{
public:
	EMoviePipelineMP4EncodeRateControlMode        EncodingRateControl;                               // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AverageBitrateInMbps;                              // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBitrateInMbps;                                  // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConstantRateFactor;                                // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineMP4EncodeProfile                EncodingProfile;                                   // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineMP4EncodeLevel                  EncodingLevel;                                     // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAudio;                                     // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineMP4EncoderOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineMP4EncoderOutput")
	}
	static class UMoviePipelineMP4EncoderOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineMP4EncoderOutput>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineMP4EncoderOutput;

SDK_NAMESPACE_END
