#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class MovieScene.MovieSceneBlenderSystemSupport
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBlenderSystemSupport final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBlenderSystemSupport")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBlenderSystemSupport")
	}
	static class IMovieSceneBlenderSystemSupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBlenderSystemSupport>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBlenderSystemSupport;

// Class MovieScene.MovieSceneBoundObjectProxy
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBoundObjectProxy final
{
public:
	class UObject* BP_GetBoundObjectForSequencer(class UObject* ResolvedObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBoundObjectProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBoundObjectProxy")
	}
	static class IMovieSceneBoundObjectProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBoundObjectProxy>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBoundObjectProxy;

// Class MovieScene.MovieSceneChannelDecoration
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneChannelDecoration final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneChannelDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneChannelDecoration")
	}
	static class IMovieSceneChannelDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneChannelDecoration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneChannelDecoration;

// Class MovieScene.MovieSceneChannelOverrideProvider
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneChannelOverrideProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneChannelOverrideProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneChannelOverrideProvider")
	}
	static class IMovieSceneChannelOverrideProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneChannelOverrideProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneChannelOverrideProvider;

// Class MovieScene.MovieSceneChannelOwner
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneChannelOwner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneChannelOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneChannelOwner")
	}
	static class IMovieSceneChannelOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneChannelOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneChannelOwner;

// Class MovieScene.MovieSceneDecoration
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneDecoration final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDecoration")
	}
	static class IMovieSceneDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneDecoration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneDecoration;

// Class MovieScene.MovieSceneDeterminismSource
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneDeterminismSource final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDeterminismSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDeterminismSource")
	}
	static class IMovieSceneDeterminismSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneDeterminismSource>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneDeterminismSource;

// Class MovieScene.MovieSceneEntityDecorator
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEntityDecorator final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityDecorator")
	}
	static class IMovieSceneEntityDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEntityDecorator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEntityDecorator;

// Class MovieScene.MovieSceneLifetimeDecoration
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneLifetimeDecoration final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneLifetimeDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneLifetimeDecoration")
	}
	static class IMovieSceneLifetimeDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneLifetimeDecoration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneLifetimeDecoration;

// Class MovieScene.MovieSceneMetaDataInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneMetaDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneMetaDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneMetaDataInterface")
	}
	static class IMovieSceneMetaDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneMetaDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneMetaDataInterface;

// Class MovieScene.MovieScenePlaybackClient
// 0x0000 (0x0000 - 0x0000)
class IMovieScenePlaybackClient final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePlaybackClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePlaybackClient")
	}
	static class IMovieScenePlaybackClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePlaybackClient>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieScenePlaybackClient;

// Class MovieScene.MovieSceneSectionDecoration
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneSectionDecoration final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSectionDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSectionDecoration")
	}
	static class IMovieSceneSectionDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSectionDecoration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneSectionDecoration;

// Class MovieScene.MovieSceneSequencePlayerObserver
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneSequencePlayerObserver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequencePlayerObserver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequencePlayerObserver")
	}
	static class IMovieSceneSequencePlayerObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequencePlayerObserver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneSequencePlayerObserver;

// Class MovieScene.MovieSceneTrackDecoration
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneTrackDecoration final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrackDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrackDecoration")
	}
	static class IMovieSceneTrackDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTrackDecoration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneTrackDecoration;

// Class MovieScene.MovieSceneBindingEventReceiverInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBindingEventReceiverInterface final
{
public:
	void OnObjectBoundBySequencer(class UMovieSceneSequencePlayer* Player, const struct FMovieSceneObjectBindingID& BindingID);
	void OnObjectUnboundBySequencer(class UMovieSceneSequencePlayer* Player, const struct FMovieSceneObjectBindingID& BindingID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingEventReceiverInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingEventReceiverInterface")
	}
	static class IMovieSceneBindingEventReceiverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingEventReceiverInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBindingEventReceiverInterface;

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBindingOwnerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingOwnerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingOwnerInterface")
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBindingOwnerInterface;

// Class MovieScene.MovieSceneCachedTrack
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneCachedTrack final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCachedTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCachedTrack")
	}
	static class IMovieSceneCachedTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCachedTrack>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneCachedTrack;

// Class MovieScene.MovieSceneSignedObject
// 0x0030 (0x0058 - 0x0028)
class UMovieSceneSignedObject : public UObject
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Signature;                                         // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x1C];                                      // 0x003C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSignedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSignedObject")
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSignedObject;

// Class MovieScene.MovieSceneClock
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneClock : public UMovieSceneSignedObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneClock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneClock")
	}
	static class UMovieSceneClock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneClock>();
	}
};
DUMPER7_ASSERTS_UMovieSceneClock;

// Class MovieScene.MovieSceneExternalClock
// 0x0020 (0x0078 - 0x0058)
class UMovieSceneExternalClock final : public UMovieSceneClock
{
public:
	struct FSoftObjectPath                        CustomClockSourcePath;                             // 0x0058(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneExternalClock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneExternalClock")
	}
	static class UMovieSceneExternalClock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneExternalClock>();
	}
};
DUMPER7_ASSERTS_UMovieSceneExternalClock;

// Class MovieScene.MovieSceneCondition
// 0x0008 (0x0060 - 0x0058)
class UMovieSceneCondition : public UMovieSceneSignedObject
{
public:
	bool                                          bInvert;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool BP_EvaluateCondition(const struct FMovieSceneConditionContext& ConditionContext) const;
	EMovieSceneConditionCheckFrequency BP_GetCheckFrequency() const;
	EMovieSceneConditionScope BP_GetScope() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCondition")
	}
	static class UMovieSceneCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCondition>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCondition;

// Class MovieScene.MovieSceneCustomBinding
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneCustomBinding : public UObject
{
public:
	static int32 GetBaseCustomPriority();
	static int32 GetBaseEnginePriority();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCustomBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCustomBinding")
	}
	static class UMovieSceneCustomBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCustomBinding>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCustomBinding;

// Class MovieScene.MovieSceneDecorationContainerObject
// 0x0010 (0x0068 - 0x0058)
class UMovieSceneDecorationContainerObject : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneDecorationContainer         Decorations;                                       // 0x0058(0x0010)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneDecorationContainerObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneDecorationContainerObject")
	}
	static class UMovieSceneDecorationContainerObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDecorationContainerObject>();
	}
};
DUMPER7_ASSERTS_UMovieSceneDecorationContainerObject;

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEasingFunction final
{
public:
	float OnEvaluate(float Interp) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEasingFunction")
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEasingFunction;

// Class MovieScene.MovieSceneEntitySystem
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneEntitySystem : public UObject
{
public:
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntitySystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntitySystem")
	}
	static class UMovieSceneEntitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntitySystem;

// Class MovieScene.MovieSceneEntityGroupingSystem
// 0x0118 (0x0158 - 0x0040)
class UMovieSceneEntityGroupingSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_40[0x118];                                     // 0x0040(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityGroupingSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityGroupingSystem")
	}
	static class UMovieSceneEntityGroupingSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityGroupingSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntityGroupingSystem;

// Class MovieScene.MovieSceneGroupCondition
// 0x0018 (0x0078 - 0x0060)
class UMovieSceneGroupCondition final : public UMovieSceneCondition
{
public:
	EMovieSceneGroupConditionOperator             Operator;                                          // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneConditionContainer>  SubConditions;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGroupCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGroupCondition")
	}
	static class UMovieSceneGroupCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroupCondition>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGroupCondition;

// Class MovieScene.MovieSceneKeyProxy
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneKeyProxy final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneKeyProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneKeyProxy")
	}
	static class IMovieSceneKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneKeyProxy>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneKeyProxy;

// Class MovieScene.MovieSceneLanguagePreviewDecoration
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneLanguagePreviewDecoration final : public UObject
{
public:
	class FString                                 PreviewLanguage;                                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneLanguagePreviewDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneLanguagePreviewDecoration")
	}
	static class UMovieSceneLanguagePreviewDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLanguagePreviewDecoration>();
	}
};
DUMPER7_ASSERTS_UMovieSceneLanguagePreviewDecoration;

// Class MovieScene.MovieSceneNumericVariantGetter
// 0x0008 (0x0060 - 0x0058)
class UMovieSceneNumericVariantGetter : public UMovieSceneSignedObject
{
public:
	class UMovieSceneNumericVariantGetter*        ReferenceToSelf;                                   // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNumericVariantGetter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNumericVariantGetter")
	}
	static class UMovieSceneNumericVariantGetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNumericVariantGetter>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNumericVariantGetter;

// Class MovieScene.MovieSceneTimeWarpGetter
// 0x0010 (0x0070 - 0x0060)
class UMovieSceneTimeWarpGetter : public UMovieSceneNumericVariantGetter
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bMuted : 1;                                        // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpGetter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpGetter")
	}
	static class UMovieSceneTimeWarpGetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTimeWarpGetter>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTimeWarpGetter;

// Class MovieScene.MovieScenePlayRateCurve
// 0x0148 (0x01B8 - 0x0070)
class UMovieScenePlayRateCurve : public UMovieSceneTimeWarpGetter
{
public:
	struct FMovieSceneTimeWarpChannel             PlayRate;                                          // 0x0070(0x0128)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PlaybackStartFrame;                                // 0x0198(0x0004)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualPlaybackStart;                              // 0x019C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D[0x1B];                                     // 0x019D(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePlayRateCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePlayRateCurve")
	}
	static class UMovieScenePlayRateCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePlayRateCurve>();
	}
};
DUMPER7_ASSERTS_UMovieScenePlayRateCurve;

// Class MovieScene.MovieSceneReplaceableBindingBase
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneReplaceableBindingBase : public UMovieSceneCustomBinding
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneReplaceableBindingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneReplaceableBindingBase")
	}
	static class UMovieSceneReplaceableBindingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneReplaceableBindingBase>();
	}
};
DUMPER7_ASSERTS_UMovieSceneReplaceableBindingBase;

// Class MovieScene.MovieSceneScalingDriver
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneScalingDriver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneScalingDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneScalingDriver")
	}
	static class IMovieSceneScalingDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneScalingDriver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneScalingDriver;

// Class MovieScene.MovieSceneScalingAnchors
// 0x0120 (0x02D8 - 0x01B8)
class UMovieSceneScalingAnchors final : public UMovieScenePlayRateCurve
{
public:
	uint8                                         Pad_1B8[0x10];                                     // 0x01B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IMovieSceneScalingDriver>> ScalingDrivers;                         // 0x01C8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, struct FMovieSceneScalingAnchor> InitialAnchors;                              // 0x01D8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<struct FGuid, struct FMovieSceneAnchorsScalingGroup> ScalingGroups;                         // 0x0228(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x60];                                     // 0x0278(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneScalingAnchors")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneScalingAnchors")
	}
	static class UMovieSceneScalingAnchors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScalingAnchors>();
	}
};
DUMPER7_ASSERTS_UMovieSceneScalingAnchors;

// Class MovieScene.MovieSceneSectionAnchorsDecoration
// 0x0028 (0x0050 - 0x0028)
class UMovieSceneSectionAnchorsDecoration final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  StartAnchor;                                       // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSectionAnchorsDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSectionAnchorsDecoration")
	}
	static class UMovieSceneSectionAnchorsDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSectionAnchorsDecoration>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSectionAnchorsDecoration;

// Class MovieScene.MovieSceneSequenceTickManagerClient
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneSequenceTickManagerClient final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequenceTickManagerClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequenceTickManagerClient")
	}
	static class IMovieSceneSequenceTickManagerClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequenceTickManagerClient>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneSequenceTickManagerClient;

// Class MovieScene.MovieSceneShotMetaData
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneShotMetaData final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<bool>                               bIsNoGood;                                         // 0x0030(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TOptional<bool>                               bIsFlagged;                                        // 0x0032(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TOptional<bool>                               bIsRecorded;                                       // 0x0034(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TOptional<bool>                               bIsSubSequence;                                    // 0x0036(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TOptional<int32>                              FavoriteRating;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneShotMetaData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneShotMetaData")
	}
	static class UMovieSceneShotMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneShotMetaData>();
	}
};
DUMPER7_ASSERTS_UMovieSceneShotMetaData;

// Class MovieScene.MovieSceneSpawnableBindingBase
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneSpawnableBindingBase : public UMovieSceneCustomBinding
{
public:
	ESpawnOwnership                               SpawnOwnership;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bContinuouslyRespawn;                              // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSpawnableBindingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSpawnableBindingBase")
	}
	static class UMovieSceneSpawnableBindingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnableBindingBase>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSpawnableBindingBase;

// Class MovieScene.MovieSceneTimeWarpCurve
// 0x0128 (0x0198 - 0x0070)
class UMovieSceneTimeWarpCurve final : public UMovieSceneTimeWarpGetter
{
public:
	struct FMovieSceneTimeWarpChannel             Channel;                                           // 0x0070(0x0128)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpCurve")
	}
	static class UMovieSceneTimeWarpCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTimeWarpCurve>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTimeWarpCurve;

// Class MovieScene.MovieSceneTimeWarpSource
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneTimeWarpSource final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpSource")
	}
	static class IMovieSceneTimeWarpSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTimeWarpSource>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneTimeWarpSource;

// Class MovieScene.MovieSceneTimeWarpDecoration
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneTimeWarpDecoration final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IMovieSceneTimeWarpSource>> Sources;                               // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpDecoration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpDecoration")
	}
	static class UMovieSceneTimeWarpDecoration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTimeWarpDecoration>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTimeWarpDecoration;

// Class MovieScene.MovieSceneSection
// 0x00A0 (0x0108 - 0x0068)
class UMovieSceneSection : public UMovieSceneDecorationContainerObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x0068(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x0070(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x00A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneConditionContainer          ConditionContainer;                                // 0x00B8(0x0008)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PreRollFrames;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           PostRollFrames;                                    // 0x00C4(0x0004)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x00D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x00D0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x00D4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x00D8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrerollTime;                                       // 0x00DC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PostrollTime;                                      // 0x00E0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsInfinite : 1;                                   // 0x00E4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsInfiniteRange;                            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x00E9(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB[0x1D];                                      // 0x00EB(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBlendType(EMovieSceneBlendType InBlendType);
	void SetColorTint(const struct FColor& InColorTint);
	void SetCompletionMode(EMovieSceneCompletionMode InCompletionMode);
	void SetIsActive(bool bInIsActive);
	void SetIsLocked(bool bInIsLocked);
	void SetOverlapPriority(int32 NewPriority);
	void SetPostRollFrames(int32 InPostRollFrames);
	void SetPreRollFrames(int32 InPreRollFrames);
	void SetRowIndex(int32 NewRowIndex);

	struct FOptionalMovieSceneBlendType GetBlendType() const;
	struct FColor GetColorTint() const;
	EMovieSceneCompletionMode GetCompletionMode() const;
	int32 GetOverlapPriority() const;
	int32 GetPostRollFrames() const;
	int32 GetPreRollFrames() const;
	int32 GetRowIndex() const;
	bool IsActive() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSection")
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSection;

// Class MovieScene.MovieSceneTimeWarpSection
// 0x0008 (0x0110 - 0x0108)
class UMovieSceneTimeWarpSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneTimeWarpVariant             TimeWarp;                                          // 0x0108(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpSection")
	}
	static class UMovieSceneTimeWarpSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTimeWarpSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTimeWarpSection;

// Class MovieScene.MovieSceneTrack
// 0x00A8 (0x0110 - 0x0068)
class UMovieSceneTrack : public UMovieSceneDecorationContainerObject
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x0070(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneConditionContainer          ConditionContainer;                                // 0x0078(0x0008)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x1];                                       // 0x0080(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEvalDisabled;                                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RowsDisabled;                                      // 0x0088(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x4];                                       // 0x0098(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EvaluationFieldGuid;                               // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTrackEvaluationField        EvaluationField;                                   // 0x00B0(0x0010)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneTrackRowMetadata> TrackRowMetadata;                                // 0x00C0(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrack")
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTrack;

// Class MovieScene.MovieSceneTimeWarpTrack
// 0x0020 (0x0130 - 0x0110)
class UMovieSceneTimeWarpTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0118(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bIsActiveTimeWarp;                                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTimeWarpTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTimeWarpTrack")
	}
	static class UMovieSceneTimeWarpTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTimeWarpTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTimeWarpTrack;

// Class MovieScene.MovieSceneChannelOverrideContainer
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneChannelOverrideContainer : public UMovieSceneSignedObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneChannelOverrideContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneChannelOverrideContainer")
	}
	static class UMovieSceneChannelOverrideContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChannelOverrideContainer>();
	}
};
DUMPER7_ASSERTS_UMovieSceneChannelOverrideContainer;

// Class MovieScene.MovieSceneSectionChannelOverrideRegistry
// 0x0050 (0x0078 - 0x0028)
class UMovieSceneSectionChannelOverrideRegistry final : public UObject
{
public:
	TMap<class FName, class UMovieSceneChannelOverrideContainer*> Overrides;                         // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSectionChannelOverrideRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSectionChannelOverrideRegistry")
	}
	static class UMovieSceneSectionChannelOverrideRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSectionChannelOverrideRegistry>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSectionChannelOverrideRegistry;

// Class MovieScene.MovieSceneTrackTemplateProducer
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneTrackTemplateProducer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrackTemplateProducer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrackTemplateProducer")
	}
	static class IMovieSceneTrackTemplateProducer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTrackTemplateProducer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneTrackTemplateProducer;

// Class MovieScene.MovieSceneCompiledData
// 0x03F8 (0x0420 - 0x0028)
class UMovieSceneCompiledData final : public UObject
{
public:
	struct FMovieSceneEvaluationTemplate          EvaluationTemplate;                                // 0x0028(0x0160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceHierarchy           Hierarchy;                                         // 0x0188(0x0140)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneEntityComponentField        EntityComponentField;                              // 0x02C8(0x00F0)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneEvaluationField             TrackTemplateField;                                // 0x03B8(0x0030)(NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneDeterminismFence>    DeterminismFences;                                 // 0x03E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompiledSignature;                                 // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompilerVersion;                                   // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceCompilerMask               AccumulatedMask;                                   // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceCompilerMask               AllocatedMask;                                     // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceFlags                      AccumulatedFlags;                                  // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCompiledData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCompiledData")
	}
	static class UMovieSceneCompiledData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledData>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCompiledData;

// Class MovieScene.MovieSceneCompiledDataManager
// 0x0208 (0x0230 - 0x0028)
class UMovieSceneCompiledDataManager final : public UObject
{
public:
	uint8                                         Pad_28[0xB0];                                      // 0x0028(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FMovieSceneSequenceHierarchy> Hierarchies;                                    // 0x00D8(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationTemplate> TrackTemplates;                                // 0x0128(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationField> TrackTemplateFields;                              // 0x0178(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEntityComponentField> EntityComponentFields;                       // 0x01C8(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x18];                                     // 0x0218(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCompiledDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCompiledDataManager")
	}
	static class UMovieSceneCompiledDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledDataManager>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCompiledDataManager;

// Class MovieScene.MovieSceneEntityProvider
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEntityProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityProvider")
	}
	static class IMovieSceneEntityProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEntityProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEntityProvider;

// Class MovieScene.MovieSceneBindingLifetimeSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneBindingLifetimeSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingLifetimeSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingLifetimeSystem")
	}
	static class UMovieSceneBindingLifetimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingLifetimeSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBindingLifetimeSystem;

// Class MovieScene.MovieSceneBlenderSystem
// 0x0028 (0x0068 - 0x0040)
class UMovieSceneBlenderSystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBlenderSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBlenderSystem")
	}
	static class UMovieSceneBlenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBlenderSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBlenderSystem;

// Class MovieScene.MovieSceneEntityInstantiatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneEntityInstantiatorSystem : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntityInstantiatorSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntityInstantiatorSystem")
	}
	static class UMovieSceneEntityInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityInstantiatorSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntityInstantiatorSystem;

// Class MovieScene.MovieSceneGenericBoundObjectInstantiator
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneGenericBoundObjectInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGenericBoundObjectInstantiator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGenericBoundObjectInstantiator")
	}
	static class UMovieSceneGenericBoundObjectInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGenericBoundObjectInstantiator>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGenericBoundObjectInstantiator;

// Class MovieScene.MovieSceneBoundSceneComponentInstantiator
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneBoundSceneComponentInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBoundSceneComponentInstantiator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBoundSceneComponentInstantiator")
	}
	static class UMovieSceneBoundSceneComponentInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBoundSceneComponentInstantiator>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBoundSceneComponentInstantiator;

// Class MovieScene.MovieSceneValueDecomposer
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneValueDecomposer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneValueDecomposer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneValueDecomposer")
	}
	static class IMovieSceneValueDecomposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneValueDecomposer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneValueDecomposer;

// Class MovieScene.MovieSceneEntitySystemLinker
// 0x0740 (0x0768 - 0x0028)
class UMovieSceneEntitySystemLinker : public UObject
{
public:
	uint8                                         Pad_28[0x2A8];                                     // 0x0028(0x02A8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEntitySystemGraph           SystemGraph;                                       // 0x02D0(0x0190)(NativeAccessSpecifierPublic)
	uint8                                         Pad_460[0x308];                                    // 0x0460(0x0308)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEntitySystemLinker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEntitySystemLinker")
	}
	static class UMovieSceneEntitySystemLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystemLinker>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEntitySystemLinker;

// Class MovieScene.MovieSceneEvalTimeSystem
// 0x0190 (0x01D0 - 0x0040)
class UMovieSceneEvalTimeSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_40[0x190];                                     // 0x0040(0x0190)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEvalTimeSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEvalTimeSystem")
	}
	static class UMovieSceneEvalTimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvalTimeSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEvalTimeSystem;

// Class MovieScene.MovieSceneEvaluationHookSystem
// 0x0050 (0x0090 - 0x0040)
class UMovieSceneEvaluationHookSystem final : public UMovieSceneEntitySystem
{
public:
	TMap<struct FMovieSceneEvaluationInstanceKey, struct FMovieSceneEvaluationHookEventContainer> PendingEventsByRootInstance; // 0x0040(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEvaluationHookSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEvaluationHookSystem")
	}
	static class UMovieSceneEvaluationHookSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvaluationHookSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEvaluationHookSystem;

// Class MovieScene.MovieSceneInitialValueSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneInitialValueSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneInitialValueSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneInitialValueSystem")
	}
	static class UMovieSceneInitialValueSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneInitialValueSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneInitialValueSystem;

// Class MovieScene.MovieScenePreAnimatedStateSystemInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieScenePreAnimatedStateSystemInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePreAnimatedStateSystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePreAnimatedStateSystemInterface")
	}
	static class IMovieScenePreAnimatedStateSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePreAnimatedStateSystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieScenePreAnimatedStateSystemInterface;

// Class MovieScene.MovieSceneCachePreAnimatedStateSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneCachePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCachePreAnimatedStateSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCachePreAnimatedStateSystem")
	}
	static class UMovieSceneCachePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCachePreAnimatedStateSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCachePreAnimatedStateSystem;

// Class MovieScene.MovieSceneRestorePreAnimatedStateSystem
// 0x0010 (0x0050 - 0x0040)
class UMovieSceneRestorePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneRestorePreAnimatedStateSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneRestorePreAnimatedStateSystem")
	}
	static class UMovieSceneRestorePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRestorePreAnimatedStateSystem>();
	}
};
DUMPER7_ASSERTS_UMovieSceneRestorePreAnimatedStateSystem;

// Class MovieScene.MovieSceneRootInstantiatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneRootInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneRootInstantiatorSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneRootInstantiatorSystem")
	}
