#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NamingTokens

#include "Basic.hpp"

#include "NamingTokens_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function NamingTokens.NamingTokens.OnPreEvaluate
// 0x0020 (0x0020 - 0x0000)
struct NamingTokens_OnPreEvaluate final
{
public:
	struct FNamingTokensEvaluationData            InEvaluationData;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokens_OnPreEvaluate;

// Function NamingTokens.NamingTokens.ProcessTokenTemplateFunction
// 0x0010 (0x0010 - 0x0000)
struct NamingTokens_ProcessTokenTemplateFunction final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokens_ProcessTokenTemplateFunction;

// Function NamingTokens.NamingTokens.GetCurrentDateTime
// 0x0008 (0x0008 - 0x0000)
struct NamingTokens_GetCurrentDateTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokens_GetCurrentDateTime;

// Function NamingTokens.NamingTokensEngineSubsystem.EvaluateTokenString
// 0x0068 (0x0068 - 0x0000)
struct NamingTokensEngineSubsystem_EvaluateTokenString final
{
public:
	class FString                                 InTokenString;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNamingTokenFilterArgs                 InFilter;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InContexts;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenResultData                 ReturnValue;                                       // 0x0038(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_EvaluateTokenString;

// Function NamingTokens.NamingTokensEngineSubsystem.EvaluateTokenText
// 0x0068 (0x0068 - 0x0000)
struct NamingTokensEngineSubsystem_EvaluateTokenText final
{
public:
	class FText                                   InTokenText;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenFilterArgs                 InFilter;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InContexts;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenResultData                 ReturnValue;                                       // 0x0038(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_EvaluateTokenText;

// Function NamingTokens.NamingTokensEngineSubsystem.RegisterGlobalNamespace
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_RegisterGlobalNamespace final
{
public:
	class FString                                 InNamespace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_RegisterGlobalNamespace;

// Function NamingTokens.NamingTokensEngineSubsystem.UnregisterGlobalNamespace
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_UnregisterGlobalNamespace final
{
public:
	class FString                                 InNamespace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_UnregisterGlobalNamespace;

// Function NamingTokens.NamingTokensEngineSubsystem.GetAllNamespaces
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_GetAllNamespaces final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_GetAllNamespaces;

// Function NamingTokens.NamingTokensEngineSubsystem.GetGlobalNamespaces
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_GetGlobalNamespaces final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_GetGlobalNamespaces;

// Function NamingTokens.NamingTokensEngineSubsystem.GetMultipleNamingTokens
// 0x0020 (0x0020 - 0x0000)
struct NamingTokensEngineSubsystem_GetMultipleNamingTokens final
{
public:
	TArray<class FString>                         InNamespaces;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UNamingTokens*>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_GetMultipleNamingTokens;

// Function NamingTokens.NamingTokensEngineSubsystem.GetNamingTokens
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_GetNamingTokens final
{
public:
	class FString                                 InNamespace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNamingTokens*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_GetNamingTokens;

// Function NamingTokens.NamingTokensEngineSubsystem.GetNamingTokensNative
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_GetNamingTokensNative final
{
public:
	class FString                                 InNamespace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNamingTokens*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_GetNamingTokensNative;

// Function NamingTokens.NamingTokensEngineSubsystem.IsGlobalNamespaceRegistered
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered final
{
public:
	class FString                                 InNamespace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
