#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetworkPrediction

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum NetworkPrediction.ENetworkPredictionTickingPolicy
// NumValues: 0x0004
enum class ENetworkPredictionTickingPolicy : uint8
{
	Independent                              = 1,
	Fixed                                    = 2,
	All                                      = 3,
	ENetworkPredictionTickingPolicy_MAX      = 4,
};

// Enum NetworkPrediction.ENetworkLOD
// NumValues: 0x0005
enum class ENetworkLOD : uint8
{
	Interpolated                             = 1,
	SimExtrapolate                           = 2,
	ForwardPredict                           = 4,
	All                                      = 7,
	ENetworkLOD_MAX                          = 8,
};

// Enum NetworkPrediction.ENetworkPredictionStateRead
// NumValues: 0x0003
enum class ENetworkPredictionStateRead : uint8
{
	Simulation                               = 0,
	Presentation                             = 1,
	ENetworkPredictionStateRead_MAX          = 2,
};

// ScriptStruct NetworkPrediction.NetworkPredictionProxy
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x10) FNetworkPredictionProxy final
{
public:
	uint8                                         Pad_0[0xA0];                                       // 0x0000(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetworkPredictionWorldManager*         WorldManager;                                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetworkPredictionProxy;

// ScriptStruct NetworkPrediction.SharedPackageMapItem
// 0x0028 (0x0028 - 0x0000)
struct FSharedPackageMapItem final
{
public:
	TSoftObjectPtr<class UObject>                 SoftPtr;                                           // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSharedPackageMapItem;

// ScriptStruct NetworkPrediction.ReplicationProxy
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x10) FReplicationProxy final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReplicationProxy;

// ScriptStruct NetworkPrediction.SharedPackageMap
// 0x0010 (0x0010 - 0x0000)
struct FSharedPackageMap final
{
public:
	TArray<struct FSharedPackageMapItem>          Items;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSharedPackageMap;

// ScriptStruct NetworkPrediction.ServerReplicationRPCParameter
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FServerReplicationRPCParameter final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FServerReplicationRPCParameter;

// ScriptStruct NetworkPrediction.NetworkPredictionSettings
// 0x0030 (0x0030 - 0x0000)
struct FNetworkPredictionSettings final
{
public:
	ENetworkPredictionTickingPolicy               PreferredTickingPolicy;                            // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ANetworkPredictionReplicatedManager> ReplicatedManagerClassOverride;           // 0x0008(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedTickFrameRate;                                // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceEngineFixTickForcePhysics;                   // 0x0014(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetworkLOD                                   SimulatedProxyNetworkLOD;                          // 0x0015(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFixedTickSmoothing;                         // 0x0016(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FixedTickInterpolationBufferedMS;                  // 0x0018(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndependentTickInterpolationBufferedMS;            // 0x001C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndependentTickInterpolationMaxBufferedMS;         // 0x0020(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedTickInputSendCount;                           // 0x0024(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndependentTickInputSendCount;                     // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumRemoteInputFaultLimit;                      // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNetworkPredictionSettings;

// ScriptStruct NetworkPrediction.NetworkPredictionDevHUDItem
// 0x0028 (0x0028 - 0x0000)
struct FNetworkPredictionDevHUDItem final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExecCommand;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoBack;                                         // 0x0020(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequirePIE;                                       // 0x0021(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireNotPIE;                                    // 0x0022(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetworkPredictionDevHUDItem;

// ScriptStruct NetworkPrediction.NetworkPredictionDevHUD
// 0x0028 (0x0028 - 0x0000)
struct FNetworkPredictionDevHUD final
{
public:
	class FString                                 HUDName;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNetworkPredictionDevHUDItem>   Items;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bRequirePIE;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireNotPIE;                                    // 0x0021(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetworkPredictionDevHUD;

SDK_NAMESPACE_END
