#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemBlueprints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class OnlineSubsystemBlueprints.OnlineAchievementsSubsystem
// 0x0088 (0x00B8 - 0x0030)
class UOnlineAchievementsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& UserId, const class FString& AchievementId)> OnAchievementUnlocked; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	EOnlineCachedResult_ GetCachedAchievement(const struct FUniqueNetIdRepl& PlayerId, const class FString& AchievementId, struct FOnlineAchievementBP* OutAchievement);
	EOnlineCachedResult_ GetCachedAchievementDescription(const class FString& AchievementId, struct FOnlineAchievementDescBP* OutAchievementDesc);
	EOnlineCachedResult_ GetCachedAchievements(const struct FUniqueNetIdRepl& PlayerId, TArray<struct FOnlineAchievementBP>* OutAchievements);
	bool IsSubsystemAvailable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAchievementsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAchievementsSubsystem")
	}
	static class UOnlineAchievementsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAchievementsSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineAchievementsSubsystem;

// Class OnlineSubsystemBlueprints.OnlineAchievementsSubsystemWriteAchievements
// 0x0070 (0x00A0 - 0x0030)
class UOnlineAchievementsSubsystemWriteAchievements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, bool Param2)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, bool Param2)> OnAchievementsWritten; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystem*           __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__PlayerId;                                 // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOnlineAchievementsWrite*               __Store__WriteObject;                              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UOnlineAchievementsSubsystemWriteAchievements* WriteAchievements(class UOnlineAchievementsSubsystem* Subsystem, const struct FUniqueNetIdRepl& PlayerId, class UOnlineAchievementsWrite* WriteObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAchievementsSubsystemWriteAchievements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAchievementsSubsystemWriteAchievements")
	}
	static class UOnlineAchievementsSubsystemWriteAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAchievementsSubsystemWriteAchievements>();
	}
};
DUMPER7_ASSERTS_UOnlineAchievementsSubsystemWriteAchievements;

// Class OnlineSubsystemBlueprints.VoiceChatUser
// 0x0150 (0x0178 - 0x0028)
class UVoiceChatUser final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnVoiceChatAvailableAudioDevicesChanged;           // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& playerName)> OnVoiceChatLoggedIn;             // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& playerName)> OnVoiceChatLoggedOut;            // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName)> OnVoiceChatChannelJoined;       // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const struct FVoiceChatResultBP& Reason)> OnVoiceChatChannelExited; // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const class FString& playerName)> OnVoiceChatPlayerAdded; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const class FString& playerName)> OnVoiceChatPlayerRemoved; // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const class FString& playerName, bool bIsTalking)> OnVoiceChatPlayerTalkingUpdated; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const class FString& playerName, bool bIsMuted)> OnVoiceChatPlayerMuteUpdated; // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName, const class FString& playerName, float Volume)> OnVoiceChatPlayerVolumeUpdated; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlockPlayers(const TArray<class FString>& PlayerNames);
	bool GetAudioInputDeviceMuted();
	float GetAudioInputVolume();
	bool GetAudioOutputDeviceMuted();
	float GetAudioOutputVolume();
	TArray<struct FVoiceChatDeviceInfoBP> GetAvailableInputDeviceInfos();
	TArray<struct FVoiceChatDeviceInfoBP> GetAvailableOutputDeviceInfos();
	TArray<class FString> GetChannels();
	EVoiceChatChannelType_ GetChannelType(const class FString& ChannelName);
	struct FVoiceChatDeviceInfoBP GetDefaultInputDeviceInfo();
	struct FVoiceChatDeviceInfoBP GetDefaultOutputDeviceInfo();
	struct FVoiceChatDeviceInfoBP GetInputDeviceInfo();
	class FString GetLoggedInPlayerName();
	struct FVoiceChatDeviceInfoBP GetOutputDeviceInfo();
	TArray<class FString> GetPlayersInChannel(const class FString& ChannelName);
	float GetPlayerVolume(const class FString& playerName);
	class FString GetSetting(const class FString& Name_0);
	TSet<class FString> GetTransmitChannels();
	EVoiceChatTransmitMode_ GetTransmitMode();
	class FString InsecureGetJoinToken(const class FString& ChannelName, EVoiceChatChannelType_ ChannelType, const struct FVoiceChatChannel3dPropertiesBP& Channel3dProperties);
	class FString InsecureGetLoginToken(const class FString& playerName);
	bool IsChannelPlayerMuted(const class FString& ChannelName, const class FString& playerName);
	bool IsLoggedIn();
	bool IsLoggingIn();
	bool IsPlayerMuted(const class FString& playerName);
	bool IsPlayerTalking(const class FString& playerName);
	void Set3DPosition(const class FString& ChannelName, const struct FVector& SpeakerPosition);
	void SetAudioInputDeviceMuted(bool bIsMuted);
	void SetAudioInputVolume(float Volume);
	void SetAudioOutputDeviceMuted(bool bIsMuted);
	void SetAudioOutputVolume(float Volume);
	void SetChannelPlayerMuted(const class FString& ChannelName, const class FString& playerName, bool bAudioMuted);
	void SetInputDeviceId(const class FString& InputDeviceId);
	void SetOutputDeviceId(const class FString& OutputDeviceId);
	void SetPlayerMuted(const class FString& playerName, bool bMuted);
	void SetPlayerVolume(const class FString& playerName, float Volume);
	void SetSetting(const class FString& Name_0, const class FString& Value);
	void TransmitToAllChannels();
	void TransmitToNoChannels();
	void TransmitToSpecificChannels(const TSet<class FString>& ChannelNames);
	void UnblockPlayers(const TArray<class FString>& PlayerNames);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoiceChatUser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoiceChatUser")
	}
	static class UVoiceChatUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChatUser>();
	}
};
DUMPER7_ASSERTS_UVoiceChatUser;

// Class OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievements
// 0x0068 (0x0098 - 0x0030)
class UOnlineAchievementsSubsystemQueryAchievements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, bool bWasSuccessful)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, bool bWasSuccessful)> OnQueryAchievementsComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystem*           __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__PlayerId;                                 // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineAchievementsSubsystemQueryAchievements* QueryAchievements(class UOnlineAchievementsSubsystem* Subsystem, const struct FUniqueNetIdRepl& PlayerId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAchievementsSubsystemQueryAchievements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAchievementsSubsystemQueryAchievements")
	}
	static class UOnlineAchievementsSubsystemQueryAchievements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAchievementsSubsystemQueryAchievements>();
	}
};
DUMPER7_ASSERTS_UOnlineAchievementsSubsystemQueryAchievements;

// Class OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievementDescriptions
// 0x0068 (0x0098 - 0x0030)
class UOnlineAchievementsSubsystemQueryAchievementDescriptions final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, bool bWasSuccessful)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, bool bWasSuccessful)> OnQueryAchievementsComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystem*           __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__PlayerId;                                 // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineAchievementsSubsystemQueryAchievementDescriptions* QueryAchievementDescriptions(class UOnlineAchievementsSubsystem* Subsystem, const struct FUniqueNetIdRepl& PlayerId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAchievementsSubsystemQueryAchievementDescriptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAchievementsSubsystemQueryAchievementDescriptions")
	}
	static class UOnlineAchievementsSubsystemQueryAchievementDescriptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAchievementsSubsystemQueryAchievementDescriptions>();
	}
};
DUMPER7_ASSERTS_UOnlineAchievementsSubsystemQueryAchievementDescriptions;

// Class OnlineSubsystemBlueprints.OnlineAvatarSubsystem
// 0x0070 (0x00A0 - 0x0030)
class UOnlineAvatarSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSubsystemAvailable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAvatarSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAvatarSubsystem")
	}
	static class UOnlineAvatarSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAvatarSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineAvatarSubsystem;

// Class OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatar
// 0x00A0 (0x00D0 - 0x0030)
class UOnlineAvatarSubsystemGetAvatar final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bWasSuccessful, class UTexture* ResultTexture)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bWasSuccessful, class UTexture* ResultTexture)> OnGetAvatarComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystem*                 __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__LocalUserId;                              // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__TargetUserId;                             // 0x0098(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               __Store__DefaultTexture;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UOnlineAvatarSubsystemGetAvatar* GetAvatar(class UOnlineAvatarSubsystem* Subsystem, const struct FUniqueNetIdRepl& LocalUserId, const struct FUniqueNetIdRepl& TargetUserId, class UTexture* DefaultTexture);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAvatarSubsystemGetAvatar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAvatarSubsystemGetAvatar")
	}
	static class UOnlineAvatarSubsystemGetAvatar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAvatarSubsystemGetAvatar>();
	}
};
DUMPER7_ASSERTS_UOnlineAvatarSubsystemGetAvatar;

// Class OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatarUrl
// 0x00A8 (0x00D8 - 0x0030)
class UOnlineAvatarSubsystemGetAvatarUrl final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bWasSuccessful, const class FString& ResultAvatarUrl)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bWasSuccessful, const class FString& ResultAvatarUrl)> OnGetAvatarUrlComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystem*                 __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__LocalUserId;                              // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__TargetUserId;                             // 0x0098(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 __Store__DefaultAvatarUrl;                         // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineAvatarSubsystemGetAvatarUrl* GetAvatarUrl(class UOnlineAvatarSubsystem* Subsystem, const struct FUniqueNetIdRepl& LocalUserId, const struct FUniqueNetIdRepl& TargetUserId, const class FString& DefaultAvatarUrl);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineAvatarSubsystemGetAvatarUrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineAvatarSubsystemGetAvatarUrl")
	}
	static class UOnlineAvatarSubsystemGetAvatarUrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineAvatarSubsystemGetAvatarUrl>();
	}
};
DUMPER7_ASSERTS_UOnlineAvatarSubsystemGetAvatarUrl;

// Class OnlineSubsystemBlueprints.OnlineChatSubsystem
// 0x0190 (0x01C0 - 0x0030)
class UOnlineChatSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xD0];                                      // 0x0030(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomCreated; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomConfigured; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomJoinPublic; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomJoinPrivate; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomExit; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, const struct FUniqueNetIdRepl& Param3)> OnChatRoomMemberJoin; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, const struct FUniqueNetIdRepl& Param3)> OnChatRoomMemberExit; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, const struct FUniqueNetIdRepl& Param3)> OnChatRoomMemberUpdate; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, bool Param3, const class FString& Param4)> OnChatRoomMessageSent; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const class FString& Param2, const struct FChatMessageBP& Param3)> OnChatRoomMessageReceived; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const struct FUniqueNetIdRepl& Param2, bool Param3, const class FString& Param4)> OnChatPrivateMessageSent; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& Param1, const struct FChatMessageBP& Param2)> OnChatPrivateMessageReceived; // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	bool ConfigureRoom(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const struct FChatRoomConfigBP& ChatRoomConfig);
	bool CreateRoom(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const class FString& Nickname, const struct FChatRoomConfigBP& ChatRoomConfig);
	void DumpChatState();
	bool ExitRoom(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId);
	void GetJoinedRooms(const struct FUniqueNetIdRepl& UserId, TArray<class FString>* OutRooms);
	bool GetLastMessages(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, int32 NumMessages, TArray<struct FChatMessageBP>* OutMessages);
	struct FChatRoomMemberBP GetMember(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const struct FUniqueNetIdRepl& MemberId);
	bool GetMembers(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, TArray<struct FChatRoomMemberBP>* OutMembers);
	struct FChatRoomInfoBP GetRoomInfo(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId);
	bool IsChatAllowed(const struct FUniqueNetIdRepl& UserId, const struct FUniqueNetIdRepl& RecipientId);
	bool IsSubsystemAvailable();
	bool JoinPrivateRoom(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const class FString& Nickname, const struct FChatRoomConfigBP& ChatRoomConfig);
	bool JoinPublicRoom(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const class FString& Nickname, const struct FChatRoomConfigBP& ChatRoomConfig);
	bool SendPrivateChat(const struct FUniqueNetIdRepl& UserId, const struct FUniqueNetIdRepl& RecipientId, const class FString& MsgBody);
	bool SendRoomChat(const struct FUniqueNetIdRepl& UserId, const class FString& RoomId, const class FString& MsgBody);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineChatSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineChatSubsystem")
	}
	static class UOnlineChatSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineChatSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineChatSubsystem;

// Class OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class URedpointOSSv1BlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FOnlineSessionSettingBP Conv_BoolToFOnlineSessionSettingBP(bool InData);
	static struct FVariantDataBP Conv_BoolToFVariantDataBP(bool InData);
	static struct FOnlineSessionSettingBP Conv_DoubleToFOnlineSessionSettingBP(double InData);
	static struct FVariantDataBP Conv_DoubleToFVariantDataBP(double InData);
	static bool Conv_FOnlineSessionSettingBPToBool(const struct FOnlineSessionSettingBP& InData);
	static double Conv_FOnlineSessionSettingBPToDouble(const struct FOnlineSessionSettingBP& InData);
	static int64 Conv_FOnlineSessionSettingBPToInt64(const struct FOnlineSessionSettingBP& InData);
	static class FString Conv_FOnlineSessionSettingBPToString(const struct FOnlineSessionSettingBP& InData);
	static bool Conv_FVariantDataBPToBool(const struct FVariantDataBP& InData);
	static double Conv_FVariantDataBPToDouble(const struct FVariantDataBP& InData);
	static int64 Conv_FVariantDataBPToInt64(const struct FVariantDataBP& InData);
	static class FString Conv_FVariantDataBPToString(const struct FVariantDataBP& InData);
	static struct FOnlineSessionSettingBP Conv_Int64ToFOnlineSessionSettingBP(int64 InData);
	static struct FVariantDataBP Conv_Int64ToFVariantDataBP(int64 InData);
	static struct FOnlineSessionSettingBP Conv_StringToFOnlineSessionSettingBP(const class FString& InData);
	static struct FVariantDataBP Conv_StringToFVariantDataBP(const class FString& InData);
	static bool EqualEqual_FOnlineSessionSettingBPFOnlineSessionSettingBP(const struct FOnlineSessionSettingBP& InA, const struct FOnlineSessionSettingBP& InB);
	static bool EqualEqual_FVariantDataBPFVariantDataBP(const struct FVariantDataBP& InA, const struct FVariantDataBP& InB);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointOSSv1BlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointOSSv1BlueprintFunctionLibrary")
	}
	static class URedpointOSSv1BlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointOSSv1BlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_URedpointOSSv1BlueprintFunctionLibrary;

// Class OnlineSubsystemBlueprints.OnlineEntitlementsSubsystem
// 0x0088 (0x00B8 - 0x0030)
class UOnlineEntitlementsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Namespace, const class FString& Error)> OnQueryEntitlementsComplete; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void GetAllEntitlements(const struct FUniqueNetIdRepl& UserId, const class FString& Namespace, TArray<class UOnlineEntitlement*>* OutUserEntitlements);
	class UOnlineEntitlement* GetEntitlement(const struct FUniqueNetIdRepl& UserId, const class FString& EntitlementId);
	class UOnlineEntitlement* GetItemEntitlement(const struct FUniqueNetIdRepl& UserId, const class FString& ItemId);
	bool IsSubsystemAvailable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineEntitlementsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineEntitlementsSubsystem")
	}
	static class UOnlineEntitlementsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineEntitlementsSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineEntitlementsSubsystem;

// Class OnlineSubsystemBlueprints.OnlineEntitlementsSubsystemQueryEntitlements
// 0x0088 (0x00B8 - 0x0030)
class UOnlineEntitlementsSubsystemQueryEntitlements final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Namespace, const class FString& Error)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Namespace, const class FString& Error)> OnQueryEntitlementsComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineEntitlementsSubsystem*           __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       __Store__UserId;                                   // 0x0070(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 __Store__Namespace;                                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPagedQueryBP                          __Store__Page;                                     // 0x00B0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UOnlineEntitlementsSubsystemQueryEntitlements* QueryEntitlements(class UOnlineEntitlementsSubsystem* Subsystem, const struct FUniqueNetIdRepl& UserId, const class FString& Namespace, const struct FPagedQueryBP& Page);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineEntitlementsSubsystemQueryEntitlements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineEntitlementsSubsystemQueryEntitlements")
	}
	static class UOnlineEntitlementsSubsystemQueryEntitlements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineEntitlementsSubsystemQueryEntitlements>();
	}
};
DUMPER7_ASSERTS_UOnlineEntitlementsSubsystemQueryEntitlements;

// Class OnlineSubsystemBlueprints.OnlineFriendsSubsystemSendInvite
// 0x0080 (0x00B0 - 0x0030)
class UOnlineFriendsSubsystemSendInvite final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const struct FUniqueNetIdRepl& FriendId, const class FString& ListName, const class FString& ErrorStr)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const struct FUniqueNetIdRepl& FriendId, const class FString& ListName, const class FString& ErrorStr)> OnSendInviteComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineFriendsSubsystem*                __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__LocalUserNum;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       __Store__FriendId;                                 // 0x0070(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 __Store__ListName;                                 // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineFriendsSubsystemSendInvite* SendInvite(class UOnlineFriendsSubsystem* Subsystem, int32 LocalUserNum, const struct FUniqueNetIdRepl& FriendId, const class FString& ListName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineFriendsSubsystemSendInvite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineFriendsSubsystemSendInvite")
	}
	static class UOnlineFriendsSubsystemSendInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineFriendsSubsystemSendInvite>();
	}
};
DUMPER7_ASSERTS_UOnlineFriendsSubsystemSendInvite;

// Class OnlineSubsystemBlueprints.OnlineEventsSubsystem
// 0x0070 (0x00A0 - 0x0030)
class UOnlineEventsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSubsystemAvailable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineEventsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineEventsSubsystem")
	}
	static class UOnlineEventsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineEventsSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineEventsSubsystem;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystem
// 0x0140 (0x0170 - 0x0030)
class UOnlineExternalUISubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExternalUIFlowHandlerRegistration> FlowHandlers;                                  // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0xA8];                                      // 0x00B8(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Param1)>   OnExternalUIChange;                                // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void AddLoginFlowHandler(const TScriptInterface<class IExternalUIFlowHandler>& Handler);
	bool CloseWebURL();
	bool IsSubsystemAvailable();
	void LoginFlowComplete(int32 RequestID, const struct FLoginFlowResultBP& Result);
	struct FLoginFlowResultBP NotifyLoginRedirectURL(int32 RequestID, const class FString& URL);
	void RemoveLoginFlowHandler(const TScriptInterface<class IExternalUIFlowHandler>& Handler);
	void ReportEnterInGameStoreUI();
	void ReportExitInGameStoreUI();
	bool ShowAccountUpgradeUI(const struct FUniqueNetIdRepl& UniqueID);
	bool ShowAchievementsUI(int32 LocalUserNum);
	bool ShowFriendsUI(int32 LocalUserNum);
	bool ShowInviteUI(int32 LocalUserNum, class FName SessionName);
	bool ShowLeaderboardUI(const class FString& LeaderboardName);
	bool ShowPlatformMessageBox(const struct FUniqueNetIdRepl& UserId, EPlatformMessageType_ MessageType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystem")
	}
	static class UOnlineExternalUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystem;

// Class OnlineSubsystemBlueprints.VoiceChatUserLogout
// 0x0028 (0x0058 - 0x0030)
class UVoiceChatUserLogout final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& playerName, const struct FVoiceChatResultBP& Result)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& playerName, const struct FVoiceChatResultBP& Result)> OnVoiceChatLogoutComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UVoiceChatUser*                         __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UVoiceChatUserLogout* Logout(class UVoiceChatUser* Subsystem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoiceChatUserLogout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoiceChatUserLogout")
	}
	static class UVoiceChatUserLogout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChatUserLogout>();
	}
};
DUMPER7_ASSERTS_UVoiceChatUserLogout;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowLoginUI
// 0x0040 (0x0070 - 0x0030)
class UOnlineExternalUISubsystemShowLoginUI final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& UniqueID, int32 ControllerIndex, const struct FOnlineErrorInfo& Error)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& UniqueID, int32 ControllerIndex, const struct FOnlineErrorInfo& Error)> OnLoginUIClosed; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__ControllerIndex;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          __Store__bShowOnlineOnly;                          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          __Store__bShowSkipButton;                          // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOnlineExternalUISubsystemShowLoginUI* ShowLoginUI(class UOnlineExternalUISubsystem* Subsystem, int32 ControllerIndex, bool bShowOnlineOnly, bool bShowSkipButton);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowLoginUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowLoginUI")
	}
	static class UOnlineExternalUISubsystemShowLoginUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowLoginUI>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowLoginUI;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowAccountCreationUI
// 0x0040 (0x0070 - 0x0030)
class UOnlineExternalUISubsystemShowAccountCreationUI final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 ControllerIndex, const struct FOnlineAccountCredential& AccountCredentials, const struct FOnlineErrorInfo& Error)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ControllerIndex, const struct FOnlineAccountCredential& AccountCredentials, const struct FOnlineErrorInfo& Error)> OnAccountCreationUIClosed; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__ControllerIndex;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOnlineExternalUISubsystemShowAccountCreationUI* ShowAccountCreationUI(class UOnlineExternalUISubsystem* Subsystem, int32 ControllerIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowAccountCreationUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowAccountCreationUI")
	}
	static class UOnlineExternalUISubsystemShowAccountCreationUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowAccountCreationUI>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowAccountCreationUI;

// Class OnlineSubsystemBlueprints.OnlinePurchaseSubsystem
// 0x0088 (0x00B8 - 0x0030)
class UOnlinePurchaseSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FUniqueNetIdRepl& UserId)> OnUnexpectedPurchaseReceipt; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void FinalizePurchase(const struct FUniqueNetIdRepl& UserId, const class FString& ReceiptId, const class FString& ReceiptInfo);
	void GetReceipts(const struct FUniqueNetIdRepl& UserId, TArray<class UPurchaseReceipt*>* OutReceipts);
	bool IsAllowedToPurchase(const struct FUniqueNetIdRepl& UserId);
	bool IsSubsystemAvailable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlinePurchaseSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlinePurchaseSubsystem")
	}
	static class UOnlinePurchaseSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlinePurchaseSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlinePurchaseSubsystem;

// Class OnlineSubsystemBlueprints.OnlineSessionSearch
// 0x0088 (0x00B0 - 0x0028)
class UOnlineSessionSearch final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSearchResults;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLanQuery;                                       // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PingBucketSize;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlatformHash;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeoutInSeconds;                                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSessionSearchParamBP> SearchParams;                                    // 0x0060(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	TArray<struct FOnlineSessionSearchResultBP> GetSearchResults() const;
	EOnlineAsyncTaskState_ GetSearchState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineSessionSearch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineSessionSearch")
	}
	static class UOnlineSessionSearch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSessionSearch>();
	}
};
DUMPER7_ASSERTS_UOnlineSessionSearch;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowWebURL
// 0x0080 (0x00B0 - 0x0030)
class UOnlineExternalUISubsystemShowWebURL final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& FinalUrl)> OnCallFailed;                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& FinalUrl)> OnShowWebUrlClosed;                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 __Store__Url;                                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FShowWebUrlParameters                  __Store__ShowParams;                               // 0x0078(0x0038)(NativeAccessSpecifierPrivate)

public:
	static class UOnlineExternalUISubsystemShowWebURL* ShowWebURL(class UOnlineExternalUISubsystem* Subsystem, const class FString& URL, const struct FShowWebUrlParameters& ShowParams);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowWebURL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowWebURL")
	}
	static class UOnlineExternalUISubsystemShowWebURL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowWebURL>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowWebURL;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowProfileUI
// 0x0098 (0x00C8 - 0x0030)
class UOnlineExternalUISubsystemShowProfileUI final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnCallFailed;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProfileUIClosed;                                 // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__Requestor;                                // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       __Store__Requestee;                                // 0x0098(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineExternalUISubsystemShowProfileUI* ShowProfileUI(class UOnlineExternalUISubsystem* Subsystem, const struct FUniqueNetIdRepl& Requestor, const struct FUniqueNetIdRepl& Requestee);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowProfileUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowProfileUI")
	}
	static class UOnlineExternalUISubsystemShowProfileUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowProfileUI>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowProfileUI;

// Class OnlineSubsystemBlueprints.OnlineFriendsSubsystemReadFriendsList
// 0x0050 (0x0080 - 0x0030)
class UOnlineFriendsSubsystemReadFriendsList final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const class FString& ListName, const class FString& ErrorStr)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const class FString& ListName, const class FString& ErrorStr)> OnReadFriendsListComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineFriendsSubsystem*                __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__LocalUserNum;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 __Store__ListName;                                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineFriendsSubsystemReadFriendsList* ReadFriendsList(class UOnlineFriendsSubsystem* Subsystem, int32 LocalUserNum, const class FString& ListName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineFriendsSubsystemReadFriendsList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineFriendsSubsystemReadFriendsList")
	}
	static class UOnlineFriendsSubsystemReadFriendsList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineFriendsSubsystemReadFriendsList>();
	}
};
DUMPER7_ASSERTS_UOnlineFriendsSubsystemReadFriendsList;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowStoreUI
// 0x0068 (0x0098 - 0x0030)
class UOnlineExternalUISubsystemShowStoreUI final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bPurchased)> OnCallFailed;                                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bPurchased)> OnShowStoreUIClosed;                             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__LocalUserNum;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShowStoreParameters                   __Store__ShowParams;                               // 0x0070(0x0028)(NativeAccessSpecifierPrivate)

public:
	static class UOnlineExternalUISubsystemShowStoreUI* ShowStoreUI(class UOnlineExternalUISubsystem* Subsystem, int32 LocalUserNum, const struct FShowStoreParameters& ShowParams);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowStoreUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowStoreUI")
	}
	static class UOnlineExternalUISubsystemShowStoreUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowStoreUI>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowStoreUI;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowSendMessageUI
// 0x0118 (0x0148 - 0x0030)
class UOnlineExternalUISubsystemShowSendMessageUI final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bMessageSent)> OnCallFailed;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bMessageSent)> OnShowSendMessageUIClosed;                     // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         __Store__LocalUserNum;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShowSendMessageParameters             __Store__ShowParams;                               // 0x0070(0x00D8)(NativeAccessSpecifierPrivate)

public:
	static class UOnlineExternalUISubsystemShowSendMessageUI* ShowSendMessageUI(class UOnlineExternalUISubsystem* Subsystem, int32 LocalUserNum, const struct FShowSendMessageParameters& ShowParams);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineExternalUISubsystemShowSendMessageUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineExternalUISubsystemShowSendMessageUI")
	}
	static class UOnlineExternalUISubsystemShowSendMessageUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineExternalUISubsystemShowSendMessageUI>();
	}
};
DUMPER7_ASSERTS_UOnlineExternalUISubsystemShowSendMessageUI;

// Class OnlineSubsystemBlueprints.OnlineFriendsSubsystemBlockPlayer
// 0x0078 (0x00A8 - 0x0030)
class UOnlineFriendsSubsystemBlockPlayer final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bWasSuccessful, const struct FUniqueNetIdRepl& UniqueID, const class FString& ListName, const class FString& ErrorStr)> OnCallFailed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bWasSuccessful, const struct FUniqueNetIdRepl& UniqueID, const class FString& ListName, const class FString& ErrorStr)> OnBlockedPlayerComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UOnlineFriendsSubsystem*                __Store__Subsystem;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 __Store__CallUniquenessId;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __Store__LocalUserNum;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       __Store__PlayerId;                                 // 0x0078(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UOnlineFriendsSubsystemBlockPlayer* BlockPlayer(class UOnlineFriendsSubsystem* Subsystem, int32 LocalUserNum, const struct FUniqueNetIdRepl& PlayerId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineFriendsSubsystemBlockPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineFriendsSubsystemBlockPlayer")
	}
	static class UOnlineFriendsSubsystemBlockPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineFriendsSubsystemBlockPlayer>();
	}
};
DUMPER7_ASSERTS_UOnlineFriendsSubsystemBlockPlayer;

// Class OnlineSubsystemBlueprints.OnlineExternalUISubsystemShowSendMessageToUserUI
// 0x0148 (0x0178 - 0x0030)
class UOnlineExternalUISubsystemShowSendMessageToUserUI final : public UBlueprintAsyncActionBase
{
public:
