#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemBlueprints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievement
// 0x0060 (0x0060 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievement final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievementId;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineAchievementBP                   OutAchievement;                                    // 0x0040(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystem_GetCachedAchievement;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievementDescription
// 0x0058 (0x0058 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievementDescription final
{
public:
	class FString                                 AchievementId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineAchievementDescBP               OutAchievementDesc;                                // 0x0010(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystem_GetCachedAchievementDescription;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievements
// 0x0048 (0x0048 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievements final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnlineAchievementBP>           OutAchievements;                                   // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystem_GetCachedAchievements;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineAchievementsSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystem_IsSubsystemAvailable;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemWriteAchievements.WriteAchievements
// 0x0048 (0x0048 - 0x0000)
struct OnlineAchievementsSubsystemWriteAchievements_WriteAchievements final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsWrite*               WriteObject;                                       // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemWriteAchievements* ReturnValue;                                // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystemWriteAchievements_WriteAchievements;

// Function OnlineSubsystemBlueprints.VoiceChatUser.BlockPlayers
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_BlockPlayers final
{
public:
	TArray<class FString>                         PlayerNames;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_BlockPlayers;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAudioInputDeviceMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_GetAudioInputDeviceMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAudioInputDeviceMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAudioInputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatUser_GetAudioInputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAudioInputVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAudioOutputDeviceMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_GetAudioOutputDeviceMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAudioOutputDeviceMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAudioOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatUser_GetAudioOutputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAudioOutputVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAvailableInputDeviceInfos
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_GetAvailableInputDeviceInfos final
{
public:
	TArray<struct FVoiceChatDeviceInfoBP>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAvailableInputDeviceInfos;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetAvailableOutputDeviceInfos
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_GetAvailableOutputDeviceInfos final
{
public:
	TArray<struct FVoiceChatDeviceInfoBP>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetAvailableOutputDeviceInfos;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetChannels
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_GetChannels final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetChannels;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetChannelType
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_GetChannelType final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoiceChatChannelType_                        ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_GetChannelType;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetDefaultInputDeviceInfo
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetDefaultInputDeviceInfo final
{
public:
	struct FVoiceChatDeviceInfoBP                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetDefaultInputDeviceInfo;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetDefaultOutputDeviceInfo
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetDefaultOutputDeviceInfo final
{
public:
	struct FVoiceChatDeviceInfoBP                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetDefaultOutputDeviceInfo;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetInputDeviceInfo
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetInputDeviceInfo final
{
public:
	struct FVoiceChatDeviceInfoBP                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetInputDeviceInfo;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetLoggedInPlayerName
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_GetLoggedInPlayerName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetLoggedInPlayerName;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetOutputDeviceInfo
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetOutputDeviceInfo final
{
public:
	struct FVoiceChatDeviceInfoBP                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetOutputDeviceInfo;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetPlayersInChannel
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetPlayersInChannel final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetPlayersInChannel;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetPlayerVolume
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_GetPlayerVolume final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_GetPlayerVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetSetting
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_GetSetting final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetSetting;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetTransmitChannels
// 0x0050 (0x0050 - 0x0000)
struct VoiceChatUser_GetTransmitChannels final
{
public:
	TSet<class FString>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetTransmitChannels;

// Function OnlineSubsystemBlueprints.VoiceChatUser.GetTransmitMode
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_GetTransmitMode final
{
public:
	EVoiceChatTransmitMode_                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_GetTransmitMode;

// Function OnlineSubsystemBlueprints.VoiceChatUser.InsecureGetJoinToken
// 0x0038 (0x0038 - 0x0000)
struct VoiceChatUser_InsecureGetJoinToken final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoiceChatChannelType_                        ChannelType;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoiceChatChannel3dPropertiesBP        Channel3dProperties;                               // 0x0014(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_InsecureGetJoinToken;

// Function OnlineSubsystemBlueprints.VoiceChatUser.InsecureGetLoginToken
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_InsecureGetLoginToken final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_InsecureGetLoginToken;

// Function OnlineSubsystemBlueprints.VoiceChatUser.IsChannelPlayerMuted
// 0x0028 (0x0028 - 0x0000)
struct VoiceChatUser_IsChannelPlayerMuted final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 playerName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_IsChannelPlayerMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_IsLoggedIn;

// Function OnlineSubsystemBlueprints.VoiceChatUser.IsLoggingIn
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_IsLoggingIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_IsLoggingIn;

// Function OnlineSubsystemBlueprints.VoiceChatUser.IsPlayerMuted
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_IsPlayerMuted final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_IsPlayerMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.IsPlayerTalking
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_IsPlayerTalking final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_IsPlayerTalking;

// Function OnlineSubsystemBlueprints.VoiceChatUser.Set3DPosition
// 0x0028 (0x0028 - 0x0000)
struct VoiceChatUser_Set3DPosition final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SpeakerPosition;                                   // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_Set3DPosition;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetAudioInputDeviceMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_SetAudioInputDeviceMuted final
{
public:
	bool                                          bIsMuted;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetAudioInputDeviceMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetAudioInputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatUser_SetAudioInputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetAudioInputVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetAudioOutputDeviceMuted
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatUser_SetAudioOutputDeviceMuted final
{
public:
	bool                                          bIsMuted;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetAudioOutputDeviceMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetAudioOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatUser_SetAudioOutputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetAudioOutputVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetChannelPlayerMuted
// 0x0028 (0x0028 - 0x0000)
struct VoiceChatUser_SetChannelPlayerMuted final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 playerName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAudioMuted;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_SetChannelPlayerMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetInputDeviceId
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_SetInputDeviceId final
{
public:
	class FString                                 InputDeviceId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetInputDeviceId;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetOutputDeviceId
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_SetOutputDeviceId final
{
public:
	class FString                                 OutputDeviceId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetOutputDeviceId;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetPlayerMuted
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_SetPlayerMuted final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuted;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_SetPlayerMuted;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetPlayerVolume
// 0x0018 (0x0018 - 0x0000)
struct VoiceChatUser_SetPlayerVolume final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoiceChatUser_SetPlayerVolume;

// Function OnlineSubsystemBlueprints.VoiceChatUser.SetSetting
// 0x0020 (0x0020 - 0x0000)
struct VoiceChatUser_SetSetting final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_SetSetting;

// Function OnlineSubsystemBlueprints.VoiceChatUser.TransmitToSpecificChannels
// 0x0050 (0x0050 - 0x0000)
struct VoiceChatUser_TransmitToSpecificChannels final
{
public:
	TSet<class FString>                           ChannelNames;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_TransmitToSpecificChannels;

// Function OnlineSubsystemBlueprints.VoiceChatUser.UnblockPlayers
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatUser_UnblockPlayers final
{
public:
	TArray<class FString>                         PlayerNames;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatUser_UnblockPlayers;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievements.QueryAchievements
// 0x0040 (0x0040 - 0x0000)
struct OnlineAchievementsSubsystemQueryAchievements_QueryAchievements final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemQueryAchievements* ReturnValue;                                // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystemQueryAchievements_QueryAchievements;

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievementDescriptions.QueryAchievementDescriptions
// 0x0040 (0x0040 - 0x0000)
struct OnlineAchievementsSubsystemQueryAchievementDescriptions_QueryAchievementDescriptions final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemQueryAchievementDescriptions* ReturnValue;                     // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAchievementsSubsystemQueryAchievementDescriptions_QueryAchievementDescriptions;

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineAvatarSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAvatarSubsystem_IsSubsystemAvailable;

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatar.GetAvatar
// 0x0078 (0x0078 - 0x0000)
struct OnlineAvatarSubsystemGetAvatar_GetAvatar final
{
public:
	class UOnlineAvatarSubsystem*                 Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0038(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               DefaultTexture;                                    // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystemGetAvatar*        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAvatarSubsystemGetAvatar_GetAvatar;

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatarUrl.GetAvatarUrl
// 0x0080 (0x0080 - 0x0000)
struct OnlineAvatarSubsystemGetAvatarUrl_GetAvatarUrl final
{
public:
	class UOnlineAvatarSubsystem*                 Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0038(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultAvatarUrl;                                  // 0x0068(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystemGetAvatarUrl*     ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineAvatarSubsystemGetAvatarUrl_GetAvatarUrl;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.ConfigureRoom
// 0x0068 (0x0068 - 0x0000)
struct OnlineChatSubsystem_ConfigureRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_ConfigureRoom;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.CreateRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_CreateRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_CreateRoom;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.ExitRoom
// 0x0048 (0x0048 - 0x0000)
struct OnlineChatSubsystem_ExitRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_ExitRoom;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetJoinedRooms
// 0x0040 (0x0040 - 0x0000)
struct OnlineChatSubsystem_GetJoinedRooms final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutRooms;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineChatSubsystem_GetJoinedRooms;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetLastMessages
// 0x0060 (0x0060 - 0x0000)
struct OnlineChatSubsystem_GetLastMessages final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumMessages;                                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChatMessageBP>                 OutMessages;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_GetLastMessages;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetMember
// 0x00B8 (0x00B8 - 0x0000)
struct OnlineChatSubsystem_GetMember final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       MemberId;                                          // 0x0040(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomMemberBP                      ReturnValue;                                       // 0x0070(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineChatSubsystem_GetMember;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetMembers
// 0x0058 (0x0058 - 0x0000)
struct OnlineChatSubsystem_GetMembers final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChatRoomMemberBP>              OutMembers;                                        // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_GetMembers;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetRoomInfo
// 0x00C0 (0x00C0 - 0x0000)
struct OnlineChatSubsystem_GetRoomInfo final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomInfoBP                        ReturnValue;                                       // 0x0040(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineChatSubsystem_GetRoomInfo;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.IsChatAllowed
// 0x0068 (0x0068 - 0x0000)
struct OnlineChatSubsystem_IsChatAllowed final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       RecipientId;                                       // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_IsChatAllowed;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineChatSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnlineChatSubsystem_IsSubsystemAvailable;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.JoinPrivateRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_JoinPrivateRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_JoinPrivateRoom;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.JoinPublicRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_JoinPublicRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_JoinPublicRoom;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.SendPrivateChat
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_SendPrivateChat final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       RecipientId;                                       // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgBody;                                           // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_SendPrivateChat;

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.SendRoomChat
// 0x0058 (0x0058 - 0x0000)
struct OnlineChatSubsystem_SendRoomChat final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgBody;                                           // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OnlineChatSubsystem_SendRoomChat;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_BoolToFOnlineSessionSettingBP
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_BoolToFOnlineSessionSettingBP final
{
public:
	bool                                          InData;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineSessionSettingBP                ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_BoolToFOnlineSessionSettingBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_BoolToFVariantDataBP
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_BoolToFVariantDataBP final
{
public:
	bool                                          InData;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVariantDataBP                         ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_BoolToFVariantDataBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_DoubleToFOnlineSessionSettingBP
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_DoubleToFOnlineSessionSettingBP final
{
public:
	double                                        InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineSessionSettingBP                ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_DoubleToFOnlineSessionSettingBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_DoubleToFVariantDataBP
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_DoubleToFVariantDataBP final
{
public:
	double                                        InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVariantDataBP                         ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_DoubleToFVariantDataBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FOnlineSessionSettingBPToBool
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToBool final
{
public:
	struct FOnlineSessionSettingBP                InData;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToBool;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FOnlineSessionSettingBPToDouble
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToDouble final
{
public:
	struct FOnlineSessionSettingBP                InData;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToDouble;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FOnlineSessionSettingBPToInt64
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToInt64 final
{
public:
	struct FOnlineSessionSettingBP                InData;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToInt64;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FOnlineSessionSettingBPToString
// 0x0048 (0x0048 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToString final
{
public:
	struct FOnlineSessionSettingBP                InData;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FOnlineSessionSettingBPToString;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FVariantDataBPToBool
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToBool final
{
public:
	struct FVariantDataBP                         InData;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToBool;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FVariantDataBPToDouble
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToDouble final
{
public:
	struct FVariantDataBP                         InData;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToDouble;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FVariantDataBPToInt64
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToInt64 final
{
public:
	struct FVariantDataBP                         InData;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToInt64;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_FVariantDataBPToString
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToString final
{
public:
	struct FVariantDataBP                         InData;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_FVariantDataBPToString;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_Int64ToFOnlineSessionSettingBP
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_Int64ToFOnlineSessionSettingBP final
{
public:
	int64                                         InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineSessionSettingBP                ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_Int64ToFOnlineSessionSettingBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_Int64ToFVariantDataBP
// 0x0038 (0x0038 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_Int64ToFVariantDataBP final
{
public:
	int64                                         InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVariantDataBP                         ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_Int64ToFVariantDataBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_StringToFOnlineSessionSettingBP
// 0x0048 (0x0048 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_StringToFOnlineSessionSettingBP final
{
public:
	class FString                                 InData;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineSessionSettingBP                ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_StringToFOnlineSessionSettingBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.Conv_StringToFVariantDataBP
// 0x0040 (0x0040 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_Conv_StringToFVariantDataBP final
{
public:
	class FString                                 InData;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVariantDataBP                         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointOSSv1BlueprintFunctionLibrary_Conv_StringToFVariantDataBP;

// Function OnlineSubsystemBlueprints.RedpointOSSv1BlueprintFunctionLibrary.EqualEqual_FOnlineSessionSettingBPFOnlineSessionSettingBP
// 0x0078 (0x0078 - 0x0000)
struct RedpointOSSv1BlueprintFunctionLibrary_EqualEqual_FOnlineSessionSettingBPFOnlineSessionSettingBP final
{
public:
	struct FOnlineSessionSettingBP                InA;                                               // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
