#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenColorIO

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum OpenColorIO.EOpenColorIOViewTransformDirection
// NumValues: 0x0003
enum class EOpenColorIOViewTransformDirection : uint8
{
	Forward                                  = 0,
	Inverse                                  = 1,
	EOpenColorIOViewTransformDirection_MAX   = 2,
};

// ScriptStruct OpenColorIO.OpenColorIOColorSpace
// 0x0030 (0x0030 - 0x0000)
struct FOpenColorIOColorSpace final
{
public:
	class FString                                 ColorSpaceName;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FamilyName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenColorIOColorSpace;

// ScriptStruct OpenColorIO.OpenColorIODisplayView
// 0x0030 (0x0030 - 0x0000)
struct FOpenColorIODisplayView final
{
public:
	class FString                                 Display;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 View;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenColorIODisplayView;

// ScriptStruct OpenColorIO.OpenColorIOColorConversionSettings
// 0x00A0 (0x00A0 - 0x0000)
struct FOpenColorIOColorConversionSettings final
{
public:
	class UOpenColorIOConfiguration*              ConfigurationSource;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FOpenColorIOColorSpace                 SourceColorSpace;                                  // 0x0008(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FOpenColorIOColorSpace                 DestinationColorSpace;                             // 0x0038(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FOpenColorIODisplayView                DestinationDisplayView;                            // 0x0068(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EOpenColorIOViewTransformDirection            DisplayViewDirection;                              // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOpenColorIOColorConversionSettings;

// ScriptStruct OpenColorIO.OpenColorIODisplayConfiguration
// 0x00A8 (0x00A8 - 0x0000)
struct FOpenColorIODisplayConfiguration final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenColorIOColorConversionSettings    ColorConfiguration;                                // 0x0008(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenColorIODisplayConfiguration;

SDK_NAMESPACE_END
