#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BlendStack_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chooser_structs.hpp"


SDK_NAMESPACE_START

// Enum PoseSearch.EPoseSearchAssetSamplerSpace
// NumValues: 0x0004
enum class EPoseSearchAssetSamplerSpace : uint8
{
	Local                                    = 0,
	Component                                = 1,
	World                                    = 2,
	EPoseSearchAssetSamplerSpace_MAX         = 3,
};

// Enum PoseSearch.EPoseSearchMode
// NumValues: 0x0005
enum class EPoseSearchMode : uint32
{
	BruteForce                               = 0,
	PCAKDTree                                = 1,
	VPTree                                   = 2,
	EventOnly                                = 3,
	EPoseSearchMode_MAX                      = 4,
};

// Enum PoseSearch.EPoseSearchMirrorOption
// NumValues: 0x0004
enum class EPoseSearchMirrorOption : uint8
{
	UnmirroredOnly                           = 0,
	MirroredOnly                             = 1,
	UnmirroredAndMirrored                    = 2,
	EPoseSearchMirrorOption_MAX              = 3,
};

// Enum PoseSearch.EComponentStrippingVector
// NumValues: 0x0004
enum class EComponentStrippingVector : uint8
{
	None                                     = 0,
	StripXY                                  = 1,
	StripZ                                   = 2,
	EComponentStrippingVector_MAX            = 3,
};

// Enum PoseSearch.EInputQueryPose
// NumValues: 0x0003
enum class EInputQueryPose : uint8
{
	UseCharacterPose                         = 0,
	UseContinuingPose                        = 1,
	EInputQueryPose_MAX                      = 2,
};

// Enum PoseSearch.EPermutationTimeType
// NumValues: 0x0004
enum class EPermutationTimeType : uint8
{
	UseSampleTime                            = 0,
	UsePermutationTime                       = 1,
	UseSampleToPermutationTime               = 2,
	EPermutationTimeType_MAX                 = 3,
};

// Enum PoseSearch.EHeadingAxis
// NumValues: 0x0005
enum class EHeadingAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	Num                                      = 3,
	EHeadingAxis_MAX                         = 4,
};

// Enum PoseSearch.EPoseSearchBoneFlags
// NumValues: 0x0005
enum class EPoseSearchBoneFlags : uint8
{
	Velocity                                 = 1,
	Position                                 = 2,
	Rotation                                 = 4,
	Phase                                    = 8,
	EPoseSearchBoneFlags_MAX                 = 9,
};

// Enum PoseSearch.EPoseSearchTrajectoryFlags
// NumValues: 0x0009
enum class EPoseSearchTrajectoryFlags : uint8
{
	Velocity                                 = 1,
	Position                                 = 2,
	VelocityDirection                        = 4,
	FacingDirection                          = 8,
	VelocityXY                               = 16,
	PositionXY                               = 32,
	VelocityDirectionXY                      = 64,
	FacingDirectionXY                        = 128,
	EPoseSearchTrajectoryFlags_MAX           = 129,
};

// Enum PoseSearch.EPoseSearchDataPreprocessor
// NumValues: 0x0005
enum class EPoseSearchDataPreprocessor : uint8
{
	None                                     = 0,
	Normalize                                = 1,
	NormalizeOnlyByDeviation                 = 2,
	NormalizeWithCommonSchema                = 3,
	EPoseSearchDataPreprocessor_MAX          = 4,
};

// Enum PoseSearch.EPoseSearchInterruptMode
// NumValues: 0x0006
enum class EPoseSearchInterruptMode : uint8
{
	DoNotInterrupt                           = 0,
	InterruptOnDatabaseChange                = 1,
	InterruptOnDatabaseChangeAndInvalidateContinuingPose = 2,
	ForceInterrupt                           = 3,
	ForceInterruptAndInvalidateContinuingPose = 4,
	EPoseSearchInterruptMode_MAX             = 5,
};

// ScriptStruct PoseSearch.PoseSearchInteractionAvailability
// 0x0030 (0x0030 - 0x0000)
struct FPoseSearchInteractionAvailability
{
public:
	class UPoseSearchDatabase*                    Database;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   Tag;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           RolesFilter;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BroadPhaseRadius;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BroadPhaseRadiusIncrementOnInteraction;            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableCollisions;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TickPriority;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchInteractionAvailability;

// ScriptStruct PoseSearch.PoseSearchBlueprintResult
// 0x0078 (0x0078 - 0x0000)
struct FPoseSearchBlueprintResult final
{
public:
	class UObject*                                SelectedAnim;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         SelectedTime;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsContinuingPoseSearch;                           // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WantedPlayRate;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0014(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMirrored;                                       // 0x0015(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BlendParameters;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPoseSearchDatabase*                    SelectedDatabase;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         SearchCost;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInteraction;                                    // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Role;                                              // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ActorRootTransforms;                               // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ActorRootBoneTransforms;                           // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        AnimContexts;                                      // 0x0068(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchBlueprintResult;

// ScriptStruct PoseSearch.AnimNode_MotionMatchingInteraction
// 0x0190 (0x0250 - 0x00C0)
struct alignas(0x10) FAnimNode_MotionMatchingInteraction final : public FAnimNode_BlendStack_Standalone
{
public:
	TArray<struct FPoseSearchInteractionAvailability> Availabilities;                                // 0x00C0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bValidateResultAgainstAvailabilities;              // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WarpingTranslationRatio;                           // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpingRotationRatio;                              // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarpUsingRootBone;                                // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetOnBecomingRelevant;                          // 0x00DD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendTime;                                         // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EAlphaBlendOption                             BlendOption;                                       // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlendStack_BlendspaceUpdateMode              BlendspaceUpdateMode;                              // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInertialBlend;                                 // 0x00F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchBlueprintResult             CurrentResult;                                     // 0x00F8(0x0078)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0xE0];                                     // 0x0170(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_MotionMatchingInteraction;

// ScriptStruct PoseSearch.ChooserParameterPoseHistoryBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterPoseHistoryBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterPoseHistoryBase;

// ScriptStruct PoseSearch.MotionMatchingBlueprintBlendSettings
// 0x0018 (0x0018 - 0x0000)
struct FMotionMatchingBlueprintBlendSettings final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EAlphaBlendOption                             BlendOption;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInertialBlend;                                 // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMotionMatchingBlueprintBlendSettings;

// ScriptStruct PoseSearch.MotionMatchingAnimNodeReference
// 0x0000 (0x0010 - 0x0010)
struct FMotionMatchingAnimNodeReference final : public FAnimNodeReference
{
};
DUMPER7_ASSERTS_FMotionMatchingAnimNodeReference;

// ScriptStruct PoseSearch.MotionMatchingInteractionAnimNodeReference
// 0x0000 (0x0010 - 0x0010)
struct FMotionMatchingInteractionAnimNodeReference final : public FAnimNodeReference
{
};
DUMPER7_ASSERTS_FMotionMatchingInteractionAnimNodeReference;

// ScriptStruct PoseSearch.PoseSearchAssetSamplerInput
// 0x00A0 (0x00A0 - 0x0000)
struct FPoseSearchAssetSamplerInput final
{
public:
	class UAnimationAsset*                        Animation;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AnimationTime;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RootTransformOrigin;                               // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirrored;                                         // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector                                BlendParameters;                                   // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RootTransformSamplingRate;                         // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchAssetSamplerInput;

// ScriptStruct PoseSearch.PoseSearchAssetSamplerPose
// 0x00E0 (0x00E0 - 0x0000)
struct alignas(0x10) FPoseSearchAssetSamplerPose final
{
public:
	uint8                                         Pad_0[0xE0];                                       // 0x0000(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchAssetSamplerPose;

// ScriptStruct PoseSearch.PoseHistoryContextProperty
// 0x0030 (0x0038 - 0x0008)
struct FPoseHistoryContextProperty final : public FChooserParameterPoseHistoryBase
{
public:
	struct FChooserPropertyBinding                Binding;                                           // 0x0008(0x0030)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseHistoryContextProperty;

// ScriptStruct PoseSearch.ChooserPoseSearchRowData
// 0x0008 (0x0008 - 0x0000)
struct FChooserPoseSearchRowData final
{
public:
	class UAnimationAsset*                        ResultAsset;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FChooserPoseSearchRowData;

// ScriptStruct PoseSearch.PoseSearchColumn
// 0x0050 (0x0058 - 0x0008)
struct FPoseSearchColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       OutputStartTime;                                   // 0x0018(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       OutputMirror;                                      // 0x0028(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       OutputCost;                                        // 0x0038(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserPoseSearchRowData>      RowValues;                                         // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchColumn;

// ScriptStruct PoseSearch.PoseSearchCost
// 0x0004 (0x0004 - 0x0000)
struct FPoseSearchCost final
{
public:
	float                                         TotalCost;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FPoseSearchCost;

// ScriptStruct PoseSearch.PoseSearchDatabaseAnimationAssetBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FPoseSearchDatabaseAnimationAssetBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchDatabaseAnimationAssetBase;

// ScriptStruct PoseSearch.PoseSearchDatabaseSequence
// 0x0008 (0x0010 - 0x0008)
struct FPoseSearchDatabaseSequence final : public FPoseSearchDatabaseAnimationAssetBase
{
public:
	class UAnimSequence*                          Sequence;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchDatabaseSequence;

// ScriptStruct PoseSearch.PoseSearchDatabaseBlendSpace
// 0x0008 (0x0010 - 0x0008)
struct FPoseSearchDatabaseBlendSpace final : public FPoseSearchDatabaseAnimationAssetBase
{
public:
	class UBlendSpace*                            BlendSpace;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchDatabaseBlendSpace;

// ScriptStruct PoseSearch.PoseSearchDatabaseAnimComposite
// 0x0008 (0x0010 - 0x0008)
struct FPoseSearchDatabaseAnimComposite final : public FPoseSearchDatabaseAnimationAssetBase
{
public:
	class UAnimComposite*                         AnimComposite;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchDatabaseAnimComposite;

// ScriptStruct PoseSearch.PoseSearchDatabaseAnimMontage
// 0x0008 (0x0010 - 0x0008)
struct FPoseSearchDatabaseAnimMontage final : public FPoseSearchDatabaseAnimationAssetBase
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchDatabaseAnimMontage;

// ScriptStruct PoseSearch.PoseSearchDatabaseMultiAnimAsset
// 0x0008 (0x0010 - 0x0008)
struct FPoseSearchDatabaseMultiAnimAsset final : public FPoseSearchDatabaseAnimationAssetBase
{
public:
	class UMultiAnimAsset*                        MultiAnimAsset;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FPoseSearchDatabaseMultiAnimAsset;

// ScriptStruct PoseSearch.PoseSearchEvent
// 0x0018 (0x0018 - 0x0000)
struct FPoseSearchEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToEvent;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePoseFilters;                                // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePlayRateRangeOverride;                         // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         PlayRateRangeOverride;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchEvent;

// ScriptStruct PoseSearch.PoseSearchBone
// 0x0014 (0x0014 - 0x0000)
struct FPoseSearchBone final
{
public:
	struct FBoneReference                         Reference;                                         // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Flags;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchBone;

// ScriptStruct PoseSearch.PoseSearchTrajectorySample
// 0x0008 (0x0008 - 0x0000)
struct FPoseSearchTrajectorySample final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Flags;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchTrajectorySample;

// ScriptStruct PoseSearch.PoseHistoryReference
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPoseHistoryReference final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseHistoryReference;

// ScriptStruct PoseSearch.PoseHistoryAnimationAttribute
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPoseHistoryAnimationAttribute final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseHistoryAnimationAttribute;

// ScriptStruct PoseSearch.PoseSearchHistoryCollectorAnimNodeReference
// 0x0000 (0x0010 - 0x0010)
struct FPoseSearchHistoryCollectorAnimNodeReference final : public FAnimNodeReference
{
};
DUMPER7_ASSERTS_FPoseSearchHistoryCollectorAnimNodeReference;

// ScriptStruct PoseSearch.PoseSearchInteractionAssetItem
// 0x0080 (0x0080 - 0x0000)
struct FPoseSearchInteractionAssetItem final
{
public:
	class UAnimationAsset*                        Animation;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   Role;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpingWeightRotation;                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpingWeightTranslation;                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Origin;                                            // 0x0020(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchInteractionAssetItem;

// ScriptStruct PoseSearch.PoseSearchInteractionAvailabilityEx
// 0x0010 (0x0040 - 0x0030)
struct FPoseSearchInteractionAvailabilityEx final : public FPoseSearchInteractionAvailability
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchInteractionAvailabilityEx;

// ScriptStruct PoseSearch.PoseSearchInteractionAnimContextAvailabilities
// 0x0018 (0x0018 - 0x0000)
struct FPoseSearchInteractionAnimContextAvailabilities final
{
public:
	class UObject*                                AnimContext;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FPoseSearchInteractionAvailabilityEx> Availabilities;                              // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchInteractionAnimContextAvailabilities;

// ScriptStruct PoseSearch.PoseSearchRoledSkeleton
// 0x0048 (0x0048 - 0x0000)
struct FPoseSearchRoledSkeleton final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   Role;                                              // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 BoneReferences;                                    // 0x0018(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<uint16>                                BoneIndicesWithParents;                            // 0x0028(0x0010)(ZeroConstructor, Transient, Deprecated, NativeAccessSpecifierPublic)
	TArray<class FName>                           RequiredCurves;                                    // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchRoledSkeleton;

// ScriptStruct PoseSearch.PoseSearchTrajectoryData
// 0x0128 (0x0128 - 0x0000)
struct FPoseSearchTrajectoryData final
{
public:
	float                                         RotateTowardsMovementSpeed;                        // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxControllerYawRate;                              // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BendVelocityTowardsAcceleration;                   // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpeedRemappingCurve;                           // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SpeedRemappingCurve;                               // 0x0010(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bUseAccelerationRemappingCurve;                    // 0x0098(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     AccelerationRemappingCurve;                        // 0x00A0(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchTrajectoryData;

// ScriptStruct PoseSearch.PoseSearchTrajectory_WorldCollisionResults
// 0x0008 (0x0008 - 0x0000)
struct FPoseSearchTrajectory_WorldCollisionResults final
{
public:
	float                                         TimeToLand;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandSpeed;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchTrajectory_WorldCollisionResults;

// ScriptStruct PoseSearch.PoseSearchQueryTrajectorySample
// 0x0040 (0x0040 - 0x0000)
struct FPoseSearchQueryTrajectorySample final
{
public:
	struct FQuat                                  Facing;                                            // 0x0000(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedSeconds;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchQueryTrajectorySample;

// ScriptStruct PoseSearch.PoseSearchQueryTrajectory
// 0x0010 (0x0010 - 0x0000)
struct FPoseSearchQueryTrajectory final
{
public:
	TArray<struct FPoseSearchQueryTrajectorySample> Samples;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchQueryTrajectory;

// ScriptStruct PoseSearch.MotionMatchingState
// 0x00F8 (0x00F8 - 0x0000)
struct FMotionMatchingState final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchBlueprintResult             SearchResult;                                      // 0x0020(0x0078)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x60];                                      // 0x0098(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMotionMatchingState;

// ScriptStruct PoseSearch.AnimNode_MotionMatching
// 0x0178 (0x0238 - 0x00C0)
struct FAnimNode_MotionMatching final : public FAnimNode_BlendStack_Standalone
{
public:
	class UPoseSearchDatabase*                    Database;                                          // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	float                                         BlendTime;                                         // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x00D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	EAlphaBlendOption                             BlendOption;                                       // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         PoseJumpThresholdTime;                             // 0x00DC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PoseReselectHistory;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SearchThrottleTime;                                // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatInterval                         PlayRate;                                          // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PlayRateMultiplier;                                // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseInertialBlend;                                 // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bResetOnBecomingRelevant;                          // 0x00F9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldSearch;                                     // 0x00FA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldUseCachedChannelData;                       // 0x00FB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPoseSearchEvent                       EventToSearch;                                     // 0x00FC(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMotionMatchingState                   MotionMatchingState;                               // 0x0118(0x00F8)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_210[0x10];                                     // 0x0210(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPoseSearchDatabase*>            DatabasesToSearch;                                 // 0x0220(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_MotionMatching;

// ScriptStruct PoseSearch.AnimNode_PoseSearchHistoryCollector_Base
// 0x0278 (0x0288 - 0x0010)
struct FAnimNode_PoseSearchHistoryCollector_Base : public FAnimNode_Base
{
public:
	int32                                         PoseCount;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplingInterval;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 CollectedBones;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           CollectedCurves;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bInitializeWithRefPose;                            // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetOnBecomingRelevant;                          // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoreScales;                                      // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RootBoneRecoveryTime;                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RootBoneTranslationRecoveryRatio;                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RootBoneRotationRecoveryRatio;                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bGenerateTrajectory;                               // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformTrajectory                   TransformTrajectory;                               // 0x0060(0x0010)(Edit, Transient, NativeAccessSpecifierPublic)
	float                                         TrajectorySpeedMultiplier;                         // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrajectoryHistoryCount;                            // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrajectoryPredictionCount;                         // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PredictionSamplingInterval;                        // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPoseSearchTrajectoryData              TrajectoryData;                                    // 0x0080(0x0128)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0xE0];                                     // 0x01A8(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_PoseSearchHistoryCollector_Base;

// ScriptStruct PoseSearch.AnimNode_PoseSearchHistoryCollector
// 0x0010 (0x0298 - 0x0288)
struct FAnimNode_PoseSearchHistoryCollector final : public FAnimNode_PoseSearchHistoryCollector_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0288(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnimNode_PoseSearchHistoryCollector;

// ScriptStruct PoseSearch.AnimNode_PoseSearchComponentSpaceHistoryCollector
// 0x0010 (0x0298 - 0x0288)
struct FAnimNode_PoseSearchComponentSpaceHistoryCollector final : public FAnimNode_PoseSearchHistoryCollector_Base
{
public:
	struct FComponentSpacePoseLink                Source;                                            // 0x0288(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnimNode_PoseSearchComponentSpaceHistoryCollector;

// ScriptStruct PoseSearch.PoseSearchIKWindowConstraint
// 0x0030 (0x0030 - 0x0000)
struct FPoseSearchIKWindowConstraint final
{
public:
	class FName                                   FromGoalName;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FromGoalRole;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToGoalName;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToGoalRole;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslationWeight;                                 // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationWeight;                                    // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActivationTime;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeactivationTime;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchIKWindowConstraint;

// ScriptStruct PoseSearch.PoseSearchFutureProperties
// 0x0010 (0x0010 - 0x0000)
struct FPoseSearchFutureProperties final
{
public:
	class UObject*                                Animation;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AnimationTime;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntervalTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPoseSearchFutureProperties;

// ScriptStruct PoseSearch.PoseSearchContinuingProperties
// 0x0030 (0x0030 - 0x0000)
struct FPoseSearchContinuingProperties final
{
public:
	class UObject*                                PlayingAsset;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         PlayingAssetAccumulatedTime;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingAssetMirrored;                           // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayingAssetBlendParameters;                       // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsContinuingInteraction;                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSearchContinuingProperties;

SDK_NAMESPACE_END
