#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PoseSearch_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// Class PoseSearch.MotionMatchingAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionMatchingAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMotionMatchingAnimNodeReference ConvertToMotionMatchingNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToMotionMatchingNodePure(const struct FAnimNodeReference& Node, struct FMotionMatchingAnimNodeReference* MotionMatchingNode, bool* Result);
	static void GetMotionMatchingBlendSettings(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, struct FMotionMatchingBlueprintBlendSettings* BlendSettings, bool* bIsResultValid);
	static void GetMotionMatchingSearchResult(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, struct FPoseSearchBlueprintResult* Result, bool* bIsResultValid);
	static void OverrideMotionMatchingBlendSettings(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, const struct FMotionMatchingBlueprintBlendSettings& BlendSettings, bool* bIsResultValid);
	static void ResetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, const TArray<class UPoseSearchDatabase*>& Databases, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabaseToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, class UPoseSearchDatabase* Database, EPoseSearchInterruptMode InterruptMode);
	static void SetInterruptMode(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionMatchingAnimNodeLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionMatchingAnimNodeLibrary")
	}
	static class UMotionMatchingAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionMatchingAnimNodeLibrary>();
	}
};
DUMPER7_ASSERTS_UMotionMatchingAnimNodeLibrary;

// Class PoseSearch.MotionMatchingInteractionAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionMatchingInteractionAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMotionMatchingInteractionAnimNodeReference ConvertToMotionMatchingInteractionNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToMotionMatchingInteractionNodePure(const struct FAnimNodeReference& Node, struct FMotionMatchingInteractionAnimNodeReference* MotionMatchingInteractionNode, bool* Result);
	static bool IsInteracting(const struct FMotionMatchingInteractionAnimNodeReference& MotionMatchingInteractionNode);
	static void SetAvailabilities(const struct FMotionMatchingInteractionAnimNodeReference& MotionMatchingInteractionNode, const TArray<struct FPoseSearchInteractionAvailability>& Availabilities);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionMatchingInteractionAnimNodeLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionMatchingInteractionAnimNodeLibrary")
	}
	static class UMotionMatchingInteractionAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionMatchingInteractionAnimNodeLibrary>();
	}
};
DUMPER7_ASSERTS_UMotionMatchingInteractionAnimNodeLibrary;

// Class PoseSearch.MultiAnimAsset
// 0x0000 (0x0028 - 0x0028)
class UMultiAnimAsset : public UObject
{
public:
	class UAnimationAsset* BP_GetAnimationAsset(const class FName& Role) const;
	struct FTransform BP_GetOrigin(const class FName& Role) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiAnimAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiAnimAsset")
	}
	static class UMultiAnimAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiAnimAsset>();
	}
};
DUMPER7_ASSERTS_UMultiAnimAsset;

// Class PoseSearch.PoseSearchAssetSamplerLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchAssetSamplerLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Draw(const class UAnimInstance* AnimInstance, struct FPoseSearchAssetSamplerPose& AssetSamplerPose);
	static struct FTransform GetTransformByName(struct FPoseSearchAssetSamplerPose& AssetSamplerPose, class FName BoneName, EPoseSearchAssetSamplerSpace Space);
	static struct FPoseSearchAssetSamplerPose SamplePose(const class UAnimInstance* AnimInstance, const struct FPoseSearchAssetSamplerInput& Input);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchAssetSamplerLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchAssetSamplerLibrary")
	}
	static class UPoseSearchAssetSamplerLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchAssetSamplerLibrary>();
	}
};
DUMPER7_ASSERTS_UPoseSearchAssetSamplerLibrary;

// Class PoseSearch.PoseSearchDatabase
// 0x01B0 (0x01E0 - 0x0030)
class UPoseSearchDatabase final : public UDataAsset
{
public:
	class UPoseSearchSchema*                      Schema;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         ContinuingPoseCostBias;                            // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseCostBias;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopingCostBias;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContinuingInteractionCostBias;                     // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               AnimationAssets;                                   // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UChooserTable*                          Chooser;                                           // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class FName>                           Tags;                                              // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EPoseSearchMode                               PoseSearchMode;                                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighbors;                           // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighborsWithDuplicates;             // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x164];                                     // 0x007C(0x0164)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UObject* GetAnimationAsset(int32 Index_0) const;
	int32 GetNumAnimationAssets() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchDatabase")
	}
	static class UPoseSearchDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchDatabase>();
	}
};
DUMPER7_ASSERTS_UPoseSearchDatabase;

// Class PoseSearch.PoseSearchEventLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchEventLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void UpdatePoseSearchEvent(const struct FPoseSearchEvent& InNewEvent, bool bIsNewEventValid, float DeltaSeconds, struct FPoseSearchEvent& InOutCurrentEvent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchEventLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchEventLibrary")
	}
	static class UPoseSearchEventLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchEventLibrary>();
	}
};
DUMPER7_ASSERTS_UPoseSearchEventLibrary;

// Class PoseSearch.PoseSearchFeatureChannel
// 0x0018 (0x0040 - 0x0028)
class UPoseSearchFeatureChannel : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelDataOffset;                                 // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ChannelCardinality;                                // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel")
	}
	static class UPoseSearchFeatureChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel;

// Class PoseSearch.PoseSearchFeatureChannel_Curve
// 0x0020 (0x0060 - 0x0040)
class UPoseSearchFeatureChannel_Curve final : public UPoseSearchFeatureChannel
{
public:
	class FName                                   CurveName;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          CurveIdx;                                          // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SampleTimeOffset;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetCurveValue(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Curve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Curve")
	}
	static class UPoseSearchFeatureChannel_Curve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Curve>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Curve;

// Class PoseSearch.PoseSearchFeatureChannel_Distance
// 0x0050 (0x0090 - 0x0040)
class UPoseSearchFeatureChannel_Distance final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0084(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0085(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0086(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0087(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetDistance(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Distance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Distance")
	}
	static class UPoseSearchFeatureChannel_Distance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Distance>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Distance;

// Class PoseSearch.PoseSearchFeatureChannel_FilterCrashingLegs
// 0x0058 (0x0098 - 0x0040)
class UPoseSearchFeatureChannel_FilterCrashingLegs final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         LeftThigh;                                         // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightThigh;                                        // 0x0050(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftFoot;                                          // 0x0060(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightFoot;                                         // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftThighIdx;                                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightThighIdx;                                     // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftFootIdx;                                       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightFootIdx;                                      // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AllowedTolerance;                                  // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_FilterCrashingLegs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_FilterCrashingLegs")
	}
	static class UPoseSearchFeatureChannel_FilterCrashingLegs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_FilterCrashingLegs>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_FilterCrashingLegs;

// Class PoseSearch.PoseSearchFeatureChannel_GroupBase
// 0x0010 (0x0050 - 0x0040)
class UPoseSearchFeatureChannel_GroupBase : public UPoseSearchFeatureChannel
{
public:
	class FName                                   SampleRole;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DebugWeightGroupID;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_GroupBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_GroupBase")
	}
	static class UPoseSearchFeatureChannel_GroupBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_GroupBase>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_GroupBase;

// Class PoseSearch.PoseSearchFeatureChannel_Group
// 0x0010 (0x0060 - 0x0050)
class UPoseSearchFeatureChannel_Group final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Group")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Group")
	}
	static class UPoseSearchFeatureChannel_Group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Group>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Group;

// Class PoseSearch.PoseSearchFeatureChannel_Heading
// 0x0048 (0x0088 - 0x0040)
class UPoseSearchFeatureChannel_Heading final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHeadingAxis                                  HeadingAxis;                                       // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0082(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FQuat BP_GetWorldRotation(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Heading")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Heading")
	}
	static class UPoseSearchFeatureChannel_Heading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Heading>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Heading;

// Class PoseSearch.PoseSearchFeatureChannel_Padding
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_Padding final : public UPoseSearchFeatureChannel
{
public:
	int32                                         PaddingSize;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Padding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Padding")
	}
	static class UPoseSearchFeatureChannel_Padding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Padding>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Padding;

// Class PoseSearch.PoseSearchFeatureChannel_PermutationTime
// 0x0000 (0x0040 - 0x0040)
class UPoseSearchFeatureChannel_PermutationTime final : public UPoseSearchFeatureChannel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_PermutationTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_PermutationTime")
	}
	static class UPoseSearchFeatureChannel_PermutationTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_PermutationTime>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_PermutationTime;

// Class PoseSearch.PoseSearchFeatureChannel_Phase
// 0x0020 (0x0060 - 0x0040)
class UPoseSearchFeatureChannel_Phase final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0058(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Phase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Phase")
	}
	static class UPoseSearchFeatureChannel_Phase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Phase>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Phase;

// Class PoseSearch.PoseSearchFeatureChannel_Pose
// 0x0038 (0x0088 - 0x0050)
class UPoseSearchFeatureChannel_Pose final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchBone>                SampledBones;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int8>                                  SchemaBoneIdx;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0078(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Pose")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Pose")
	}
	static class UPoseSearchFeatureChannel_Pose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Pose>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Pose;

// Class PoseSearch.PoseSearchFeatureChannel_Position
// 0x0050 (0x0090 - 0x0040)
class UPoseSearchFeatureChannel_Position final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxPositionDistanceSquared;                        // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalizeDisplacement;                            // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldPosition(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Position")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Position")
	}
	static class UPoseSearchFeatureChannel_Position* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Position>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Position;

// Class PoseSearch.PoseSearchFeatureChannel_SamplingTime
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_SamplingTime final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToMatch;                                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_SamplingTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_SamplingTime")
	}
	static class UPoseSearchFeatureChannel_SamplingTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_SamplingTime>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_SamplingTime;

// Class PoseSearch.PoseSearchFeatureChannel_TimeToEvent
// 0x0010 (0x0050 - 0x0040)
class UPoseSearchFeatureChannel_TimeToEvent final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetTimeToEvent(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_TimeToEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_TimeToEvent")
	}
	static class UPoseSearchFeatureChannel_TimeToEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_TimeToEvent>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_TimeToEvent;

// Class PoseSearch.PoseSearchFeatureChannel_Trajectory
// 0x0020 (0x0070 - 0x0050)
class UPoseSearchFeatureChannel_Trajectory final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchTrajectorySample>    Samples;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Trajectory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Trajectory")
	}
	static class UPoseSearchFeatureChannel_Trajectory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Trajectory>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Trajectory;

// Class PoseSearch.PoseSearchFeatureChannel_Velocity
// 0x0048 (0x0088 - 0x0040)
class UPoseSearchFeatureChannel_Velocity final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0086(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldVelocity(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchFeatureChannel_Velocity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchFeatureChannel_Velocity")
	}
	static class UPoseSearchFeatureChannel_Velocity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Velocity>();
	}
};
DUMPER7_ASSERTS_UPoseSearchFeatureChannel_Velocity;

// Class PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchHistoryCollectorAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FPoseSearchHistoryCollectorAnimNodeReference ConvertToPoseHistoryNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToPoseHistoryNodePure(const struct FAnimNodeReference& Node, struct FPoseSearchHistoryCollectorAnimNodeReference* PoseSearchHistoryCollectorNode, bool* Result);
	static void GetPoseHistoryNodeTransformTrajectory(const struct FPoseSearchHistoryCollectorAnimNodeReference& PoseSearchHistoryCollectorNode, struct FTransformTrajectory* Trajectory);
	static void SetPoseHistoryNodeTransformTrajectory(const struct FPoseSearchHistoryCollectorAnimNodeReference& PoseSearchHistoryCollectorNode, const struct FTransformTrajectory& Trajectory);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchHistoryCollectorAnimNodeLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchHistoryCollectorAnimNodeLibrary")
	}
	static class UPoseSearchHistoryCollectorAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchHistoryCollectorAnimNodeLibrary>();
	}
};
DUMPER7_ASSERTS_UPoseSearchHistoryCollectorAnimNodeLibrary;

// Class PoseSearch.PoseSearchInteractionAsset
// 0x0018 (0x0040 - 0x0028)
class UPoseSearchInteractionAsset final : public UMultiAnimAsset
{
public:
	TArray<struct FPoseSearchInteractionAssetItem> Items;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         WarpingBankingWeight;                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchInteractionAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchInteractionAsset")
	}
	static class UPoseSearchInteractionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchInteractionAsset>();
	}
};
DUMPER7_ASSERTS_UPoseSearchInteractionAsset;

// Class PoseSearch.PoseSearchInteractionLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchInteractionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FPoseSearchContinuingProperties GetMontageContinuingProperties(class UAnimInstance* AnimInstance);
	static struct FPoseSearchBlueprintResult MotionMatchInteraction(const TArray<struct FPoseSearchInteractionAvailability>& Availabilities, const class UObject* AnimContext, class FName PoseHistoryName, bool bValidateResultAgainstAvailabilities);
	static struct FPoseSearchBlueprintResult MotionMatchInteraction_Pure(const TArray<struct FPoseSearchInteractionAvailability>& Availabilities, const class UObject* AnimContext, class FName PoseHistoryName, bool bValidateResultAgainstAvailabilities);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchInteractionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchInteractionLibrary")
	}
	static class UPoseSearchInteractionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchInteractionLibrary>();
	}
};
DUMPER7_ASSERTS_UPoseSearchInteractionLibrary;

// Class PoseSearch.PoseSearchInteractionSubsystem
// 0x0058 (0x0098 - 0x0040)
class UPoseSearchInteractionSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<struct FPoseSearchInteractionAnimContextAvailabilities> AnimContextsAvailabilities;       // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchInteractionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchInteractionSubsystem")
	}
	static class UPoseSearchInteractionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchInteractionSubsystem>();
	}
};
DUMPER7_ASSERTS_UPoseSearchInteractionSubsystem;

// Class PoseSearch.PoseSearchNormalizationSet
// 0x0010 (0x0040 - 0x0030)
class UPoseSearchNormalizationSet final : public UDataAsset
{
public:
	TArray<class UPoseSearchDatabase*>            Databases;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchNormalizationSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchNormalizationSet")
	}
	static class UPoseSearchNormalizationSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchNormalizationSet>();
	}
};
DUMPER7_ASSERTS_UPoseSearchNormalizationSet;

// Class PoseSearch.PoseSearchSchema
// 0x0050 (0x0080 - 0x0030)
class UPoseSearchSchema final : public UDataAsset
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0030(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         SampleRate;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPoseSearchRoledSkeleton>       Skeletons;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UPoseSearchFeatureChannel*>      Channels;                                          // 0x0050(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UPoseSearchFeatureChannel*>      FinalizedChannels;                                 // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0070(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         SchemaCardinality;                                 // 0x0078(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddDataPadding;                                   // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInjectAdditionalDebugChannels;                    // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchSchema")
	}
	static class UPoseSearchSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchSchema>();
	}
};
DUMPER7_ASSERTS_UPoseSearchSchema;

// Class PoseSearch.PoseSearchTrajectoryLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchTrajectoryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DrawTransformTrajectory(const class UObject* WorldContextObject, const struct FTransformTrajectory& InTrajectory, const float DebugThickness, float HeightOffset);
	static void GetTransformTrajectoryAngularVelocity(const struct FTransformTrajectory& InTrajectory, float Time1, float Time2, struct FVector* OutAngularVelocity, bool bExtrapolate);
	static void GetTransformTrajectorySampleAtTime(const struct FTransformTrajectory& InTrajectory, float Time, struct FTransformTrajectorySample* OutTrajectorySample, bool bExtrapolate);
	static struct FTransform GetTransformTrajectorySampleTransform(const struct FTransformTrajectorySample& InTrajectorySample);
	static void GetTransformTrajectoryVelocity(const struct FTransformTrajectory& InTrajectory, float Time1, float Time2, struct FVector* OutVelocity, bool bExtrapolate);
	static void HandleTransformTrajectoryWorldCollisions(const class UObject* WorldContextObject, const class UAnimInstance* AnimInstance, const struct FTransformTrajectory& InTrajectory, bool bApplyGravity, float FloorCollisionsOffset, struct FTransformTrajectory* OutTrajectory, struct FPoseSearchTrajectory_WorldCollisionResults* CollisionResult, ETraceTypeQuery TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore, EDrawDebugTrace DrawDebugType, bool bIgnoreSelf, float MaxObstacleHeight, const struct FLinearColor& TraceColor, const struct FLinearColor& TraceHitColor, float DrawTime);
	static void HandleTransformTrajectoryWorldCollisionsWithGravity(const class UObject* WorldContextObject, const struct FTransformTrajectory& InTrajectory, const struct FVector& StartingVelocity, bool bApplyGravity, const struct FVector& GravityAccel, float FloorCollisionsOffset, struct FTransformTrajectory* OutTrajectory, struct FPoseSearchTrajectory_WorldCollisionResults* CollisionResult, ETraceTypeQuery TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore, EDrawDebugTrace DrawDebugType, bool bIgnoreSelf, float MaxObstacleHeight, const struct FLinearColor& TraceColor, const struct FLinearColor& TraceHitColor, float DrawTime);
	static void PoseSearchGeneratePredictorTransformTrajectory(class UObject* InPredictor, const struct FPoseSearchTrajectoryData& InTrajectoryData, float InDeltaTime, struct FTransformTrajectory& InOutTrajectory, float& InOutDesiredControllerYawLastUpdate, struct FTransformTrajectory* OutTrajectory, float InHistorySamplingInterval, int32 InTrajectoryHistoryCount, float InPredictionSamplingInterval, int32 InTrajectoryPredictionCount);
	static void PoseSearchGenerateTransformTrajectory(const class UObject* InAnimInstance, const struct FPoseSearchTrajectoryData& InTrajectoryData, float InDeltaTime, struct FTransformTrajectory& InOutTrajectory, float& InOutDesiredControllerYawLastUpdate, struct FTransformTrajectory* OutTrajectory, float InHistorySamplingInterval, int32 InTrajectoryHistoryCount, float InPredictionSamplingInterval, int32 InTrajectoryPredictionCount);
	static void PoseSearchGenerateTransformTrajectoryWithPredictor(TScriptInterface<class IPoseSearchTrajectoryPredictorInterface> InPredictor, float InDeltaTime, struct FTransformTrajectory& InOutTrajectory, float& InOutDesiredControllerYawLastUpdate, struct FTransformTrajectory* OutTrajectory, float InHistorySamplingInterval, int32 InTrajectoryHistoryCount, float InPredictionSamplingInterval, int32 InTrajectoryPredictionCount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchTrajectoryLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchTrajectoryLibrary")
	}
	static class UPoseSearchTrajectoryLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchTrajectoryLibrary>();
	}
};
DUMPER7_ASSERTS_UPoseSearchTrajectoryLibrary;

// Class PoseSearch.PoseSearchTrajectoryPredictorInterface
// 0x0000 (0x0000 - 0x0000)
class IPoseSearchTrajectoryPredictorInterface final
{
public:
	void GetCurrentState(struct FVector* OutPosition, struct FQuat* OutFacing, struct FVector* OutVelocity);
	void GetGravity(struct FVector* OutGravityAccel);
	void GetVelocity(struct FVector* OutVelocity);
	void Predict(struct FTransformTrajectory* InOutTrajectory, int32 NumPredictionSamples, float SecondsPerPredictionSample, int32 NumHistorySamples);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PoseSearchTrajectoryPredictorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PoseSearchTrajectoryPredictorInterface")
	}
	static class IPoseSearchTrajectoryPredictorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPoseSearchTrajectoryPredictorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPoseSearchTrajectoryPredictorInterface;

// Class PoseSearch.AnimNotifyState_PoseSearchBase
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchBase : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchBase")
	}
	static class UAnimNotifyState_PoseSearchBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchBase>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchBase;

// Class PoseSearch.AnimNotifyState_PoseSearchExcludeFromDatabase
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchExcludeFromDatabase final : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchExcludeFromDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchExcludeFromDatabase")
	}
	static class UAnimNotifyState_PoseSearchExcludeFromDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchExcludeFromDatabase>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchExcludeFromDatabase;

// Class PoseSearch.AnimNotifyState_PoseSearchBlockTransition
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchBlockTransition final : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchBlockTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchBlockTransition")
	}
	static class UAnimNotifyState_PoseSearchBlockTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchBlockTransition>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchBlockTransition;

// Class PoseSearch.AnimNotifyState_PoseSearchModifyCost
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_PoseSearchModifyCost final : public UAnimNotifyState_PoseSearchBase
{
public:
	float                                         CostAddend;                                        // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchModifyCost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchModifyCost")
	}
	static class UAnimNotifyState_PoseSearchModifyCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchModifyCost>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchModifyCost;

// Class PoseSearch.AnimNotifyState_PoseSearchOverrideContinuingPoseCostBias
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias final : public UAnimNotifyState_PoseSearchBase
{
public:
	float                                         CostAddend;                                        // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchOverrideContinuingPoseCostBias")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchOverrideContinuingPoseCostBias")
	}
	static class UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias;

// Class PoseSearch.AnimNotifyState_PoseSearchSamplingEvent
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchSamplingEvent : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_PoseSearchSamplingEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_PoseSearchSamplingEvent")
	}
	static class UAnimNotifyState_PoseSearchSamplingEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchSamplingEvent>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_PoseSearchSamplingEvent;

// Class PoseSearch.AnimNotifyState_PoseSearchSamplingAttribute
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchSamplingAttribute final : public UAnimNotifyState_PoseSearchSamplingEvent
{
public:
