#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFrameworkExtra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RedpointEOSFrameworkExtra_structs.hpp"


SDK_NAMESPACE_START

// Class RedpointEOSFrameworkExtra.RedpointAbilityBaseCharacter
// 0x0040 (0x0690 - 0x0650)
class ARedpointAbilityBaseCharacter : public ACharacter
{
public:
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           LastClientPlayerState;                             // 0x0650(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                VolatileAbilitySystem;                             // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayAbility>>   VolatileCharacterAbilities;                        // 0x0670(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            VolatileDefaultAttributes;                         // 0x0680(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityBaseCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityBaseCharacter")
	}
	static class ARedpointAbilityBaseCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointAbilityBaseCharacter>();
	}
};
DUMPER7_ASSERTS_ARedpointAbilityBaseCharacter;

// Class RedpointEOSFrameworkExtra.RedpointAbilityBaseGameplayAbility
// 0x0000 (0x03A8 - 0x03A8)
class URedpointAbilityBaseGameplayAbility final : public UGameplayAbility
{
public:
	void K2_ApplyCost(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilityActivationInfo& ActivationInfo) const;
	bool K2_CheckCost(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityBaseGameplayAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityBaseGameplayAbility")
	}
	static class URedpointAbilityBaseGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAbilityBaseGameplayAbility>();
	}
};
DUMPER7_ASSERTS_URedpointAbilityBaseGameplayAbility;

// Class RedpointEOSFrameworkExtra.RedpointAbilityBasePlayerState
// 0x0030 (0x0390 - 0x0360)
class ARedpointAbilityBasePlayerState : public APlayerState
{
public:
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<TSubclassOf<class UGameplayAbility>>   CharacterAbilities;                                // 0x0370(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            DefaultAttributes;                                 // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetGameplayAbilities();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityBasePlayerState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityBasePlayerState")
	}
	static class ARedpointAbilityBasePlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointAbilityBasePlayerState>();
	}
};
DUMPER7_ASSERTS_ARedpointAbilityBasePlayerState;

// Class RedpointEOSFrameworkExtra.RedpointAbilityCharacterBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URedpointAbilityCharacterBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FGameplayAbilitySpecHandle FindAbilitySpecHandleForClass(class UAbilitySystemComponent* AbilitySystem, TSubclassOf<class UGameplayAbility> AbilityClass, class UObject* OptionalSourceObject);
	static class UGameplayAbility* GetPrimaryAbilityInstanceFromClass(class UAbilitySystemComponent* AbilitySystemComponent, TSubclassOf<class UGameplayAbility> InAbilityClass);
	static class UGameplayAbility* GetPrimaryAbilityInstanceFromHandle(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAbilitySpecHandle& Handle);
	static bool IsAbilitySpecHandleValid(const struct FGameplayAbilitySpecHandle& Handle);
	static bool IsPrimaryAbilityInstanceActive(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAbilitySpecHandle& Handle);

	void ClearAbilityFromClass(class ARedpointAbilityBaseCharacter* Character, const struct FGameplayAbilitySpecHandle& Handle, bool* Success);
	void ClearAllAbilities(class ARedpointAbilityBaseCharacter* Character);
	void GiveAbilityFromClass(class ARedpointAbilityBaseCharacter* Character, TSubclassOf<class UGameplayAbility> AbilityClass, int32 Level, int32 InputIndex, struct FGameplayAbilitySpecHandle* Handle, bool* Success);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityCharacterBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityCharacterBlueprintLibrary")
	}
	static class URedpointAbilityCharacterBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAbilityCharacterBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_URedpointAbilityCharacterBlueprintLibrary;

// Class RedpointEOSFrameworkExtra.RedpointAbilityCharacterMovementComponent
// 0x0000 (0x0FD0 - 0x0FD0)
class URedpointAbilityCharacterMovementComponent final : public UCharacterMovementComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityCharacterMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityCharacterMovementComponent")
	}
	static class URedpointAbilityCharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAbilityCharacterMovementComponent>();
	}
};
DUMPER7_ASSERTS_URedpointAbilityCharacterMovementComponent;

// Class RedpointEOSFrameworkExtra.RedpointAbilityPlayerCharacter
// 0x0010 (0x06A0 - 0x0690)
class ARedpointAbilityPlayerCharacter final : public ARedpointAbilityBaseCharacter
{
public:
	uint8                                         Pad_690[0x10];                                     // 0x0690(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityPlayerCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityPlayerCharacter")
	}
	static class ARedpointAbilityPlayerCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointAbilityPlayerCharacter>();
	}
};
DUMPER7_ASSERTS_ARedpointAbilityPlayerCharacter;

// Class RedpointEOSFrameworkExtra.RedpointAbilityPlayerState
// 0x0048 (0x03D8 - 0x0390)
class ARedpointAbilityPlayerState final : public ARedpointAbilityBasePlayerState
{
public:
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class URedpointBackpackComponent*             Backpack;                                          // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetDash*              DashAttributeSet;                                  // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetHealth*            HealthAttributeSet;                                // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetInteract*          InteractAttributeSet;                              // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetJetpack*           JetpackAttributeSet;                               // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetMovement*          MovementAttributeSet;                              // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class URedpointAttributeSetStun*              StunAttributeSet;                                  // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityPlayerState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityPlayerState")
	}
	static class ARedpointAbilityPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointAbilityPlayerState>();
	}
};
DUMPER7_ASSERTS_ARedpointAbilityPlayerState;

// Class RedpointEOSFrameworkExtra.RedpointAbilityTask_WaitLanded
// 0x0018 (0x0098 - 0x0080)
class URedpointAbilityTask_WaitLanded final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnLanded;                           // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class URedpointAbilityTask_WaitLanded* CreateWaitLanded(class UGameplayAbility* OwningAbility);

	void HandleOnLanded(const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityTask_WaitLanded")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityTask_WaitLanded")
	}
	static class URedpointAbilityTask_WaitLanded* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAbilityTask_WaitLanded>();
	}
};
DUMPER7_ASSERTS_URedpointAbilityTask_WaitLanded;

// Class RedpointEOSFrameworkExtra.RedpointAbilityWithInputIdInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointAbilityWithInputIdInterface final
{
public:
	int32 GetAbilityInputId(class ARedpointBackpackItem* Item);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityWithInputIdInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityWithInputIdInterface")
	}
	static class IRedpointAbilityWithInputIdInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointAbilityWithInputIdInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointAbilityWithInputIdInterface;

// Class RedpointEOSFrameworkExtra.RedpointAbilityWithLevelInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointAbilityWithLevelInterface final
{
public:
	int32 GetAbilityLevel(class ARedpointBackpackItem* Item);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAbilityWithLevelInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAbilityWithLevelInterface")
	}
	static class IRedpointAbilityWithLevelInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointAbilityWithLevelInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointAbilityWithLevelInterface;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetBase
// 0x0000 (0x0030 - 0x0030)
class URedpointAttributeSetBase : public UAttributeSet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetBase")
	}
	static class URedpointAttributeSetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetBase>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetBase;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetDash
// 0x0020 (0x0050 - 0x0030)
class URedpointAttributeSetDash final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 DashLengthTime;                                    // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 DashStrength;                                      // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_DashLengthTime(const struct FGameplayAttributeData& OldValue);
	void OnRep_DashStrength(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetDash")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetDash")
	}
	static class URedpointAttributeSetDash* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetDash>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetDash;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetDestructablePoints
// 0x0040 (0x0070 - 0x0030)
class URedpointAttributeSetDestructablePoints final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 TotalPointsForDestruction;                         // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 FinalHitPointsForDestruction;                      // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 TotalPointsDroppedOnDestruction;                   // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 PointsForRecoveryToExitAfterStun;                  // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_FinalHitPointsForDestruction(const struct FGameplayAttributeData& OldValue);
	void OnRep_PointsForRecoveryToExitAfterStun(const struct FGameplayAttributeData& OldValue);
	void OnRep_TotalPointsDroppedOnDestruction(const struct FGameplayAttributeData& OldValue);
	void OnRep_TotalPointsForDestruction(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetDestructablePoints")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetDestructablePoints")
	}
	static class URedpointAttributeSetDestructablePoints* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetDestructablePoints>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetDestructablePoints;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetHealth
// 0x0060 (0x0090 - 0x0030)
class URedpointAttributeSetHealth final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 CurrentHealth;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 MaximumHealth;                                     // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HealthRegenDelay;                                  // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HealthRegenAmount;                                 // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 HealthRegenAmountModifier;                         // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Damage;                                            // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void OnRep_CurrentHealth(const struct FGameplayAttributeData& OldValue);
	void OnRep_HealthRegenAmount(const struct FGameplayAttributeData& OldValue);
	void OnRep_HealthRegenAmountModifier(const struct FGameplayAttributeData& OldValue);
	void OnRep_HealthRegenDelay(const struct FGameplayAttributeData& OldValue);
	void OnRep_MaximumHealth(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetHealth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetHealth")
	}
	static class URedpointAttributeSetHealth* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetHealth>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetHealth;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetInteract
// 0x0010 (0x0040 - 0x0030)
class URedpointAttributeSetInteract final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 InteractDistance;                                  // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_InteractDistance(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetInteract")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetInteract")
	}
	static class URedpointAttributeSetInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetInteract>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetInteract;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetJetpack
// 0x0020 (0x0050 - 0x0030)
class URedpointAttributeSetJetpack final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 JetpackLengthTime;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 JetpackStrength;                                   // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_JetpackLengthTime(const struct FGameplayAttributeData& OldValue);
	void OnRep_JetpackStrength(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetJetpack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetJetpack")
	}
	static class URedpointAttributeSetJetpack* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetJetpack>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetJetpack;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetMovement
// 0x0010 (0x0040 - 0x0030)
class URedpointAttributeSetMovement final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 MovementSpeed;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_MovementSpeed(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetMovement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetMovement")
	}
	static class URedpointAttributeSetMovement* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetMovement>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetMovement;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetReserveAmmo
// 0x0020 (0x0050 - 0x0030)
class URedpointAttributeSetReserveAmmo final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 CurrentReserveAmmo;                                // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 MaximumReserveAmmo;                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_CurrentReserveAmmo(const struct FGameplayAttributeData& OldValue);
	void OnRep_MaximumReserveAmmo(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetReserveAmmo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetReserveAmmo")
	}
	static class URedpointAttributeSetReserveAmmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetReserveAmmo>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetReserveAmmo;

// Class RedpointEOSFrameworkExtra.RedpointAttributeSetStun
// 0x0020 (0x0050 - 0x0030)
class URedpointAttributeSetStun final : public URedpointAttributeSetBase
{
public:
	struct FGameplayAttributeData                 StunTime;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 StunRecoveryHealthAmount;                          // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_StunRecoveryHealthAmount(const struct FGameplayAttributeData& OldValue);
	void OnRep_StunTime(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAttributeSetStun")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAttributeSetStun")
	}
	static class URedpointAttributeSetStun* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAttributeSetStun>();
	}
};
DUMPER7_ASSERTS_URedpointAttributeSetStun;

// Class RedpointEOSFrameworkExtra.RedpointBackpackComponent
// 0x0068 (0x0120 - 0x00B8)
class URedpointBackpackComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRedpointBackpackLoadoutEntry>  Loadout;                                           // 0x00C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         SlotCount;                                         // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARedpointBackpackItem*>          Items;                                             // 0x00E0(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class ARedpointBackpackItem*                  CurrentItem;                                       // 0x00F0(0x0008)(Edit, Net, ZeroConstructor, EditConst, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TDelegate<void(class ARedpointBackpackItem* Item)> OnDropItemRequested;                          // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DropAllItems(bool bForce);
	bool DropItem(class ARedpointBackpackItem* Item);
	class ARedpointBackpackItem* GetCurrentItem();
	int32 GetItemCount();
	int32 GetItemIndex(class ARedpointBackpackItem* Item);
	class ARedpointBackpackItem* GetItemInSlot(int32 InSlot);
	int32 GetSlotCount();
	void OnRep_CurrentItem(class ARedpointBackpackItem* PreviousItem);
	void OnRep_Items();
	bool PickupItem(class ARedpointBackpackItem* Item);
	void RequestItemEquipOnServer(class ARedpointBackpackItem* NewItem);
	void SelectNextItem();
	void SelectPreviousItem();
	void SyncCurrentItemToClient(class ARedpointBackpackItem* InItem);
	void SyncCurrentItemToServer();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointBackpackComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointBackpackComponent")
	}
	static class URedpointBackpackComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointBackpackComponent>();
	}
};
DUMPER7_ASSERTS_URedpointBackpackComponent;

// Class RedpointEOSFrameworkExtra.RedpointBackpackItem
// 0x0108 (0x03B0 - 0x02A8)
class ARedpointBackpackItem final : public AActor
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCapsuleComponent*                      CollisionComp;                                     // 0x02C0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USkeletalMeshComponent*                 ItemMesh1P;                                        // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USkeletalMeshComponent*                 ItemMesh3P;                                        // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FVector                                ItemMesh3PickupRelativeLocation;                   // 0x02D8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ItemMesh1PEquippedRelativeLocation;                // 0x02F0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               ItemMesh1PEquippedRelativeRotation;                // 0x0308(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                ItemMesh3PEquippedRelativeLocation;                // 0x0320(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               ItemMesh3PEquippedRelativeRotation;                // 0x0338(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 OwningActor;                                       // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<TSubclassOf<class UGameplayAbility>>   Abilities;                                         // 0x0358(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FGameplayAbilitySpecHandle>     AbilitySpecHandles;                                // 0x0368(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAnimMontage*                           Equip1PMontage;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAnimMontage*                           Equip3PMontage;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USoundCue*                              PickupSound;                                       // 0x0388(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bIsWeapon;                                         // 0x0390(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           WeaponFiringTag;                                   // 0x0394(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             WeaponClipIcon;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         WeaponCurrentClipAmmo;                             // 0x03A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WeaponMaximumClipAmmo;                             // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnRep_WeaponCurrentClipAmmo(int32 OldValue);
	void OnRep_WeaponMaximumClipAmmo(int32 OldValue);
	void SetWeaponCurrentClipAmmo(int32 CurrentAmmo);
	void SetWeaponMaximumClipAmmo(int32 MaximumAmmo);

	class USkeletalMeshComponent* GetItemMesh1P() const;
	class USkeletalMeshComponent* GetItemMesh3P() const;
	int32 GetWeaponCurrentClipAmmo() const;
	int32 GetWeaponMaximumClipAmmo() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointBackpackItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointBackpackItem")
	}
	static class ARedpointBackpackItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointBackpackItem>();
	}
};
DUMPER7_ASSERTS_ARedpointBackpackItem;

// Class RedpointEOSFrameworkExtra.RedpointBackpackItemAttachmentInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointBackpackItemAttachmentInterface final
{
public:
	class FName GetAttachmentPoint();
	class USkeletalMeshComponent* GetFirstPersonMesh();
	class USkeletalMeshComponent* GetThirdPersonMesh();
	bool IsInFirstPersonPerspective();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointBackpackItemAttachmentInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointBackpackItemAttachmentInterface")
	}
	static class IRedpointBackpackItemAttachmentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointBackpackItemAttachmentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointBackpackItemAttachmentInterface;

// Class RedpointEOSFrameworkExtra.RedpointBackpackItemNotificationInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointBackpackItemNotificationInterface final
{
public:
	void OnItemChanged(class ARedpointBackpackItem* NewItem, class ARedpointBackpackItem* PreviousItem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointBackpackItemNotificationInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointBackpackItemNotificationInterface")
	}
	static class IRedpointBackpackItemNotificationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointBackpackItemNotificationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointBackpackItemNotificationInterface;

// Class RedpointEOSFrameworkExtra.RedpointConsoleCommand
// 0x0028 (0x0050 - 0x0028)
class URedpointConsoleCommand final : public UObject
{
public:
	class FString                                 CommandName;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HelpText;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCommand(const TArray<class FString>& Arguments);
	void OutputString(ERedpointConsoleCommandLogVerbosity Verbosity, const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointConsoleCommand")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointConsoleCommand")
	}
	static class URedpointConsoleCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointConsoleCommand>();
	}
};
DUMPER7_ASSERTS_URedpointConsoleCommand;

// Class RedpointEOSFrameworkExtra.RedpointConsoleGameInstanceSubsystem
// 0x0050 (0x0080 - 0x0030)
class URedpointConsoleGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	TMap<class FString, class URedpointConsoleCommand*> CommandsRegistered;                          // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointConsoleGameInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointConsoleGameInstanceSubsystem")
	}
	static class URedpointConsoleGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointConsoleGameInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointConsoleGameInstanceSubsystem;

// Class RedpointEOSFrameworkExtra.RedpointDamageNotificationInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointDamageNotificationInterface final
{
public:
	void OnDealtDamageToTarget(int32 DamageDealt, class AActor* TargetActor);
	void OnKilledTargetActor(class UAbilitySystemComponent* SourceAbilitySystem, class AActor* TargetActor, class UAbilitySystemComponent* TargetAbilitySystem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointDamageNotificationInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointDamageNotificationInterface")
	}
	static class IRedpointDamageNotificationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointDamageNotificationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointDamageNotificationInterface;

// Class RedpointEOSFrameworkExtra.RedpointFrameworkExtraBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URedpointFrameworkExtraBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TMap<class FString, class FString> GetAllUserAttributes(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& TargetUserId);
	static void InduceStutter(float Seconds);
	static void RestartLevel(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFrameworkExtraBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFrameworkExtraBlueprintLibrary")
	}
	static class URedpointFrameworkExtraBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFrameworkExtraBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_URedpointFrameworkExtraBlueprintLibrary;

// Class RedpointEOSFrameworkExtra.RedpointHasBackpackInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointHasBackpackInterface final
{
public:
	class URedpointBackpackComponent* GetBackpack();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointHasBackpackInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointHasBackpackInterface")
	}
	static class IRedpointHasBackpackInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointHasBackpackInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointHasBackpackInterface;

// Class RedpointEOSFrameworkExtra.RedpointIsAliveInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointIsAliveInterface final
{
public:
	bool IsAlive();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointIsAliveInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointIsAliveInterface")
	}
	static class IRedpointIsAliveInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointIsAliveInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointIsAliveInterface;

// Class RedpointEOSFrameworkExtra.RedpointOverridesMaxSpeedInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointOverridesMaxSpeedInterface final
{
public:
	float GetMaxSpeed();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointOverridesMaxSpeedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointOverridesMaxSpeedInterface")
	}
	static class IRedpointOverridesMaxSpeedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointOverridesMaxSpeedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointOverridesMaxSpeedInterface;

// Class RedpointEOSFrameworkExtra.RedpointStarterCharacter
// 0x0010 (0x0660 - 0x0650)
class ARedpointStarterCharacter final : public ACharacter
{
public:
	class UStaticMeshComponent*                   Sphere;                                            // 0x0648(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCameraComponent*                       Camera;                                            // 0x0650(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterCharacter")
	}
	static class ARedpointStarterCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointStarterCharacter>();
	}
};
DUMPER7_ASSERTS_ARedpointStarterCharacter;

// Class RedpointEOSFrameworkExtra.RedpointStarterGameMode
// 0x0000 (0x0340 - 0x0340)
class ARedpointStarterGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterGameMode")
	}
	static class ARedpointStarterGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointStarterGameMode>();
	}
};
DUMPER7_ASSERTS_ARedpointStarterGameMode;

// Class RedpointEOSFrameworkExtra.RedpointStarterInputMappingContext
// 0x0000 (0x00A8 - 0x00A8)
class URedpointStarterInputMappingContext final : public UInputMappingContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterInputMappingContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterInputMappingContext")
	}
	static class URedpointStarterInputMappingContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointStarterInputMappingContext>();
	}
};
DUMPER7_ASSERTS_URedpointStarterInputMappingContext;

// Class RedpointEOSFrameworkExtra.RedpointStarterJumpAction
// 0x0000 (0x0078 - 0x0078)
class URedpointStarterJumpAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterJumpAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterJumpAction")
	}
	static class URedpointStarterJumpAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointStarterJumpAction>();
	}
};
DUMPER7_ASSERTS_URedpointStarterJumpAction;

// Class RedpointEOSFrameworkExtra.RedpointStarterMoveAction
// 0x0000 (0x0078 - 0x0078)
class URedpointStarterMoveAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterMoveAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterMoveAction")
	}
	static class URedpointStarterMoveAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointStarterMoveAction>();
	}
};
DUMPER7_ASSERTS_URedpointStarterMoveAction;

// Class RedpointEOSFrameworkExtra.RedpointStarterPlayerController
// 0x0080 (0x07B8 - 0x0738)
class ARedpointStarterPlayerController final : public APlayerController
{
public:
	TSoftObjectPtr<class UInputAction>            MoveAction;                                        // 0x0738(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            JumpAction;                                        // 0x0760(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputMappingContext>    InputMappingContext;                               // 0x0788(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipInputMappingContext;                          // 0x07B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStarterPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStarterPlayerController")
	}
	static class ARedpointStarterPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointStarterPlayerController>();
	}
};
DUMPER7_ASSERTS_ARedpointStarterPlayerController;

SDK_NAMESPACE_END
