#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSAuth

#include "Basic.hpp"

#include "RedpointEOSAuth_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function RedpointEOSAuth.EOSUserInterface_EnterDevicePinCode.SetupUserInterface
// 0x0028 (0x0028 - 0x0000)
struct EOSUserInterface_EnterDevicePinCode_SetupUserInterface final
{
public:
	class UEOSUserInterface_EnterDevicePinCode_Context* Context;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VerificationUrl;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PinCode;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EOSUserInterface_EnterDevicePinCode_SetupUserInterface;

// Function RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount.SetupUserInterface
// 0x0008 (0x0008 - 0x0000)
struct EOSUserInterface_SignInOrCreateAccount_SetupUserInterface final
{
public:
	class UEOSUserInterface_SignInOrCreateAccount_Context* Context;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EOSUserInterface_SignInOrCreateAccount_SetupUserInterface;

// Function RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount_Context.SelectChoice
// 0x0001 (0x0001 - 0x0000)
struct EOSUserInterface_SignInOrCreateAccount_Context_SelectChoice final
{
public:
	EEOSUserInterface_SignInOrCreateAccount_Choice SelectedChoice;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EOSUserInterface_SignInOrCreateAccount_Context_SelectChoice;

// Function RedpointEOSAuth.RedpointEOSAuthWidgetFactory.ConstructAuthWidget
// 0x0018 (0x0018 - 0x0000)
struct RedpointEOSAuthWidgetFactory_ConstructAuthWidget final
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalUserNum;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointEOSAuthWidgetFactory_ConstructAuthWidget;

// Function RedpointEOSAuth.RedpointEOSAuthWidgetFactory.DestructAuthWidget
// 0x0008 (0x0008 - 0x0000)
struct RedpointEOSAuthWidgetFactory_DestructAuthWidget final
{
public:
	class UUserWidget*                            AuthWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointEOSAuthWidgetFactory_DestructAuthWidget;

// Function RedpointEOSAuth.RedpointEOSAuthWidgetFactory.PresentAuthWidget
// 0x0010 (0x0010 - 0x0000)
struct RedpointEOSAuthWidgetFactory_PresentAuthWidget final
{
public:
	class UUserWidget*                            AuthWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalUserNum;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointEOSAuthWidgetFactory_PresentAuthWidget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
