#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum RedpointEOSFramework.ERedpointSquareBoxAxis
// NumValues: 0x0003
enum class ERedpointSquareBoxAxis : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	ERedpointSquareBoxAxis_MAX               = 2,
};

// Enum RedpointEOSFramework.ERedpointAvatarLoadingIndicator
// NumValues: 0x0004
enum class ERedpointAvatarLoadingIndicator : uint8
{
	None                                     = 0,
	Throbber                                 = 1,
	DefaultTexture                           = 2,
	ERedpointAvatarLoadingIndicator_MAX      = 3,
};

// Enum RedpointEOSFramework.ERedpointFriendListEntryInviteStatus
// NumValues: 0x0006
enum class ERedpointFriendListEntryInviteStatus : uint8
{
	Unknown                                  = 0,
	MutualFriends                            = 1,
	PendingInbound                           = 2,
	PendingOutbound                          = 3,
	Unrelated                                = 4,
	ERedpointFriendListEntryInviteStatus_MAX = 5,
};

// Enum RedpointEOSFramework.ERedpointFriendListEntryPresenceStatus
// NumValues: 0x0006
enum class ERedpointFriendListEntryPresenceStatus : uint8
{
	Unknown                                  = 0,
	Offline                                  = 1,
	DoNotDisturb                             = 2,
	Idle                                     = 3,
	Online                                   = 4,
	ERedpointFriendListEntryPresenceStatus_MAX = 5,
};

// Enum RedpointEOSFramework.ERedpointFriendListSectionType
// NumValues: 0x0007
enum class ERedpointFriendListSectionType : uint8
{
	InParty                                  = 0,
	InGame                                   = 1,
	Online                                   = 2,
	Offline                                  = 3,
	Recent                                   = 4,
	Blocked                                  = 5,
	ERedpointFriendListSectionType_MAX       = 6,
};

// Enum RedpointEOSFramework.ERedpointPartyAttributeType
// NumValues: 0x0005
enum class ERedpointPartyAttributeType : uint8
{
	String                                   = 0,
	Int64                                    = 1,
	Double                                   = 2,
	Bool                                     = 3,
	ERedpointPartyAttributeType_MAX          = 4,
};

// Enum RedpointEOSFramework.ERedpointVoiceChatAudioFeature
// NumValues: 0x0006
enum class ERedpointVoiceChatAudioFeature : uint8
{
	EchoCancellation                         = 0,
	NoiseSuppression                         = 1,
	AutoGainControl                          = 2,
	DiscontinousTransmission                 = 3,
	PlatformAcousticEchoCancellation         = 4,
	ERedpointVoiceChatAudioFeature_MAX       = 5,
};

// Enum RedpointEOSFramework.ERedpointVoiceChatProximityType
// NumValues: 0x0004
enum class ERedpointVoiceChatProximityType : uint8
{
	None                                     = 0,
	PossessedPawn                            = 1,
	Custom                                   = 2,
	ERedpointVoiceChatProximityType_MAX      = 3,
};

// ScriptStruct RedpointEOSFramework.RedpointAvatarCacheEntry
// 0x0018 (0x0018 - 0x0000)
struct FRedpointAvatarCacheEntry final
{
public:
	class UTexture*                               Avatar;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FDateTime                              ExpiresAt;                                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFetchInProgress;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFailed;                                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRedpointAvatarCacheEntry;

// ScriptStruct RedpointEOSFramework.RedpointPartyAttributeValue
// 0x0030 (0x0030 - 0x0000)
struct FRedpointPartyAttributeValue final
{
public:
	ERedpointPartyAttributeType                   Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         int64_0;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Double;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bool;                                              // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRedpointPartyAttributeValue;

// ScriptStruct RedpointEOSFramework.RedpointPartyMemberInfo
// 0x00F0 (0x00F0 - 0x0000)
struct FRedpointPartyMemberInfo final
{
public:
	bool                                          bHasPartyMember;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 playerName;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PlayerUserAttributes;                              // 0x0048(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRedpointPartyAttributeValue> PartyMemberAttributes;                  // 0x0098(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bIsPartyLeader;                                    // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRedpointPartyMemberInfo;

// ScriptStruct RedpointEOSFramework.RedpointTreeViewFriendListState
// 0x0060 (0x0060 - 0x0000)
struct FRedpointTreeViewFriendListState final
{
public:
	TArray<ERedpointFriendListSectionType>        SectionTypes;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<ERedpointFriendListSectionType, class URedpointFriendListSection*> FriendSections;          // 0x0010(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FRedpointTreeViewFriendListState;

// ScriptStruct RedpointEOSFramework.RedpointVoiceChatAudioDevice
// 0x0028 (0x0028 - 0x0000)
struct FRedpointVoiceChatAudioDevice final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInputDevice;                                    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRedpointVoiceChatAudioDevice;

// ScriptStruct RedpointEOSFramework.RedpointVoiceChatChannelConnection
// 0x0048 (0x0048 - 0x0000)
struct FRedpointVoiceChatChannelConnection final
{
public:
	bool                                          bIsUnmanagedChannel;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ManagedChannelLobbyId;                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnmanagedChannelBaseUrl;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnmanagedChannelName;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnmanagedChannelAuthenticationToken;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRedpointVoiceChatChannelConnection;

SDK_NAMESPACE_END
