#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RedpointEOSFramework_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class RedpointEOSFramework.RedpointAvatar
// 0x0140 (0x0480 - 0x0340)
class alignas(0x10) URedpointAvatar final : public UUserWidget
{
public:
	bool                                          bTargetUserIsLocalUser;                            // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0348(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               DefaultTexture;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	ERedpointAvatarLoadingIndicator               LoadingIndicator;                                  // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExpirationMinutes;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0xF0];                                     // 0x0390(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointAvatar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointAvatar")
	}
	static class URedpointAvatar* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointAvatar>();
	}
};
DUMPER7_ASSERTS_URedpointAvatar;

// Class RedpointEOSFramework.RedpointBlockVoiceChatMemberAsyncAction
// 0x0048 (0x0078 - 0x0030)
class URedpointBlockVoiceChatMemberAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bSuccessful)> OnComplete;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointVoiceChatComponent*            VoiceChatComponent;                                // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0048(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class URedpointBlockVoiceChatMemberAsyncAction* BlockMember(class URedpointVoiceChatComponent* VoiceChatComponent_0, const struct FUniqueNetIdRepl& OtherMemberId_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointBlockVoiceChatMemberAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointBlockVoiceChatMemberAsyncAction")
	}
	static class URedpointBlockVoiceChatMemberAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointBlockVoiceChatMemberAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointBlockVoiceChatMemberAsyncAction;

// Class RedpointEOSFramework.RedpointDefaultStartupScreen
// 0x0500 (0x0840 - 0x0340)
class alignas(0x10) URedpointDefaultStartupScreen final : public UUserWidget
{
public:
	uint8                                         Pad_340[0x3D8];                                    // 0x0340(0x03D8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         MessageFont;                                       // 0x0718(0x0060)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         NoteFont;                                          // 0x0778(0x0060)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         RegularFont;                                       // 0x07D8(0x0060)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointDefaultStartupScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointDefaultStartupScreen")
	}
	static class URedpointDefaultStartupScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointDefaultStartupScreen>();
	}
};
DUMPER7_ASSERTS_URedpointDefaultStartupScreen;

// Class RedpointEOSFramework.RedpointFrameworkBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URedpointFrameworkBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FRedpointVoiceChatAudioDevice> GetAvailableVoiceChatAudioDevices(class UObject* WorldContextObject);
	static class AGameSession* GetGameSession(class AGameModeBase* GameMode);
	static class FString GetInputPlatformAndPlayerDebugState(class UObject* WorldContextObject);
	static struct FRedpointVoiceChatAudioDevice GetVoiceChatAudioInputDevice(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId);
	static struct FRedpointVoiceChatAudioDevice GetVoiceChatAudioOutputDevice(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId);
	static bool IsGlobalVoiceChatAudioFeatureEnabled(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId, ERedpointVoiceChatAudioFeature AudioFeature);
	static bool IsPlayerControllerSpectating(class APlayerController* PlayerController);
	static bool IsPlayInEditor();
	static bool IsRedpointFrameworkFreeEdition();
	static bool KickPlayerController(class APlayerController* PlayerController, const class FText& KickReason);
	static void SetGlobalVoiceChatAudioFeatureEnabled(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId, ERedpointVoiceChatAudioFeature AudioFeature, bool bEnabled);
	static void SetListViewEntrySpacing(class UListView* InListView, float InEntrySpacing);
	static void SetPlayerControllerSpectating(class APlayerController* PlayerController, bool bIsSpectating);
	static void SetVoiceChatAudioInputDevice(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId, const class FString& DeviceID);
	static void SetVoiceChatAudioOutputDevice(class UObject* WorldContextObject, const struct FUniqueNetIdRepl& PlayerId, const class FString& DeviceID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFrameworkBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFrameworkBlueprintLibrary")
	}
	static class URedpointFrameworkBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFrameworkBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_URedpointFrameworkBlueprintLibrary;

// Class RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem
// 0x00B0 (0x00E0 - 0x0030)
class URedpointFrameworkLocalPlayerSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class URedpointFriendListEntry*> FriendEntries;                              // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bDisplayCachedPlatformFriends;                     // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeLocalPlayerInPartySection;                 // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x56];                                      // 0x008A(0x0056)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindFriendListSections(class UTreeView* TreeView, const TArray<ERedpointFriendListSectionType>& Sections);
	void SetDisplayCachedPlatformFriends(bool bEnabled);
	void SetIncludeLocalPlayerInPartySection(bool bEnabled);
	void UnbindFriendListSections(class UTreeView* TreeView);

	class UParty* GetPrimaryParty() const;
	bool IsPrimaryPartyLeader() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFrameworkLocalPlayerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFrameworkLocalPlayerSubsystem")
	}
	static class URedpointFrameworkLocalPlayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFrameworkLocalPlayerSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointFrameworkLocalPlayerSubsystem;

// Class RedpointEOSFramework.RedpointFrameworkSubsystem
// 0x0060 (0x0090 - 0x0030)
class URedpointFrameworkSubsystem final : public UGameInstanceSubsystem
{
public:
	bool                                          bEnsureAlwaysInParty;                              // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyMaximumSize;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVoiceChatInParty;                           // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUniqueNetIdRepl, struct FRedpointAvatarCacheEntry> AvatarCache;                     // 0x0040(0x0050)(NativeAccessSpecifierPrivate)

public:
	class UTexture* FetchAvatar(const struct FUniqueNetIdRepl& LocalUserId, const struct FUniqueNetIdRepl& TargetUserId, const struct FTimespan& Expiration, bool* bOutHasFailed);

	class FString GetReleaseVersion() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFrameworkSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFrameworkSubsystem")
	}
	static class URedpointFrameworkSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFrameworkSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointFrameworkSubsystem;

// Class RedpointEOSFramework.RedpointFriendListAcceptFriendRequestAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListAcceptFriendRequestAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListAcceptFriendRequestAsyncAction* AcceptFriendRequest(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListAcceptFriendRequestAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListAcceptFriendRequestAsyncAction")
	}
	static class URedpointFriendListAcceptFriendRequestAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListAcceptFriendRequestAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListAcceptFriendRequestAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListBlockPlayerAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListBlockPlayerAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListBlockPlayerAsyncAction* BlockPlayer(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListBlockPlayerAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListBlockPlayerAsyncAction")
	}
	static class URedpointFriendListBlockPlayerAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListBlockPlayerAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListBlockPlayerAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListEntry
// 0x0080 (0x00A8 - 0x0028)
class URedpointFriendListEntry final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           BoundForLocalPlayer;                               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bHasGameProfile;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0040(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInParty;                                          // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInGame;                                           // 0x0081(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInvitableToParty;                               // 0x0082(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInvitableToGame;                                // 0x0083(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x3];                                       // 0x0084(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ERedpointFriendListEntryInviteStatus          InviteStatus;                                      // 0x0087(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERedpointFriendListEntryPresenceStatus        PresenceStatus;                                    // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PresenceStatusText;                                // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                          bPlayingThisGame;                                  // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGameFriend;                                     // 0x00A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBeingActedUpon;                                 // 0x00A2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlocked;                                        // 0x00A3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRecent;                                         // 0x00A4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInJoinableParty;                                  // 0x00A5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInJoinableGame;                                   // 0x00A6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanAcceptFriendRequest() const;
	bool CanBlockPlayer() const;
	bool CanInviteToGame() const;
	bool CanInviteToParty() const;
	bool CanJoinGame() const;
	bool CanJoinParty() const;
	bool CanKickFromParty() const;
	bool CanLeaveParty() const;
	bool CanPromoteToPartyLeader() const;
	bool CanRejectFriendRequest() const;
	bool CanRemoveFriend() const;
	bool CanSendFriendRequest() const;
	bool CanUnblockPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListEntry")
	}
	static class URedpointFriendListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListEntry>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListEntry;

// Class RedpointEOSFramework.RedpointFriendListInviteToGameAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListInviteToGameAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListInviteToGameAsyncAction* InviteToGame(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListInviteToGameAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListInviteToGameAsyncAction")
	}
	static class URedpointFriendListInviteToGameAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListInviteToGameAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListInviteToGameAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListInviteToPartyAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListInviteToPartyAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListInviteToPartyAsyncAction* InviteToParty(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListInviteToPartyAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListInviteToPartyAsyncAction")
	}
	static class URedpointFriendListInviteToPartyAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListInviteToPartyAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListInviteToPartyAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListJoinGameAsyncAction
// 0x0020 (0x0050 - 0x0030)
class URedpointFriendListJoinGameAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class URedpointFriendListJoinGameAsyncAction* JoinGame(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListJoinGameAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListJoinGameAsyncAction")
	}
	static class URedpointFriendListJoinGameAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListJoinGameAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListJoinGameAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListJoinPartyAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListJoinPartyAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListJoinPartyAsyncAction* JoinParty(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListJoinPartyAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListJoinPartyAsyncAction")
	}
	static class URedpointFriendListJoinPartyAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListJoinPartyAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListJoinPartyAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListKickFromPartyAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListKickFromPartyAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListKickFromPartyAsyncAction* KickFromParty(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListKickFromPartyAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListKickFromPartyAsyncAction")
	}
	static class URedpointFriendListKickFromPartyAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListKickFromPartyAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListKickFromPartyAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListLeavePartyAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListLeavePartyAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListLeavePartyAsyncAction* LeaveParty(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListLeavePartyAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListLeavePartyAsyncAction")
	}
	static class URedpointFriendListLeavePartyAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListLeavePartyAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListLeavePartyAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListPromoteInPartyAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListPromoteInPartyAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListPromoteInPartyAsyncAction* PromoteInParty(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListPromoteInPartyAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListPromoteInPartyAsyncAction")
	}
	static class URedpointFriendListPromoteInPartyAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListPromoteInPartyAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListPromoteInPartyAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListRejectFriendRequestAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListRejectFriendRequestAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListRejectFriendRequestAsyncAction* RejectFriendRequest(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListRejectFriendRequestAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListRejectFriendRequestAsyncAction")
	}
	static class URedpointFriendListRejectFriendRequestAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListRejectFriendRequestAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListRejectFriendRequestAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListRemoveFriendAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListRemoveFriendAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListRemoveFriendAsyncAction* RemoveFriend(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListRemoveFriendAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListRemoveFriendAsyncAction")
	}
	static class URedpointFriendListRemoveFriendAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListRemoveFriendAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListRemoveFriendAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListSection
// 0x0030 (0x0058 - 0x0028)
class URedpointFriendListSection final : public UObject
{
public:
	ERedpointFriendListSectionType                Type;                                              // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   title;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                          bRequiresInit;                                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URedpointFriendListEntry*>       Entries;                                           // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	bool HasAnyEntries() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListSection")
	}
	static class URedpointFriendListSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListSection>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListSection;

// Class RedpointEOSFramework.RedpointFriendListSendFriendRequestAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListSendFriendRequestAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListSendFriendRequestAsyncAction* SendFriendRequest(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListSendFriendRequestAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListSendFriendRequestAsyncAction")
	}
	static class URedpointFriendListSendFriendRequestAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListSendFriendRequestAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListSendFriendRequestAsyncAction;

// Class RedpointEOSFramework.RedpointFriendListUnblockPlayerAsyncAction
// 0x0018 (0x0048 - 0x0030)
class URedpointFriendListUnblockPlayerAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointFriendListEntry*               Entry;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class URedpointFriendListUnblockPlayerAsyncAction* UnblockPlayer(class URedpointFriendListEntry* FriendListEntry);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointFriendListUnblockPlayerAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointFriendListUnblockPlayerAsyncAction")
	}
	static class URedpointFriendListUnblockPlayerAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointFriendListUnblockPlayerAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointFriendListUnblockPlayerAsyncAction;

// Class RedpointEOSFramework.RedpointGameInstance
// 0x0068 (0x0228 - 0x01C0)
class URedpointGameInstance : public UGameInstance
{
public:
	bool                                          bEnsureAlwaysSignedIn;                             // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         StartupScreen;                                     // 0x01C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               StartupScreenLogo;                                 // 0x01E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector2D                              StartupScreenLogoSize;                             // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UOnlineSession>             OnlineSessionClass;                                // 0x0200(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            StartupScreenWidget;                               // 0x0208(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_210[0x18];                                     // 0x0210(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UUserWidget* ConstructStartupScreen(TSubclassOf<class UUserWidget> StartupScreenWidgetClass);
	void OnStartLogin();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointGameInstance")
	}
	static class URedpointGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointGameInstance>();
	}
};
DUMPER7_ASSERTS_URedpointGameInstance;

// Class RedpointEOSFramework.RedpointGameSession
// 0x0068 (0x0338 - 0x02D0)
class ARedpointGameSession final : public AGameSession
{
public:
	uint8                                         Pad_2D0[0x60];                                     // 0x02D0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeAnonymousPlayers;                          // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartAndEndSessionAutomatically;                  // 0x0331(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HoldPlayer(const struct FUniqueNetIdRepl& PlayerId);
	void ReleasePlayer(const struct FUniqueNetIdRepl& PlayerId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointGameSession")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointGameSession")
	}
	static class ARedpointGameSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointGameSession>();
	}
};
DUMPER7_ASSERTS_ARedpointGameSession;

// Class RedpointEOSFramework.RedpointNotifyUniqueIdInterface
// 0x0000 (0x0000 - 0x0000)
class IRedpointNotifyUniqueIdInterface final
{
public:
	void NotifyUniqueNetIdSet(class APlayerState* PlayerState, const struct FUniqueNetIdRepl& UniqueID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointNotifyUniqueIdInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointNotifyUniqueIdInterface")
	}
	static class IRedpointNotifyUniqueIdInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointNotifyUniqueIdInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointNotifyUniqueIdInterface;

// Class RedpointEOSFramework.RedpointPartyMember
// 0x0048 (0x02F0 - 0x02A8)
class ARedpointPartyMember final : public AActor
{
public:
	uint8                                         Pad_2A8[0x40];                                     // 0x02A8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartyMemberSlot;                                   // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PartyMemberChanged(const struct FRedpointPartyMemberInfo& PartyMember);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointPartyMember")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointPartyMember")
	}
	static class ARedpointPartyMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointPartyMember>();
	}
};
DUMPER7_ASSERTS_ARedpointPartyMember;

// Class RedpointEOSFramework.RedpointSquareBox
// 0x0028 (0x01A8 - 0x0180)
class URedpointSquareBox final : public UContentWidget
{
public:
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ERedpointSquareBoxAxis                        Axis;                                              // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             AxisDelegate;                                      // 0x0194(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointSquareBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointSquareBox")
	}
	static class URedpointSquareBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointSquareBox>();
	}
};
DUMPER7_ASSERTS_URedpointSquareBox;

// Class RedpointEOSFramework.RedpointSquareBoxSlot
// 0x0010 (0x0048 - 0x0038)
class URedpointSquareBoxSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointSquareBoxSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointSquareBoxSlot")
	}
	static class URedpointSquareBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointSquareBoxSlot>();
	}
};
DUMPER7_ASSERTS_URedpointSquareBoxSlot;

// Class RedpointEOSFramework.RedpointStartupScreen
// 0x0000 (0x0000 - 0x0000)
class IRedpointStartupScreen final
{
public:
	void OnLoginFailed(const class FText& LoginError, const TDelegate<void()>& OnRetryLogin);
	void OnStartupScreenDisplayed(const TDelegate<void()>& OnStartLogin);
	void UpdateProgressMessage(const class FText& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStartupScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStartupScreen")
	}
	static class IRedpointStartupScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRedpointStartupScreen>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRedpointStartupScreen;

// Class RedpointEOSFramework.RedpointStartupScreenGameMode
// 0x0000 (0x0340 - 0x0340)
class ARedpointStartupScreenGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStartupScreenGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStartupScreenGameMode")
	}
	static class ARedpointStartupScreenGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointStartupScreenGameMode>();
	}
};
DUMPER7_ASSERTS_ARedpointStartupScreenGameMode;

// Class RedpointEOSFramework.RedpointStartupScreenPlayerController
// 0x0000 (0x0738 - 0x0738)
class ARedpointStartupScreenPlayerController final : public APlayerController
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointStartupScreenPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointStartupScreenPlayerController")
	}
	static class ARedpointStartupScreenPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointStartupScreenPlayerController>();
	}
};
DUMPER7_ASSERTS_ARedpointStartupScreenPlayerController;

// Class RedpointEOSFramework.RedpointUMGHUD
// 0x0018 (0x03B0 - 0x0398)
class ARedpointUMGHUD final : public AHUD
{
public:
	TSubclassOf<class UUserWidget>                HUDUMGWidget;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualConstruct;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualAttach;                                     // 0x03A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            HUDUMGWidgetInstance;                              // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void PostWidgetShown(class UUserWidget* Widget, bool bInitiallyCreated);
	void PreWidgetHidden(class UUserWidget* Widget, bool bPendingDestruction);
	void SetWidgetInstance(class UUserWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointUMGHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointUMGHUD")
	}
	static class ARedpointUMGHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedpointUMGHUD>();
	}
};
DUMPER7_ASSERTS_ARedpointUMGHUD;

// Class RedpointEOSFramework.RedpointUnblockVoiceChatMemberAsyncAction
// 0x0048 (0x0078 - 0x0030)
class URedpointUnblockVoiceChatMemberAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bSuccessful)> OnComplete;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URedpointVoiceChatComponent*            VoiceChatComponent;                                // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0048(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class URedpointUnblockVoiceChatMemberAsyncAction* UnblockMember(class URedpointVoiceChatComponent* VoiceChatComponent_0, const struct FUniqueNetIdRepl& OtherMemberId_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointUnblockVoiceChatMemberAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointUnblockVoiceChatMemberAsyncAction")
	}
	static class URedpointUnblockVoiceChatMemberAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointUnblockVoiceChatMemberAsyncAction>();
	}
};
DUMPER7_ASSERTS_URedpointUnblockVoiceChatMemberAsyncAction;

// Class RedpointEOSFramework.RedpointVoiceChatAnchorPointComponent
// 0x00B0 (0x02F0 - 0x0240)
class URedpointVoiceChatAnchorPointComponent final : public USceneComponent
{
public:
	uint8                                         Pad_240[0x58];                                     // 0x0240(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpeakerVoiceChatGroup;                             // 0x0298(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       SpeakerPlayerId;                                   // 0x02A0(0x0030)(Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      SpeakerAttenuationSettings;                        // 0x02D0(0x0008)(Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class FName>                           AudioComponentTags;                                // 0x02D8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatAnchorPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatAnchorPointComponent")
	}
	static class URedpointVoiceChatAnchorPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatAnchorPointComponent>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatAnchorPointComponent;

// Class RedpointEOSFramework.RedpointVoiceChatAnchorPointGameInstanceSubsystem
// 0x00F0 (0x0120 - 0x0030)
class URedpointVoiceChatAnchorPointGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xF0];                                      // 0x0030(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatAnchorPointGameInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatAnchorPointGameInstanceSubsystem")
	}
	static class URedpointVoiceChatAnchorPointGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatAnchorPointGameInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatAnchorPointGameInstanceSubsystem;

// Class RedpointEOSFramework.RedpointVoiceChatClientChannelGameInstanceSubsystem
// 0x00B0 (0x00E0 - 0x0030)
class URedpointVoiceChatClientChannelGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatClientChannelGameInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatClientChannelGameInstanceSubsystem")
	}
	static class URedpointVoiceChatClientChannelGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatClientChannelGameInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatClientChannelGameInstanceSubsystem;

// Class RedpointEOSFramework.RedpointVoiceChatClientComponentGameInstanceSubsystem
// 0x0060 (0x0090 - 0x0030)
class URedpointVoiceChatClientComponentGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatClientComponentGameInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatClientComponentGameInstanceSubsystem")
	}
	static class URedpointVoiceChatClientComponentGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatClientComponentGameInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatClientComponentGameInstanceSubsystem;

// Class RedpointEOSFramework.RedpointVoiceChatComponent
// 0x00E0 (0x0198 - 0x00B8)
class URedpointVoiceChatComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VoiceChatGroup;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERedpointVoiceChatProximityType               ProximityType;                                     // 0x00C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x00C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FRedpointVoiceChatChannelConnection    Connection;                                        // 0x00D0(0x0048)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PossessedPawn;                                     // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class AActor*                                 CustomAudioAnchorPoint;                            // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class AActor*                                 AudioAnchorPoint;                                  // 0x0130(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class URedpointVoiceChatAnchorPointComponent* AudioAnchorPointComponent;                         // 0x0138(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_140[0x38];                                     // 0x0140(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& ChannelName)> OnVoiceChatChannelJoined;       // 0x0178(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PreviousChannelName)> OnVoiceChatChannelLeft; // 0x0188(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnRep_Connection();
	void SetCustomAudioAnchorPoint(class AActor* AnchorPoint);
	void SetHardMutedOnServer(bool bHardMuted);
	void SetInputMuted(bool bMuted);
	void SetInputVolume(float Volume);
	void SetMemberOutputLocalMuted(const struct FUniqueNetIdRepl& OtherMemberId, bool bMuted);
	void SetMemberOutputLocalVolume(const struct FUniqueNetIdRepl& OtherMemberId, float Volume);
	void SetOutputMuted(bool bMuted);
	void SetOutputVolume(float Volume);
	void SetProximityType(ERedpointVoiceChatProximityType InProximityType);
	void SetVoiceChatGroup(int32 InVoiceChatGroup);

	TArray<struct FUniqueNetIdRepl> GetAllMemberUserIds() const;
	class AActor* GetAudioAnchorPoint() const;
	class AActor* GetCustomAudioAnchorPoint() const;
	float GetInputVolume() const;
	struct FUniqueNetIdRepl GetLocalUserId() const;
	class AActor* GetMemberAudioActor(const struct FUniqueNetIdRepl& OtherMemberId) const;
	float GetMemberOutputLocalVolume(const struct FUniqueNetIdRepl& OtherMemberId) const;
	TArray<struct FUniqueNetIdRepl> GetOtherMemberUserIds() const;
	float GetOutputVolume() const;
	ERedpointVoiceChatProximityType GetProximityType() const;
	int32 GetVoiceChatGroup() const;
	bool IsHardMutedOnServer() const;
	bool IsInputMuted() const;
	bool IsLocalUserSpeaking() const;
	bool IsMemberBlocked(const struct FUniqueNetIdRepl& OtherMemberId) const;
	bool IsMemberOutputHardMuted(const struct FUniqueNetIdRepl& OtherMemberId) const;
	bool IsMemberOutputLocalMuted(const struct FUniqueNetIdRepl& OtherMemberId) const;
	bool IsMemberSpeaking(const struct FUniqueNetIdRepl& MemberId) const;
	bool IsOutputMuted() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatComponent")
	}
	static class URedpointVoiceChatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatComponent>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatComponent;

// Class RedpointEOSFramework.RedpointVoiceChatServerGameInstanceSubsystem
// 0x00B0 (0x00E0 - 0x0030)
class URedpointVoiceChatServerGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedpointVoiceChatServerGameInstanceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedpointVoiceChatServerGameInstanceSubsystem")
	}
	static class URedpointVoiceChatServerGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointVoiceChatServerGameInstanceSubsystem>();
	}
};
DUMPER7_ASSERTS_URedpointVoiceChatServerGameInstanceSubsystem;

// Class RedpointEOSFramework.RedpointWidgetReferenceList
// 0x0010 (0x0040 - 0x0030)
class URedpointWidgetReferenceList final : public UPrimaryDataAsset
{
public:
