#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RedpointEOSFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function RedpointEOSFramework.RedpointBlockVoiceChatMemberAsyncAction.BlockMember
// 0x0040 (0x0040 - 0x0000)
struct RedpointBlockVoiceChatMemberAsyncAction_BlockMember final
{
public:
	class URedpointVoiceChatComponent*            VoiceChatComponent_0;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       OtherMemberId_0;                                   // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointBlockVoiceChatMemberAsyncAction* ReturnValue;                                     // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointBlockVoiceChatMemberAsyncAction_BlockMember;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.GetAvailableVoiceChatAudioDevices
// 0x0018 (0x0018 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_GetAvailableVoiceChatAudioDevices final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRedpointVoiceChatAudioDevice>  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_GetAvailableVoiceChatAudioDevices;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.GetGameSession
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_GetGameSession final
{
public:
	class AGameModeBase*                          GameMode;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameSession*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_GetGameSession;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.GetInputPlatformAndPlayerDebugState
// 0x0018 (0x0018 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_GetInputPlatformAndPlayerDebugState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_GetInputPlatformAndPlayerDebugState;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.GetVoiceChatAudioInputDevice
// 0x0060 (0x0060 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_GetVoiceChatAudioInputDevice final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRedpointVoiceChatAudioDevice          ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_GetVoiceChatAudioInputDevice;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.GetVoiceChatAudioOutputDevice
// 0x0060 (0x0060 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_GetVoiceChatAudioOutputDevice final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRedpointVoiceChatAudioDevice          ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_GetVoiceChatAudioOutputDevice;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsGlobalVoiceChatAudioFeatureEnabled
// 0x0040 (0x0040 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsGlobalVoiceChatAudioFeatureEnabled final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERedpointVoiceChatAudioFeature                AudioFeature;                                      // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_IsGlobalVoiceChatAudioFeatureEnabled;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsPlayerControllerSpectating
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsPlayerControllerSpectating final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_IsPlayerControllerSpectating;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsPlayInEditor
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsPlayInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_IsPlayInEditor;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsRedpointFrameworkFreeEdition
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsRedpointFrameworkFreeEdition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_IsRedpointFrameworkFreeEdition;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.KickPlayerController
// 0x0020 (0x0020 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_KickPlayerController final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   KickReason;                                        // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_KickPlayerController;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetGlobalVoiceChatAudioFeatureEnabled
// 0x0040 (0x0040 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetGlobalVoiceChatAudioFeatureEnabled final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERedpointVoiceChatAudioFeature                AudioFeature;                                      // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_SetGlobalVoiceChatAudioFeatureEnabled;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetListViewEntrySpacing
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetListViewEntrySpacing final
{
public:
	class UListView*                              InListView;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEntrySpacing;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_SetListViewEntrySpacing;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetPlayerControllerSpectating
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetPlayerControllerSpectating final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpectating;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_SetPlayerControllerSpectating;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetVoiceChatAudioInputDevice
// 0x0048 (0x0048 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetVoiceChatAudioInputDevice final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceID;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_SetVoiceChatAudioInputDevice;

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetVoiceChatAudioOutputDevice
// 0x0048 (0x0048 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetVoiceChatAudioOutputDevice final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceID;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkBlueprintLibrary_SetVoiceChatAudioOutputDevice;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.BindFriendListSections
// 0x0018 (0x0018 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_BindFriendListSections final
{
public:
	class UTreeView*                              TreeView;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ERedpointFriendListSectionType>        Sections;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_BindFriendListSections;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.SetDisplayCachedPlatformFriends
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_SetDisplayCachedPlatformFriends final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_SetDisplayCachedPlatformFriends;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.SetIncludeLocalPlayerInPartySection
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_SetIncludeLocalPlayerInPartySection final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_SetIncludeLocalPlayerInPartySection;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.UnbindFriendListSections
// 0x0008 (0x0008 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_UnbindFriendListSections final
{
public:
	class UTreeView*                              TreeView;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_UnbindFriendListSections;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.GetPrimaryParty
// 0x0008 (0x0008 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_GetPrimaryParty final
{
public:
	class UParty*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_GetPrimaryParty;

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.IsPrimaryPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_IsPrimaryPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkLocalPlayerSubsystem_IsPrimaryPartyLeader;

// Function RedpointEOSFramework.RedpointFrameworkSubsystem.FetchAvatar
// 0x0078 (0x0078 - 0x0000)
struct RedpointFrameworkSubsystem_FetchAvatar final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0030(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              Expiration;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutHasFailed;                                     // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkSubsystem_FetchAvatar;

// Function RedpointEOSFramework.RedpointFrameworkSubsystem.GetReleaseVersion
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkSubsystem_GetReleaseVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFrameworkSubsystem_GetReleaseVersion;

// Function RedpointEOSFramework.RedpointFriendListAcceptFriendRequestAsyncAction.AcceptFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListAcceptFriendRequestAsyncAction_AcceptFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListAcceptFriendRequestAsyncAction* ReturnValue;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListAcceptFriendRequestAsyncAction_AcceptFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListBlockPlayerAsyncAction.BlockPlayer
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListBlockPlayerAsyncAction_BlockPlayer final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListBlockPlayerAsyncAction* ReturnValue;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListBlockPlayerAsyncAction_BlockPlayer;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanAcceptFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanAcceptFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanAcceptFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanBlockPlayer
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanBlockPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanBlockPlayer;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanInviteToGame
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanInviteToGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanInviteToGame;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanInviteToParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanInviteToParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanInviteToParty;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanJoinGame
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanJoinGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanJoinGame;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanJoinParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanJoinParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanJoinParty;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanKickFromParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanKickFromParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanKickFromParty;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanLeaveParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanLeaveParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanLeaveParty;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanPromoteToPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanPromoteToPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanPromoteToPartyLeader;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanRejectFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanRejectFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanRejectFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanRemoveFriend
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanRemoveFriend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanRemoveFriend;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanSendFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanSendFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanSendFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListEntry.CanUnblockPlayer
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanUnblockPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListEntry_CanUnblockPlayer;

// Function RedpointEOSFramework.RedpointFriendListInviteToGameAsyncAction.InviteToGame
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListInviteToGameAsyncAction_InviteToGame final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListInviteToGameAsyncAction* ReturnValue;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListInviteToGameAsyncAction_InviteToGame;

// Function RedpointEOSFramework.RedpointFriendListInviteToPartyAsyncAction.InviteToParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListInviteToPartyAsyncAction_InviteToParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListInviteToPartyAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListInviteToPartyAsyncAction_InviteToParty;

// Function RedpointEOSFramework.RedpointFriendListJoinGameAsyncAction.JoinGame
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListJoinGameAsyncAction_JoinGame final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListJoinGameAsyncAction* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListJoinGameAsyncAction_JoinGame;

// Function RedpointEOSFramework.RedpointFriendListJoinPartyAsyncAction.JoinParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListJoinPartyAsyncAction_JoinParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListJoinPartyAsyncAction* ReturnValue;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListJoinPartyAsyncAction_JoinParty;

// Function RedpointEOSFramework.RedpointFriendListKickFromPartyAsyncAction.KickFromParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListKickFromPartyAsyncAction_KickFromParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListKickFromPartyAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListKickFromPartyAsyncAction_KickFromParty;

// Function RedpointEOSFramework.RedpointFriendListLeavePartyAsyncAction.LeaveParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListLeavePartyAsyncAction_LeaveParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListLeavePartyAsyncAction* ReturnValue;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListLeavePartyAsyncAction_LeaveParty;

// Function RedpointEOSFramework.RedpointFriendListPromoteInPartyAsyncAction.PromoteInParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListPromoteInPartyAsyncAction_PromoteInParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListPromoteInPartyAsyncAction* ReturnValue;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListPromoteInPartyAsyncAction_PromoteInParty;

// Function RedpointEOSFramework.RedpointFriendListRejectFriendRequestAsyncAction.RejectFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListRejectFriendRequestAsyncAction_RejectFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListRejectFriendRequestAsyncAction* ReturnValue;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListRejectFriendRequestAsyncAction_RejectFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListRemoveFriendAsyncAction.RemoveFriend
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListRemoveFriendAsyncAction_RemoveFriend final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListRemoveFriendAsyncAction* ReturnValue;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListRemoveFriendAsyncAction_RemoveFriend;

// Function RedpointEOSFramework.RedpointFriendListSection.HasAnyEntries
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListSection_HasAnyEntries final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListSection_HasAnyEntries;

// Function RedpointEOSFramework.RedpointFriendListSendFriendRequestAsyncAction.SendFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListSendFriendRequestAsyncAction_SendFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListSendFriendRequestAsyncAction* ReturnValue;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListSendFriendRequestAsyncAction_SendFriendRequest;

// Function RedpointEOSFramework.RedpointFriendListUnblockPlayerAsyncAction.UnblockPlayer
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListUnblockPlayerAsyncAction_UnblockPlayer final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListUnblockPlayerAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointFriendListUnblockPlayerAsyncAction_UnblockPlayer;

// Function RedpointEOSFramework.RedpointGameInstance.ConstructStartupScreen
// 0x0010 (0x0010 - 0x0000)
struct RedpointGameInstance_ConstructStartupScreen final
{
public:
	TSubclassOf<class UUserWidget>                StartupScreenWidgetClass;                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointGameInstance_ConstructStartupScreen;

// Function RedpointEOSFramework.RedpointGameSession.HoldPlayer
// 0x0030 (0x0030 - 0x0000)
struct RedpointGameSession_HoldPlayer final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointGameSession_HoldPlayer;

// Function RedpointEOSFramework.RedpointGameSession.ReleasePlayer
// 0x0030 (0x0030 - 0x0000)
struct RedpointGameSession_ReleasePlayer final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointGameSession_ReleasePlayer;

// Function RedpointEOSFramework.RedpointNotifyUniqueIdInterface.NotifyUniqueNetIdSet
// 0x0038 (0x0038 - 0x0000)
struct RedpointNotifyUniqueIdInterface_NotifyUniqueNetIdSet final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       UniqueID;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointNotifyUniqueIdInterface_NotifyUniqueNetIdSet;

// Function RedpointEOSFramework.RedpointPartyMember.PartyMemberChanged
// 0x00F0 (0x00F0 - 0x0000)
struct RedpointPartyMember_PartyMemberChanged final
{
public:
	struct FRedpointPartyMemberInfo               PartyMember;                                       // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointPartyMember_PartyMemberChanged;

// Function RedpointEOSFramework.RedpointStartupScreen.OnLoginFailed
// 0x0020 (0x0020 - 0x0000)
struct RedpointStartupScreen_OnLoginFailed final
{
public:
	class FText                                   LoginError;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnRetryLogin;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointStartupScreen_OnLoginFailed;

// Function RedpointEOSFramework.RedpointStartupScreen.OnStartupScreenDisplayed
// 0x0010 (0x0010 - 0x0000)
struct RedpointStartupScreen_OnStartupScreenDisplayed final
{
public:
	TDelegate<void()>                             OnStartLogin;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointStartupScreen_OnStartupScreenDisplayed;

// Function RedpointEOSFramework.RedpointStartupScreen.UpdateProgressMessage
// 0x0010 (0x0010 - 0x0000)
struct RedpointStartupScreen_UpdateProgressMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointStartupScreen_UpdateProgressMessage;

// Function RedpointEOSFramework.RedpointUMGHUD.PostWidgetShown
// 0x0010 (0x0010 - 0x0000)
struct RedpointUMGHUD_PostWidgetShown final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitiallyCreated;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointUMGHUD_PostWidgetShown;

// Function RedpointEOSFramework.RedpointUMGHUD.PreWidgetHidden
// 0x0010 (0x0010 - 0x0000)
struct RedpointUMGHUD_PreWidgetHidden final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPendingDestruction;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointUMGHUD_PreWidgetHidden;

// Function RedpointEOSFramework.RedpointUMGHUD.SetWidgetInstance
// 0x0008 (0x0008 - 0x0000)
struct RedpointUMGHUD_SetWidgetInstance final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointUMGHUD_SetWidgetInstance;

// Function RedpointEOSFramework.RedpointUnblockVoiceChatMemberAsyncAction.UnblockMember
// 0x0040 (0x0040 - 0x0000)
struct RedpointUnblockVoiceChatMemberAsyncAction_UnblockMember final
{
public:
	class URedpointVoiceChatComponent*            VoiceChatComponent_0;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       OtherMemberId_0;                                   // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointUnblockVoiceChatMemberAsyncAction* ReturnValue;                                   // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointUnblockVoiceChatMemberAsyncAction_UnblockMember;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.OnPossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct RedpointVoiceChatComponent_OnPossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_OnPossessedPawnChanged;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetCustomAudioAnchorPoint
// 0x0008 (0x0008 - 0x0000)
struct RedpointVoiceChatComponent_SetCustomAudioAnchorPoint final
{
public:
	class AActor*                                 AnchorPoint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetCustomAudioAnchorPoint;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetHardMutedOnServer
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_SetHardMutedOnServer final
{
public:
	bool                                          bHardMuted;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetHardMutedOnServer;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetInputMuted
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_SetInputMuted final
{
public:
	bool                                          bMuted;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetInputMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetInputVolume
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_SetInputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetInputVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetMemberOutputLocalMuted
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_SetMemberOutputLocalMuted final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuted;                                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetMemberOutputLocalMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetMemberOutputLocalVolume
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_SetMemberOutputLocalVolume final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetMemberOutputLocalVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetOutputMuted
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_SetOutputMuted final
{
public:
	bool                                          bMuted;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetOutputMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_SetOutputVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetOutputVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetProximityType
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_SetProximityType final
{
public:
	ERedpointVoiceChatProximityType               InProximityType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetProximityType;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.SetVoiceChatGroup
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_SetVoiceChatGroup final
{
public:
	int32                                         InVoiceChatGroup;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_SetVoiceChatGroup;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetAllMemberUserIds
// 0x0010 (0x0010 - 0x0000)
struct RedpointVoiceChatComponent_GetAllMemberUserIds final
{
public:
	TArray<struct FUniqueNetIdRepl>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetAllMemberUserIds;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetAudioAnchorPoint
// 0x0008 (0x0008 - 0x0000)
struct RedpointVoiceChatComponent_GetAudioAnchorPoint final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetAudioAnchorPoint;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetCustomAudioAnchorPoint
// 0x0008 (0x0008 - 0x0000)
struct RedpointVoiceChatComponent_GetCustomAudioAnchorPoint final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetCustomAudioAnchorPoint;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetInputVolume
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_GetInputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetInputVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetLocalUserId
// 0x0030 (0x0030 - 0x0000)
struct RedpointVoiceChatComponent_GetLocalUserId final
{
public:
	struct FUniqueNetIdRepl                       ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetLocalUserId;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetMemberAudioActor
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_GetMemberAudioActor final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetMemberAudioActor;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetMemberOutputLocalVolume
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_GetMemberOutputLocalVolume final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetMemberOutputLocalVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetOtherMemberUserIds
// 0x0010 (0x0010 - 0x0000)
struct RedpointVoiceChatComponent_GetOtherMemberUserIds final
{
public:
	TArray<struct FUniqueNetIdRepl>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetOtherMemberUserIds;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_GetOutputVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetOutputVolume;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetProximityType
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_GetProximityType final
{
public:
	ERedpointVoiceChatProximityType               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetProximityType;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.GetVoiceChatGroup
// 0x0004 (0x0004 - 0x0000)
struct RedpointVoiceChatComponent_GetVoiceChatGroup final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_GetVoiceChatGroup;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsHardMutedOnServer
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_IsHardMutedOnServer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsHardMutedOnServer;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsInputMuted
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_IsInputMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsInputMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsLocalUserSpeaking
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_IsLocalUserSpeaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsLocalUserSpeaking;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsMemberBlocked
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_IsMemberBlocked final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsMemberBlocked;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsMemberOutputHardMuted
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_IsMemberOutputHardMuted final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsMemberOutputHardMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsMemberOutputLocalMuted
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_IsMemberOutputLocalMuted final
{
public:
	struct FUniqueNetIdRepl                       OtherMemberId;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsMemberOutputLocalMuted;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsMemberSpeaking
// 0x0038 (0x0038 - 0x0000)
struct RedpointVoiceChatComponent_IsMemberSpeaking final
{
public:
	struct FUniqueNetIdRepl                       MemberId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsMemberSpeaking;

// Function RedpointEOSFramework.RedpointVoiceChatComponent.IsOutputMuted
// 0x0001 (0x0001 - 0x0000)
struct RedpointVoiceChatComponent_IsOutputMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RedpointVoiceChatComponent_IsOutputMuted;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
