#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigLogicModule

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "RigLogicModule_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class RigLogicModule.DNAIndexMapping
// 0x0000 (0x0028 - 0x0028)
class UDNAIndexMapping final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DNAIndexMapping")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DNAIndexMapping")
	}
	static class UDNAIndexMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAIndexMapping>();
	}
};
DUMPER7_ASSERTS_UDNAIndexMapping;

// Class RigLogicModule.DNAAsset
// 0x0118 (0x0140 - 0x0028)
class UDNAAsset final : public UAssetUserData
{
public:
	class FString                                 DnaFileName;                                       // 0x0028(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepDNAAfterInitialization;                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            MetaData;                                          // 0x0040(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRigLogicConfiguration                 RigLogicConfiguration;                             // 0x0090(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x98];                                      // 0x00A8(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DNAAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DNAAsset")
	}
	static class UDNAAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAsset>();
	}
};
DUMPER7_ASSERTS_UDNAAsset;

// Class RigLogicModule.SkelMeshDNAUtils
// 0x0000 (0x0028 - 0x0028)
class USkelMeshDNAUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkelMeshDNAUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkelMeshDNAUtils")
	}
	static class USkelMeshDNAUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkelMeshDNAUtils>();
	}
};
DUMPER7_ASSERTS_USkelMeshDNAUtils;

SDK_NAMESPACE_END
