#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_EventValue

#include "Basic.hpp"

#include "EN_DeviceSignalType_structs.hpp"
#include "EN_DeviceState_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_EventValue.ST_EventValue
// 0x0028 (0x0028 - 0x0000)
struct FST_EventValue final
{
public:
	bool                                          BoolValue_22_53D90B244326065014C659A66BE7E02C;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String_14_7EA9D42B48D690D95201CABD96240F56;        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_12_C1DE51F449050D4B24B452BCB5D4F3B9;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_DeviceState                                DeviceState_17_D1A621F44FF02841AC276FA3AA16FB25;   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_DeviceSignalType                           DeviceSignal_24_4881537D4212958310B9438E1CCB2827;  // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_EventValue;

SDK_NAMESPACE_END
