#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_GenerateBoxLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_GenerateBoxLocation.ST_GenerateBoxLocation
// 0x0050 (0x0050 - 0x0000)
struct FST_GenerateBoxLocation final
{
public:
	int32                                         SpawnNum_6_A41724AA48086D0D82267F8CDDA3009C;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GenerateClass_3_DF97AD3648731A9BCBCE4582A8222FF8;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceBoundSize_9_556DF56F490DEC169773E48E94263F56; // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloorCheckDistance_12_437B63734E2CEF02465044A710265890; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxGenerateCharange_19_EB8E74654A24CCFE530B729A9CEBBA97; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInfinity_18_BFCE1D3D404853C6CC37288964E0F82C;    // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RnadomScaleRange_23_532D9EA24C9B4985CA2202A1269B2E1B; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreNoGrow_25_E49E58BB461E70EA0D2740BF2BF81026;  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_GenerateBoxLocation;

SDK_NAMESPACE_END
