#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_HandControlDatas

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_HandControlDatas.ST_HandControlDatas
// 0x0060 (0x0060 - 0x0000)
struct FST_HandControlDatas final
{
public:
	class ABP_FirstPersonCharacter_LINK_C*        SelfCharacter_2_88B2F6E341E1DA49478562BCF773AB39;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttachPosition_5_C702439142F6F6757C662493C959AB7D; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttachDistance_8_E488ABA84E8187851B93AEA3BDD22308; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LocalAttachRotation_12_27CF74454AA666E4B993689109486F9E; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Rotation_14_D0142A5A4542654C65AA0AB53ECB7DBC;      // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        HorizontalDistance_17_7DBE20B546A55296342B8595353491F1; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_HandControlDatas;

SDK_NAMESPACE_END
