#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ItemCoreDatas

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_OptionObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_ItemCoreDatas.ST_ItemCoreDatas
// 0x0070 (0x0070 - 0x0000)
struct FST_ItemCoreDatas final
{
public:
	struct FGuid                                  ItemID_10_2895443A4E9EEA4ED84BD09984B0949C;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemName_2_7BE19146430F8AE25F2ED089CC1B98E2;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Durability_6_7B85D304453094C209CE7EAB9784A3EF;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FST_OptionObject>    UniqueOptions_16_3DB2246246A4CDD453726A9D9EB5146C; // 0x0020(0x0050)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FST_ItemCoreDatas;

SDK_NAMESPACE_END
