#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_SpawnLuggageDatas

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_SpawnLuggageDatas.ST_SpawnLuggageDatas
// 0x0050 (0x0050 - 0x0000)
struct FST_SpawnLuggageDatas final
{
public:
	class FText                                   ObjectName_15_B0973CF246DA13A7C6D5BDAB569C19C4;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UStaticMesh>             TargetMesh_2_7BE3A9C948C944CB85DA47B7ABB2675D;     // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Mass_11_9F2957874C6F23011C32B2A66A865E02;          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OverrideClass_5_51C971DC479F1904609FAE855B2ED553;  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleMultiplyer_8_E0E62821490E178C959BF586BF95E7B0; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_SpawnLuggageDatas;

SDK_NAMESPACE_END
