#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateStream

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct StateStream.StateStreamHandle
// 0x0001 (0x0001 - 0x0000)
struct FStateStreamHandle
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateStreamHandle;

// ScriptStruct StateStream.TransformStaticState
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FTransformStaticState final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTransformStaticState;

// ScriptStruct StateStream.TransformHandle
// 0x000F (0x0010 - 0x0001)
struct alignas(0x08) FTransformHandle final : public FStateStreamHandle
{
public:
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTransformHandle;

// ScriptStruct StateStream.TransformDynamicState
// 0x00A0 (0x00A0 - 0x0000)
struct FTransformDynamicState final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     BoneTransforms;                                    // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FTransformHandle                       Parent;                                            // 0x0080(0x0010)(NativeAccessSpecifierPrivate)
	bool                                          bVisible;                                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTransformDynamicState;

SDK_NAMESPACE_END
