#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamWorkshopMaps

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SteamWorkshopMaps_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.HostLoadWorkshopMapFromDescriptor
// 0x0180 (0x0180 - 0x0000)
struct SteamWorkshopMapReplicator_HostLoadWorkshopMapFromDescriptor final
{
public:
	class FString                                 WorkshopItemId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorkshopMapDescriptor                 Descriptor;                                        // 0x0010(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             AnchorTransform;                                   // 0x00D0(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDescriptorEntryTransform;                      // 0x0130(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalLevelNameOverride;                         // 0x0138(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoUnloadPreviousLevel;                          // 0x0148(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PakOrder;                                          // 0x014C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0150(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0160(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0170(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_HostLoadWorkshopMapFromDescriptor;

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.HostLoadWorkshopMapFromInstalledItem
// 0x00C0 (0x00C0 - 0x0000)
struct SteamWorkshopMapReplicator_HostLoadWorkshopMapFromInstalledItem final
{
public:
	class FString                                 WorkshopItemId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             AnchorTransform;                                   // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDescriptorEntryTransform;                      // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalLevelNameOverride;                         // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoUnloadPreviousLevel;                          // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PakOrder;                                          // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_HostLoadWorkshopMapFromInstalledItem;

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.HostUnloadWorkshopMap
// 0x0018 (0x0018 - 0x0000)
struct SteamWorkshopMapReplicator_HostUnloadWorkshopMap final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_HostUnloadWorkshopMap;

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.AreAllPlayersLoaded
// 0x0001 (0x0001 - 0x0000)
struct SteamWorkshopMapReplicator_AreAllPlayersLoaded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_AreAllPlayersLoaded;

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.GetCurrentLoadRequest
// 0x0180 (0x0180 - 0x0000)
struct SteamWorkshopMapReplicator_GetCurrentLoadRequest final
{
public:
	struct FSteamWorkshopMapNetworkLoadRequest    ReturnValue;                                       // 0x0000(0x0180)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_GetCurrentLoadRequest;

// Function SteamWorkshopMaps.SteamWorkshopMapReplicator.GetPlayerLoadStatuses
// 0x0010 (0x0010 - 0x0000)
struct SteamWorkshopMapReplicator_GetPlayerLoadStatuses final
{
public:
	TArray<struct FSteamWorkshopMapPlayerLoadStatus> ReturnValue;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapReplicator_GetPlayerLoadStatuses;

// Function SteamWorkshopMaps.SteamWorkshopMapClientLoader.ServerReportLoadState
// 0x0018 (0x0018 - 0x0000)
struct SteamWorkshopMapClientLoader_ServerReportLoadState final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamWorkshopMapNetworkLoadState             State;                                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapClientLoader_ServerReportLoadState;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.CreateWorkshopItem
// 0x0018 (0x0018 - 0x0000)
struct SteamWorkshopMapSubsystem_CreateWorkshopItem final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_CreateWorkshopItem;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.LoadWorkshopMapFromManifest
// 0x00B0 (0x00B0 - 0x0000)
struct SteamWorkshopMapSubsystem_LoadWorkshopMapFromManifest final
{
public:
	class FString                                 ManifestFilePath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             AnchorTransform;                                   // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDescriptorEntryTransform;                      // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalLevelNameOverride;                         // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                 ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_LoadWorkshopMapFromManifest;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.LoadWorkshopMapLevel
// 0x0160 (0x0160 - 0x0000)
struct SteamWorkshopMapSubsystem_LoadWorkshopMapLevel final
{
public:
	struct FWorkshopMapDescriptor                 Descriptor;                                        // 0x0000(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             AnchorTransform;                                   // 0x00C0(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDescriptorEntryTransform;                      // 0x0120(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalLevelNameOverride;                         // 0x0128(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0138(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0140(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                 ReturnValue;                                       // 0x0150(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_LoadWorkshopMapLevel;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.RequestWorkshopItemDetails
// 0x0030 (0x0030 - 0x0000)
struct SteamWorkshopMapSubsystem_RequestWorkshopItemDetails final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAgeSeconds;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_RequestWorkshopItemDetails;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.SubmitWorkshopItemUpdate
// 0x0090 (0x0090 - 0x0000)
struct SteamWorkshopMapSubsystem_SubmitWorkshopItemUpdate final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamWorkshopSubmitOptions            Options;                                           // 0x0010(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_SubmitWorkshopItemUpdate;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.CleanAllSubscribedWorkshopItemFoldersForMount
// 0x0028 (0x0028 - 0x0000)
struct SteamWorkshopMapSubsystem_CleanAllSubscribedWorkshopItemFoldersForMount final
{
public:
	TArray<class FString>                         DeletedFiles;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_CleanAllSubscribedWorkshopItemFoldersForMount;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.CleanWorkshopItemFolderForMount
// 0x0038 (0x0038 - 0x0000)
struct SteamWorkshopMapSubsystem_CleanWorkshopItemFolderForMount final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         DeletedFiles;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_CleanWorkshopItemFolderForMount;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.GetPakMountDiagnostics
// 0x0068 (0x0068 - 0x0000)
struct SteamWorkshopMapSubsystem_GetPakMountDiagnostics final
{
public:
	class FString                                 PakFilePath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamWorkshopPakMountDiagnostics      OutDiagnostics;                                    // 0x0010(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_GetPakMountDiagnostics;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.GetSubscribedWorkshopItems
// 0x0028 (0x0028 - 0x0000)
struct SteamWorkshopMapSubsystem_GetSubscribedWorkshopItems final
{
public:
	TArray<struct FSteamWorkshopItemInfo>         OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_GetSubscribedWorkshopItems;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.GetWorkshopItemInstallInfo
// 0x0060 (0x0060 - 0x0000)
struct SteamWorkshopMapSubsystem_GetWorkshopItemInstallInfo final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamWorkshopItemInstallInfo          OutInfo;                                           // 0x0010(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_GetWorkshopItemInstallInfo;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.IsSteamWorkshopAvailable
// 0x0018 (0x0018 - 0x0000)
struct SteamWorkshopMapSubsystem_IsSteamWorkshopAvailable final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_IsSteamWorkshopAvailable;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.MountPakFile
// 0x0030 (0x0030 - 0x0000)
struct SteamWorkshopMapSubsystem_MountPakFile final
{
public:
	class FString                                 PakFilePath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakOrder;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_MountPakFile;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.MountPakFromWorkshopItem
// 0x0050 (0x0050 - 0x0000)
struct SteamWorkshopMapSubsystem_MountPakFromWorkshopItem final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PakFileName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakOrder;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MountedPakFilePath;                                // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_MountPakFromWorkshopItem;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.ReadWorkshopMapDescriptor
// 0x00F0 (0x00F0 - 0x0000)
struct SteamWorkshopMapSubsystem_ReadWorkshopMapDescriptor final
{
public:
	class FString                                 ManifestFilePath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorkshopMapDescriptor                 OutDescriptor;                                     // 0x0010(0x00C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x00D0(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_ReadWorkshopMapDescriptor;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.RequestDownloadWorkshopItem
// 0x0030 (0x0030 - 0x0000)
struct SteamWorkshopMapSubsystem_RequestDownloadWorkshopItem final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHighPriority;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_RequestDownloadWorkshopItem;

// Function SteamWorkshopMaps.SteamWorkshopMapSubsystem.ScanMountedMapAssets
// 0x0010 (0x0010 - 0x0000)
struct SteamWorkshopMapSubsystem_ScanMountedMapAssets final
{
public:
	class FString                                 PackagePath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopMapSubsystem_ScanMountedMapAssets;

// Function SteamWorkshopMaps.SteamWorkshopItemDetailsAsyncAction.RequestWorkshopItemDetailsAsync
// 0x0028 (0x0028 - 0x0000)
struct SteamWorkshopItemDetailsAsyncAction_RequestWorkshopItemDetailsAsync final
{
public:
	class UObject*                                WorldContextObject_0;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId_0;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAgeSeconds_0;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamWorkshopItemDetailsAsyncAction*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopItemDetailsAsyncAction_RequestWorkshopItemDetailsAsync;

// Function SteamWorkshopMaps.SteamWorkshopItemDetailsAsyncAction.HandleRequestComplete
// 0x00C0 (0x00C0 - 0x0000)
struct SteamWorkshopItemDetailsAsyncAction_HandleRequestComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CompletedItemId;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0018(0x0098)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x00B0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SteamWorkshopItemDetailsAsyncAction_HandleRequestComplete;

// Function SteamWorkshopMaps.WorkshopMapAnchor.GetPlacementTransform
// 0x0060 (0x0060 - 0x0000)
struct WorkshopMapAnchor_GetPlacementTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorkshopMapAnchor_GetPlacementTransform;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
