#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Occlusion_Volume

#include "Basic.hpp"

#include "UDS_Volume_Actor_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass UDS_Occlusion_Volume.UDS_Occlusion_Volume_C
// 0x0020 (0x0320 - 0x0300)
class AUDS_Occlusion_Volume_C final : public AUDS_Volume_Actor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UDS_Occlusion_Volume_C;             // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          _Interior_Adjusments;                              // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Occlusion_Multiplier;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Block_Weather_Particles;                           // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void Query_Occlusion_Multiplier(const struct FVector& Location, double* Multiplier);
	void ExecuteUbergraph_UDS_Occlusion_Volume(int32 EntryPoint);
	void Configure_Weather_Particle_Blocking();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UDS_Occlusion_Volume_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UDS_Occlusion_Volume_C")
	}
	static class AUDS_Occlusion_Volume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUDS_Occlusion_Volume_C>();
	}
};
DUMPER7_ASSERTS_AUDS_Occlusion_Volume_C;

SDK_NAMESPACE_END
