#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Cloud_Paint_Cell

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass UDS_Cloud_Paint_Cell.UDS_Cloud_Paint_Cell_C
// 0x0040 (0x0070 - 0x0030)
class UUDS_Cloud_Paint_Cell_C final : public UPrimaryDataAsset
{
public:
	TArray<struct FLinearColor>                   Painting_Array;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0040(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Zero_Coverage_Present;                             // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mid_Coverage_Present;                              // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Full_Coverage_Present;                             // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UDS_Cloud_Paint_Cell_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UDS_Cloud_Paint_Cell_C")
	}
	static class UUDS_Cloud_Paint_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUDS_Cloud_Paint_Cell_C>();
	}
};
DUMPER7_ASSERTS_UUDS_Cloud_Paint_Cell_C;

SDK_NAMESPACE_END
