#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniversalVoiceChatPro

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UniversalVoiceChatPro_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UniversalVoiceChatPro.AudioCaptureAndroid.AndroidHasPermission
// 0x0001 (0x0001 - 0x0000)
struct AudioCaptureAndroid_AndroidHasPermission final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioCaptureAndroid_AndroidHasPermission;

// Function UniversalVoiceChatPro.AudioCaptureAndroid.AndroidMicrophoneStart
// 0x0010 (0x0010 - 0x0000)
struct AudioCaptureAndroid_AndroidMicrophoneStart final
{
public:
	class UMicrophoneSpeakComponent*              callbackComp;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         sampleRateToUse;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AudioCaptureAndroid_AndroidMicrophoneStart;

// Function UniversalVoiceChatPro.AudioCaptureAndroid.AndroidMicrophoneStop
// 0x0008 (0x0008 - 0x0000)
struct AudioCaptureAndroid_AndroidMicrophoneStop final
{
public:
	class UMicrophoneSpeakComponent*              callbackComp;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioCaptureAndroid_AndroidMicrophoneStop;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.getLocallyMultiplierVolume
// 0x0004 (0x0004 - 0x0000)
struct MicrophoneSpeakComponent_getLocallyMultiplierVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_getLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.initAudioResources
// 0x0010 (0x0010 - 0x0000)
struct MicrophoneSpeakComponent_initAudioResources final
{
public:
	int32                                         voiceSampleRate;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _voiceNumChannels;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         opusFramesPerSec;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_initAudioResources;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.isPlayingAudioVoice
// 0x0001 (0x0001 - 0x0000)
struct MicrophoneSpeakComponent_isPlayingAudioVoice final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_isPlayingAudioVoice;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.muteAudio
// 0x0001 (0x0001 - 0x0000)
struct MicrophoneSpeakComponent_muteAudio final
{
public:
	bool                                          _isMuted;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_muteAudio;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.payloadReceivedVoiceData
// 0x0020 (0x0020 - 0x0000)
struct MicrophoneSpeakComponent_payloadReceivedVoiceData final
{
public:
	TArray<uint8>                                 dataEncoded;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PCMSize;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         opusFramePerSec;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_payloadReceivedVoiceData;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.RPCClientTransmitVoiceData
// 0x0040 (0x0040 - 0x0000)
struct MicrophoneSpeakComponent_RPCClientTransmitVoiceData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PCMSize;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         opusFramePerSec;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _isGlobal;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 _radioChannel;                                     // 0x0028(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          _useRange;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxRange;                                         // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_RPCClientTransmitVoiceData;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.RPCReceiveVoiceFromServer
// 0x0028 (0x0028 - 0x0000)
struct MicrophoneSpeakComponent_RPCReceiveVoiceFromServer final
{
public:
	class UMicrophoneSpeakComponent*              compToOutputVoice;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 dataEncoded;                                       // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PCMSize;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         opusFramePerSec;                                   // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_RPCReceiveVoiceFromServer;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.RPCServerBroadcastVoiceData
// 0x0020 (0x0020 - 0x0000)
struct MicrophoneSpeakComponent_RPCServerBroadcastVoiceData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PCMSize;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         opusFramePerSec;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_RPCServerBroadcastVoiceData;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.setAttenuationAssetPath
// 0x0018 (0x0018 - 0x0000)
struct MicrophoneSpeakComponent_setAttenuationAssetPath final
{
public:
	bool                                          enableAttenuation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToAttenuationAsset;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_setAttenuationAssetPath;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.setLocallyMultiplierVolume
// 0x0004 (0x0004 - 0x0000)
struct MicrophoneSpeakComponent_setLocallyMultiplierVolume final
{
public:
	float                                         multiplierVolume;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_setLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.setOverrideLocallyAttenuationPath
// 0x0018 (0x0018 - 0x0000)
struct MicrophoneSpeakComponent_setOverrideLocallyAttenuationPath final
{
public:
	bool                                          enableAttenuation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overrideLocally;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToAttenuationAsset;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_setOverrideLocallyAttenuationPath;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.setOverrideLocallySourceEffectPath
// 0x0018 (0x0018 - 0x0000)
struct MicrophoneSpeakComponent_setOverrideLocallySourceEffectPath final
{
public:
	bool                                          enableSourceEffect;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overrideLocally;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToSourceEffectAsset;                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_setOverrideLocallySourceEffectPath;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.setSourceChainEffectAssetPath
// 0x0018 (0x0018 - 0x0000)
struct MicrophoneSpeakComponent_setSourceChainEffectAssetPath final
{
public:
	bool                                          enableSourceChainEffect;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToSourceChainEffect;                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_setSourceChainEffectAssetPath;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.SetVoiceVolume
// 0x0004 (0x0004 - 0x0000)
struct MicrophoneSpeakComponent_SetVoiceVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_SetVoiceVolume;

// Function UniversalVoiceChatPro.MicrophoneSpeakComponent.startSpeaking
// 0x0028 (0x0028 - 0x0000)
struct MicrophoneSpeakComponent_startSpeaking final
{
public:
	bool                                          _shouldHearMyOwnVoice;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsGlobal;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 radioChannel;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          useRange;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxRange;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MicrophoneSpeakComponent_startSpeaking;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.DelegateEndPlayOwner
// 0x0010 (0x0010 - 0x0000)
struct PlayerVoiceChatActor_DelegateEndPlayOwner final
{
public:
	class AActor*                                 act;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_DelegateEndPlayOwner;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.getLocallyMultiplierVolume
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_getLocallyMultiplierVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_getLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.IsMicrophoneComponentValid
// 0x0001 (0x0001 - 0x0000)
struct PlayerVoiceChatActor_IsMicrophoneComponentValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_IsMicrophoneComponentValid;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.muteAudio
// 0x0001 (0x0001 - 0x0000)
struct PlayerVoiceChatActor_muteAudio final
{
public:
	bool                                          isMute;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_muteAudio;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientAskAddChannel
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_RPCClientAskAddChannel final
{
public:
	int32                                         channelToAdd;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientAskAddChannel;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientAskRemoveChannel
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_RPCClientAskRemoveChannel final
{
public:
	int32                                         channelToRemove;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientAskRemoveChannel;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientSetAttenuationPath
// 0x0010 (0x0010 - 0x0000)
struct PlayerVoiceChatActor_RPCClientSetAttenuationPath final
{
public:
	class FString                                 _attenuationPath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientSetAttenuationPath;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientSetIsMicrophoneOn
// 0x0001 (0x0001 - 0x0000)
struct PlayerVoiceChatActor_RPCClientSetIsMicrophoneOn final
{
public:
	bool                                          _isMicrophoneOn;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientSetIsMicrophoneOn;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientSetMicrophoneVolume
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_RPCClientSetMicrophoneVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientSetMicrophoneVolume;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientSetPlayerName
// 0x0010 (0x0010 - 0x0000)
struct PlayerVoiceChatActor_RPCClientSetPlayerName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientSetPlayerName;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCClientSetSourceChainEffectPath
// 0x0010 (0x0010 - 0x0000)
struct PlayerVoiceChatActor_RPCClientSetSourceChainEffectPath final
{
public:
	class FString                                 _pathToSourceChainEffectAsset;                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCClientSetSourceChainEffectPath;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.RPCServerUpdatePosAudioComp
// 0x0030 (0x0030 - 0x0000)
struct PlayerVoiceChatActor_RPCServerUpdatePosAudioComp final
{
public:
	struct FVector                                worldPos;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               worldRotation;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_RPCServerUpdatePosAudioComp;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerAddChannel
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_ServerAddChannel final
{
public:
	int32                                         channelToAdd;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerAddChannel;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerRemoveChannel
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_ServerRemoveChannel final
{
public:
	int32                                         channelToRemove;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerRemoveChannel;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerSetAllowUseGlobal
// 0x0001 (0x0001 - 0x0000)
struct PlayerVoiceChatActor_ServerSetAllowUseGlobal final
{
public:
	bool                                          _allowUseGlobal;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerSetAllowUseGlobal;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerSetAllowUseProximity
// 0x0001 (0x0001 - 0x0000)
struct PlayerVoiceChatActor_ServerSetAllowUseProximity final
{
public:
	bool                                          _allowUseRange;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerSetAllowUseProximity;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerSetAttenuation
// 0x0018 (0x0018 - 0x0000)
struct PlayerVoiceChatActor_ServerSetAttenuation final
{
public:
	bool                                          enableAttenuation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToAttenuationAsset;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerSetAttenuation;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerSetMaxProximityRange
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_ServerSetMaxProximityRange final
{
public:
	float                                         _maxProximityRange;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerSetMaxProximityRange;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.ServerSetSourceChainEffect
// 0x0018 (0x0018 - 0x0000)
struct PlayerVoiceChatActor_ServerSetSourceChainEffect final
{
public:
	bool                                          enableSourceChainEffect;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToSourceChainEffect;                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_ServerSetSourceChainEffect;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.setLocallyMultiplierVolume
// 0x0004 (0x0004 - 0x0000)
struct PlayerVoiceChatActor_setLocallyMultiplierVolume final
{
public:
	float                                         multiplierVolume;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_setLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.setOverrideLocallyAttenuationPath
// 0x0018 (0x0018 - 0x0000)
struct PlayerVoiceChatActor_setOverrideLocallyAttenuationPath final
{
public:
	bool                                          enableAttenuation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overrideLocally;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToAttenuationAsset;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_setOverrideLocallyAttenuationPath;

// Function UniversalVoiceChatPro.PlayerVoiceChatActor.setOverrideLocallySourceEffectPath
// 0x0018 (0x0018 - 0x0000)
struct PlayerVoiceChatActor_setOverrideLocallySourceEffectPath final
{
public:
	bool                                          enableSourceEffect;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overrideLocally;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToSourceEffectAsset;                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerVoiceChatActor_setOverrideLocallySourceEffectPath;

// Function UniversalVoiceChatPro.UniversalVoiceChat.IsMyPlayerVoiceChatActorReady
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_IsMyPlayerVoiceChatActorReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_IsMyPlayerVoiceChatActorReady;

// Function UniversalVoiceChatPro.UniversalVoiceChat.RegisterCallbackDeleteVoiceChatActor
// 0x0010 (0x0010 - 0x0000)
struct UniversalVoiceChat_RegisterCallbackDeleteVoiceChatActor final
{
public:
	TDelegate<void(const class APlayerVoiceChatActor* VoiceChatActor)> Delegate;                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_RegisterCallbackDeleteVoiceChatActor;

// Function UniversalVoiceChatPro.UniversalVoiceChat.RegisterCallbackMyVoiceChatActorReady
// 0x0010 (0x0010 - 0x0000)
struct UniversalVoiceChat_RegisterCallbackMyVoiceChatActorReady final
{
public:
	TDelegate<void(const class APlayerVoiceChatActor* VoiceChatActor)> Delegate;                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_RegisterCallbackMyVoiceChatActorReady;

// Function UniversalVoiceChatPro.UniversalVoiceChat.RegisterCallbackNewVoiceChatActor
// 0x0010 (0x0010 - 0x0000)
struct UniversalVoiceChat_RegisterCallbackNewVoiceChatActor final
{
public:
	TDelegate<void(const class APlayerVoiceChatActor* VoiceChatActor)> Delegate;                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_RegisterCallbackNewVoiceChatActor;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatAddChannel
// 0x0008 (0x0008 - 0x0000)
struct UniversalVoiceChat_VoiceChatAddChannel final
{
public:
	int32                                         channelToAdd;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatAddChannel;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatCheckRegisteredToChannel
// 0x0008 (0x0008 - 0x0000)
struct UniversalVoiceChat_VoiceChatCheckRegisteredToChannel final
{
public:
	int32                                         channelToCheck;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatCheckRegisteredToChannel;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatEnableShouldHearMyOwnVoice
// 0x0002 (0x0002 - 0x0000)
struct UniversalVoiceChat_VoiceChatEnableShouldHearMyOwnVoice final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatEnableShouldHearMyOwnVoice;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetActorFromPlayerState
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetActorFromPlayerState final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           fromPlayerState;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerVoiceChatActor*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetActorFromPlayerState;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetAudioDevicesList
// 0x0010 (0x0010 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetAudioDevicesList final
{
public:
	TArray<class FString>                         OutDevices;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetAudioDevicesList;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetMicrophoneRuntimeVolumeFromPlayerState
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetMicrophoneRuntimeVolumeFromPlayerState final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           fromPlayerState;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetMicrophoneRuntimeVolumeFromPlayerState;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetMuteAllPlayers
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetMuteAllPlayers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetMuteAllPlayers;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetMyLocalPlayerVoiceChat
// 0x0008 (0x0008 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetMyLocalPlayerVoiceChat final
{
public:
	class APlayerVoiceChatActor*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetMyLocalPlayerVoiceChat;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatHasMicrophonePermission
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatHasMicrophonePermission final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatHasMicrophonePermission;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatInitAudioVoiceChatQuality
// 0x000C (0x000C - 0x0000)
struct UniversalVoiceChat_VoiceChatInitAudioVoiceChatQuality final
{
public:
	int32                                         _sampleRate;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _numChannels;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpusFramePerSec                              _opusFramePerSec;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatInitAudioVoiceChatQuality;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatIsSpeaking
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatIsSpeaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatIsSpeaking;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatLocalIsMutedSomeone
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatLocalIsMutedSomeone final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           playerToCheckMute;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatLocalIsMutedSomeone;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatLocalMuteSomeone
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatLocalMuteSomeone final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           playerToMute;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          shouldMute;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatLocalMuteSomeone;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatRemoveChannel
// 0x0008 (0x0008 - 0x0000)
struct UniversalVoiceChat_VoiceChatRemoveChannel final
{
public:
	int32                                         channelToRemove;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatRemoveChannel;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetAttenuationPath
// 0x0020 (0x0020 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetAttenuationPath final
{
public:
	bool                                          enableAttenuation;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _attenuationPath;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetAttenuationPath;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetDefaultTickRateUpdateLocation
// 0x0004 (0x0004 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetDefaultTickRateUpdateLocation final
{
public:
	float                                         tickRate;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetDefaultTickRateUpdateLocation;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetGlobalVolume
// 0x0004 (0x0004 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetGlobalVolume final
{
public:
	float                                         globalVolume;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetGlobalVolume;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetHardwareAudioInput
// 0x0010 (0x0010 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetHardwareAudioInput final
{
public:
	class FString                                 audioInputDeviceName;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetHardwareAudioInput;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetMicrophoneVolume
// 0x0008 (0x0008 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetMicrophoneVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetMicrophoneVolume;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetMuteAllPlayers
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetMuteAllPlayers final
{
public:
	bool                                          _muteAll;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetMuteAllPlayers;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetPlayerName
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetPlayerName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetPlayerName;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetRawMicrophoneGain
// 0x0004 (0x0004 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetRawMicrophoneGain final
{
public:
	float                                         Gain;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetRawMicrophoneGain;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetSourceChainEffectPath
// 0x0020 (0x0020 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetSourceChainEffectPath final
{
public:
	bool                                          enableSourceChainEffect;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 _pathToSourceChainEffectAsset;                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetSourceChainEffectPath;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetThresholdSendData
// 0x0004 (0x0004 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetThresholdSendData final
{
public:
	float                                         thresholdSendData;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetThresholdSendData;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatStartSpeak
// 0x0014 (0x0014 - 0x0000)
struct UniversalVoiceChat_VoiceChatStartSpeak final
{
public:
	bool                                          _shouldHearMyOwnVoice;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsGlobal;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         radioChannel;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          useProximity;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         maxProximityRange;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatStartSpeak;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatStartSpeakTeamArray
// 0x0028 (0x0028 - 0x0000)
struct UniversalVoiceChat_VoiceChatStartSpeakTeamArray final
{
public:
	bool                                          _shouldHearMyOwnVoice;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsGlobal;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 radioChannel;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          useProximity;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         maxProximityRange;                                 // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatStartSpeakTeamArray;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatStopSpeak
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatStopSpeak final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatStopSpeak;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatUseAndroidCommunicationMode
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatUseAndroidCommunicationMode final
{
public:
	bool                                          use;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatUseAndroidCommunicationMode;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatWasInitAudioVoiceChatQuality
// 0x0001 (0x0001 - 0x0000)
struct UniversalVoiceChat_VoiceChatWasInitAudioVoiceChatQuality final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatWasInitAudioVoiceChatQuality;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatGetSomeoneLocallyMultiplierVolume
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatGetSomeoneLocallyMultiplierVolume final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           playerToOverride;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatGetSomeoneLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetSomeoneLocallyMultiplierVolume
// 0x0018 (0x0018 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetSomeoneLocallyMultiplierVolume final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         multiplierVolume;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           playerToOverride;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalVoiceChat_VoiceChatSetSomeoneLocallyMultiplierVolume;

// Function UniversalVoiceChatPro.UniversalVoiceChat.VoiceChatSetSomeoneOverrideLocallyAttenuationPath
// 0x0028 (0x0028 - 0x0000)
struct UniversalVoiceChat_VoiceChatSetSomeoneOverrideLocallyAttenuationPath final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          enableAttenuation;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overrideLocally;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
