#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water

#include "Basic.hpp"

#include "Water_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Water.BuoyancyComponent.GetLastWaterSurfaceInfo
// 0x0068 (0x0068 - 0x0000)
struct BuoyancyComponent_GetLastWaterSurfaceInfo final
{
public:
	struct FVector                                OutWaterPlaneLocation;                             // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterPlaneNormal;                               // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterSurfacePosition;                           // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWaterDepth;                                     // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutWaterBodyIdx;                                   // 0x004C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterVelocity;                                  // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_GetLastWaterSurfaceInfo;

// Function Water.BuoyancyComponent.OnPontoonEnteredWater
// 0x02D0 (0x02D0 - 0x0000)
struct BuoyancyComponent_OnPontoonEnteredWater final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x02D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_OnPontoonEnteredWater;

// Function Water.BuoyancyComponent.OnPontoonExitedWater
// 0x02D0 (0x02D0 - 0x0000)
struct BuoyancyComponent_OnPontoonExitedWater final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x02D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_OnPontoonExitedWater;

// Function Water.BuoyancyComponent.GetCurrentWaterBodyComponents
// 0x0010 (0x0010 - 0x0000)
struct BuoyancyComponent_GetCurrentWaterBodyComponents final
{
public:
	TArray<class UWaterBodyComponent*>            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_GetCurrentWaterBodyComponents;

// Function Water.BuoyancyComponent.IsInWaterBody
// 0x0001 (0x0001 - 0x0000)
struct BuoyancyComponent_IsInWaterBody final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_IsInWaterBody;

// Function Water.BuoyancyComponent.IsOverlappingWaterBody
// 0x0001 (0x0001 - 0x0000)
struct BuoyancyComponent_IsOverlappingWaterBody final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuoyancyComponent_IsOverlappingWaterBody;

// Function Water.BuoyancyManager.GetBuoyancyComponentManager
// 0x0018 (0x0018 - 0x0000)
struct BuoyancyManager_GetBuoyancyComponentManager final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuoyancyManager*                       Manager;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BuoyancyManager_GetBuoyancyComponentManager;

// Function Water.GerstnerWaterWaveGeneratorBase.GenerateGerstnerWaves
// 0x0010 (0x0010 - 0x0000)
struct GerstnerWaterWaveGeneratorBase_GenerateGerstnerWaves final
{
public:
	TArray<struct FGerstnerWave>                  OutWaves;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GerstnerWaterWaveGeneratorBase_GenerateGerstnerWaves;

// Function Water.NiagaraWaterFunctionLibrary.SetWaterBody
// 0x0020 (0x0020 - 0x0000)
struct NiagaraWaterFunctionLibrary_SetWaterBody final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWaterBody*                             WaterBody;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraWaterFunctionLibrary_SetWaterBody;

// Function Water.NiagaraWaterFunctionLibrary.SetWaterBodyComponent
// 0x0020 (0x0020 - 0x0000)
struct NiagaraWaterFunctionLibrary_SetWaterBodyComponent final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWaterBodyComponent*                    WaterBodyComponent;                                // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NiagaraWaterFunctionLibrary_SetWaterBodyComponent;

// Function Water.WaterBody.GetRiverToLakeTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetRiverToLakeTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetRiverToLakeTransitionMaterialInstance;

// Function Water.WaterBody.GetRiverToOceanTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetRiverToOceanTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetRiverToOceanTransitionMaterialInstance;

// Function Water.WaterBody.GetWaterMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterMaterialInstance;

// Function Water.WaterBody.OnWaterBodyChanged
// 0x0002 (0x0002 - 0x0000)
struct WaterBody_OnWaterBodyChanged final
{
public:
	bool                                          bShapeOrPositionChanged;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeightmapSettingsChanged;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_OnWaterBodyChanged;

// Function Water.WaterBody.SetWaterMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_SetWaterMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_SetWaterMaterial;

// Function Water.WaterBody.SetWaterWaves
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_SetWaterWaves final
{
public:
	class UWaterWavesBase*                        InWaterWaves;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_SetWaterWaves;

// Function Water.WaterBody.GetAudioIntensityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetAudioIntensityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetAudioIntensityAtSplineInputKey;

// Function Water.WaterBody.GetExclusionVolumes
// 0x0010 (0x0010 - 0x0000)
struct WaterBody_GetExclusionVolumes final
{
public:
	TArray<class AWaterBodyExclusionVolume*>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetExclusionVolumes;

// Function Water.WaterBody.GetIslands
// 0x0010 (0x0010 - 0x0000)
struct WaterBody_GetIslands final
{
public:
	TArray<class AWaterBodyIsland*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetIslands;

// Function Water.WaterBody.GetWaterBodyComponent
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterBodyComponent final
{
public:
	class UWaterBodyComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterBodyComponent;

// Function Water.WaterBody.GetWaterBodyType
// 0x0001 (0x0001 - 0x0000)
struct WaterBody_GetWaterBodyType final
{
public:
	EWaterBodyType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterBodyType;

// Function Water.WaterBody.GetWaterSpline
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterSpline final
{
public:
	class UWaterSplineComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterSpline;

// Function Water.WaterBody.GetWaterVelocityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterVelocityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterVelocityAtSplineInputKey;

// Function Water.WaterBody.GetWaterVelocityVectorAtSplineInputKey
// 0x0020 (0x0020 - 0x0000)
struct WaterBody_GetWaterVelocityVectorAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBody_GetWaterVelocityVectorAtSplineInputKey;

// Function Water.WaterBodyComponent.GetRiverToLakeTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetRiverToLakeTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetRiverToLakeTransitionMaterialInstance;

// Function Water.WaterBodyComponent.GetRiverToOceanTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetRiverToOceanTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetRiverToOceanTransitionMaterialInstance;

// Function Water.WaterBodyComponent.GetUnderwaterPostProcessMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetUnderwaterPostProcessMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetUnderwaterPostProcessMaterialInstance;

// Function Water.WaterBodyComponent.GetWaterInfoMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterInfoMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterInfoMaterialInstance;

// Function Water.WaterBodyComponent.GetWaterLODMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterLODMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterLODMaterialInstance;

// Function Water.WaterBodyComponent.GetWaterMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterMaterialInstance;

// Function Water.WaterBodyComponent.GetWaterStaticMeshMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterStaticMeshMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterStaticMeshMaterialInstance;

// Function Water.WaterBodyComponent.OnWaterBodyChanged
// 0x0003 (0x0003 - 0x0000)
struct WaterBodyComponent_OnWaterBodyChanged final
{
public:
	bool                                          bShapeOrPositionChanged;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeightmapSettingsChanged;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUserTriggeredChanged;                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_OnWaterBodyChanged;

// Function Water.WaterBodyComponent.SetAudioIntensityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetAudioIntensityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAudioIntensity;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetAudioIntensityAtSplineInputKey;

// Function Water.WaterBodyComponent.SetUnderwaterPostProcessMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetUnderwaterPostProcessMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetUnderwaterPostProcessMaterial;

// Function Water.WaterBodyComponent.SetWaterAndUnderWaterPostProcessMaterial
// 0x0010 (0x0010 - 0x0000)
struct WaterBodyComponent_SetWaterAndUnderWaterPostProcessMaterial final
{
public:
	class UMaterialInterface*                     InWaterMaterial;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InUnderWaterPostProcessMaterial;                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterAndUnderWaterPostProcessMaterial;

// Function Water.WaterBodyComponent.SetWaterInfoMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetWaterInfoMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterInfoMaterial;

// Function Water.WaterBodyComponent.SetWaterMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetWaterMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterMaterial;

// Function Water.WaterBodyComponent.SetWaterStaticMeshMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetWaterStaticMeshMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterStaticMeshMaterial;

// Function Water.WaterBodyComponent.SetWaterVelocityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_SetWaterVelocityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocity;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterVelocityAtSplineInputKey;

// Function Water.WaterBodyComponent.SetWaterZoneOverride
// 0x0028 (0x0028 - 0x0000)
struct WaterBodyComponent_SetWaterZoneOverride final
{
public:
	TSoftObjectPtr<class AWaterZone>              InWaterZoneOverride;                               // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_SetWaterZoneOverride;

// Function Water.WaterBodyComponent.GetAudioIntensityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetAudioIntensityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetAudioIntensityAtSplineInputKey;

// Function Water.WaterBodyComponent.GetCollisionComponents
// 0x0018 (0x0018 - 0x0000)
struct WaterBodyComponent_GetCollisionComponents final
{
public:
	bool                                          bInOnlyEnabledComponents;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetCollisionComponents;

// Function Water.WaterBodyComponent.GetExclusionVolumes
// 0x0010 (0x0010 - 0x0000)
struct WaterBodyComponent_GetExclusionVolumes final
{
public:
	TArray<class AWaterBodyExclusionVolume*>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetExclusionVolumes;

// Function Water.WaterBodyComponent.GetIslands
// 0x0010 (0x0010 - 0x0000)
struct WaterBodyComponent_GetIslands final
{
public:
	TArray<class AWaterBodyIsland*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetIslands;

// Function Water.WaterBodyComponent.GetMaxWaveHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterBodyComponent_GetMaxWaveHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetMaxWaveHeight;

// Function Water.WaterBodyComponent.GetRiverToLakeTransitionMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetRiverToLakeTransitionMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetRiverToLakeTransitionMaterial;

// Function Water.WaterBodyComponent.GetRiverToOceanTransitionMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetRiverToOceanTransitionMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetRiverToOceanTransitionMaterial;

// Function Water.WaterBodyComponent.GetStandardRenderableComponents
// 0x0010 (0x0010 - 0x0000)
struct WaterBodyComponent_GetStandardRenderableComponents final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetStandardRenderableComponents;

// Function Water.WaterBodyComponent.GetWaterBodyActor
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterBodyActor final
{
public:
	class AWaterBody*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterBodyActor;

// Function Water.WaterBodyComponent.GetWaterMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterMaterial;

// Function Water.WaterBodyComponent.GetWaterSpline
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterSpline final
{
public:
	class UWaterSplineComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterSpline;

// Function Water.WaterBodyComponent.GetWaterSurfaceInfoAtLocation
// 0x0068 (0x0068 - 0x0000)
struct WaterBodyComponent_GetWaterSurfaceInfoAtLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterSurfaceLocation;                           // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterSurfaceNormal;                             // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterVelocity;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWaterDepth;                                     // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeDepth;                                     // 0x0064(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterSurfaceInfoAtLocation;

// Function Water.WaterBodyComponent.GetWaterVelocityAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterVelocityAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterVelocityAtSplineInputKey;

// Function Water.WaterBodyComponent.GetWaterVelocityVectorAtSplineInputKey
// 0x0020 (0x0020 - 0x0000)
struct WaterBodyComponent_GetWaterVelocityVectorAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterVelocityVectorAtSplineInputKey;

// Function Water.WaterBodyComponent.GetWaterWaves
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyComponent_GetWaterWaves final
{
public:
	class UWaterWavesBase*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyComponent_GetWaterWaves;

// Function Water.WaterBodyIsland.GetWaterSpline
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyIsland_GetWaterSpline final
{
public:
	class UWaterSplineComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyIsland_GetWaterSpline;

// Function Water.WaterBodyRiverComponent.SetLakeAndOceanTransitionMaterials
// 0x0010 (0x0010 - 0x0000)
struct WaterBodyRiverComponent_SetLakeAndOceanTransitionMaterials final
{
public:
	class UMaterialInterface*                     InLakeTransition;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InOceanTransition;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_SetLakeAndOceanTransitionMaterials;

// Function Water.WaterBodyRiverComponent.SetLakeTransitionMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_SetLakeTransitionMaterial final
{
public:
	class UMaterialInterface*                     InMat;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_SetLakeTransitionMaterial;

// Function Water.WaterBodyRiverComponent.SetOceanTransitionMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_SetOceanTransitionMaterial final
{
public:
	class UMaterialInterface*                     InMat;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_SetOceanTransitionMaterial;

// Function Water.WaterBodyRiverComponent.SetRiverDepthAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_SetRiverDepthAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDepth;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_SetRiverDepthAtSplineInputKey;

// Function Water.WaterBodyRiverComponent.SetRiverWidthAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_SetRiverWidthAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWidth;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_SetRiverWidthAtSplineInputKey;

// Function Water.WaterBodyRiverComponent.GetRiverDepthAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_GetRiverDepthAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_GetRiverDepthAtSplineInputKey;

// Function Water.WaterBodyRiverComponent.GetRiverWidthAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyRiverComponent_GetRiverWidthAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterBodyRiverComponent_GetRiverWidthAtSplineInputKey;

// Function Water.WaterMeshComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterMeshComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterMeshComponent_IsEnabled;

// Function Water.WaterSubsystem.GetShallowWaterMaxDynamicForces
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterMaxDynamicForces final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetShallowWaterMaxDynamicForces;

// Function Water.WaterSubsystem.GetShallowWaterMaxImpulseForces
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterMaxImpulseForces final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetShallowWaterMaxImpulseForces;

// Function Water.WaterSubsystem.GetShallowWaterSimulationRenderTargetSize
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterSimulationRenderTargetSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetShallowWaterSimulationRenderTargetSize;

// Function Water.WaterSubsystem.PrintToWaterLog
// 0x0018 (0x0018 - 0x0000)
struct WaterSubsystem_PrintToWaterLog final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarning;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WaterSubsystem_PrintToWaterLog;

// Function Water.WaterSubsystem.SetOceanFloodHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_SetOceanFloodHeight final
{
public:
	float                                         InFloodHeight;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_SetOceanFloodHeight;

// Function Water.WaterSubsystem.GetCameraUnderwaterDepth
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetCameraUnderwaterDepth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetCameraUnderwaterDepth;

// Function Water.WaterSubsystem.GetOceanBaseHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanBaseHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetOceanBaseHeight;

// Function Water.WaterSubsystem.GetOceanFloodHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanFloodHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetOceanFloodHeight;

// Function Water.WaterSubsystem.GetOceanTotalHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanTotalHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetOceanTotalHeight;

// Function Water.WaterSubsystem.GetSmoothedWorldTimeSeconds
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetSmoothedWorldTimeSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetSmoothedWorldTimeSeconds;

// Function Water.WaterSubsystem.GetWaterTimeSeconds
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetWaterTimeSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_GetWaterTimeSeconds;

// Function Water.WaterSubsystem.IsShallowWaterSimulationEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsShallowWaterSimulationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_IsShallowWaterSimulationEnabled;

// Function Water.WaterSubsystem.IsUnderwaterPostProcessEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsUnderwaterPostProcessEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_IsUnderwaterPostProcessEnabled;

// Function Water.WaterSubsystem.IsWaterRenderingEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsWaterRenderingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterSubsystem_IsWaterRenderingEnabled;

// Function Water.WaterZone.SetFarMeshMaterial
// 0x0008 (0x0008 - 0x0000)
struct WaterZone_SetFarMeshMaterial final
{
public:
	class UMaterialInterface*                     InFarMaterial;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterZone_SetFarMeshMaterial;

// Function Water.WaterZone.GetWaterZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct WaterZone_GetWaterZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterZone_GetWaterZoneIndex;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
