#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomMapParts

#include "Basic.hpp"

#include "SteamWorkshopMaps_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.SelectUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustomMapParts_C_SelectUpdate final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_SelectUpdate;

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.Request
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CustomMapParts_C_Request final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemId;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0018(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ErrorMessage;                                      // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_Request;

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustomMapParts_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_PreConstruct;

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.OnSuccess_212C9A914520D8F7A114F290F6F7AA59
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CustomMapParts_C_OnSuccess_212C9A914520D8F7A114F290F6F7AA59 final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0010(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ErrorMessage;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_OnSuccess_212C9A914520D8F7A114F290F6F7AA59;

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.OnFailure_212C9A914520D8F7A114F290F6F7AA59
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CustomMapParts_C_OnFailure_212C9A914520D8F7A114F290F6F7AA59 final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0010(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ErrorMessage;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_OnFailure_212C9A914520D8F7A114F290F6F7AA59;

// Function WBP_CustomMapParts.WBP_CustomMapParts_C.ExecuteUbergraph_WBP_CustomMapParts
// 0x0378 (0x0378 - 0x0000)
struct WBP_CustomMapParts_C_ExecuteUbergraph_WBP_CustomMapParts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ItemId_2;                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              K2Node_CustomEvent_Details_2;                      // 0x0038(0x0098)()
	class FString                                 K2Node_CustomEvent_ErrorMessage_2;                 // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ItemId, const struct FSteamWorkshopItemDetails& Details, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate; // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ItemId_1;                       // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              K2Node_CustomEvent_Details_1;                      // 0x0100(0x0098)()
	class FString                                 K2Node_CustomEvent_ErrorMessage_1;                 // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ItemId, const struct FSteamWorkshopItemDetails& Details, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Temp_struct_Variable_2;                            // 0x01C8(0x0098)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0260(0x0010)()
	class FString                                 Temp_string_Variable_1;                            // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USteamWorkshopItemDetailsAsyncAction*   CallFunc_RequestWorkshopItemDetailsAsync_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ItemId;                         // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              K2Node_CustomEvent_Details;                        // 0x02A0(0x0098)()
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0350(0x0010)()
	bool                                          K2Node_CustomEvent_State;                          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0364(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustomMapParts_C_ExecuteUbergraph_WBP_CustomMapParts;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
