#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapContents

#include "Basic.hpp"

#include "SteamWorkshopMaps_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_cLeonMapData_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_MapContents.WBP_MapContents_C.SelectUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapContents_C_SelectUpdate final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MapContents_C_SelectUpdate;

// Function WBP_MapContents.WBP_MapContents_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapContents_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MapContents_C_PreConstruct;

// Function WBP_MapContents.WBP_MapContents_C.OnSuccess_F47348424771535C48E222B9B9CA8A4E
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MapContents_C_OnSuccess_F47348424771535C48E222B9B9CA8A4E final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0010(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ErrorMessage;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MapContents_C_OnSuccess_F47348424771535C48E222B9B9CA8A4E;

// Function WBP_MapContents.WBP_MapContents_C.OnFailure_F47348424771535C48E222B9B9CA8A4E
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MapContents_C_OnFailure_F47348424771535C48E222B9B9CA8A4E final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Details;                                           // 0x0010(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ErrorMessage;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MapContents_C_OnFailure_F47348424771535C48E222B9B9CA8A4E;

// Function WBP_MapContents.WBP_MapContents_C.ExecuteUbergraph_WBP_MapContents
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_MapContents_C_ExecuteUbergraph_WBP_MapContents final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ItemId_1;                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              K2Node_CustomEvent_Details_1;                      // 0x0038(0x0098)()
	class FString                                 K2Node_CustomEvent_ErrorMessage_1;                 // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ItemId, const struct FSteamWorkshopItemDetails& Details, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate; // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ItemId;                         // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              K2Node_CustomEvent_Details;                        // 0x0100(0x0098)()
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ItemId, const struct FSteamWorkshopItemDetails& Details, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemDetails              Temp_struct_Variable_2;                            // 0x01C8(0x0098)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0260(0x0010)()
	class FString                                 Temp_string_Variable_1;                            // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_State;                          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x2];                                      // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0284(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297[0x1];                                      // 0x0297(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamWorkshopItemDetailsAsyncAction*   CallFunc_RequestWorkshopItemDetailsAsync_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MapContents_C_ExecuteUbergraph_WBP_MapContents;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
