#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pause

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UINavigation_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_Pause.WBP_Pause_C
// 0x0048 (0x0538 - 0x04F0)
class UWBP_Pause_C final : public UUINavWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULongTapButton_OnAnimation_C*           LongTapButton_VoiceChat;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULongTapButton_OnAnimation_C*           LongTapButton_Settings;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULongTapButton_OnAnimation_C*           LongTapButton_BackToHome;                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULongTapButton_OnAnimation_C*           LongTapButton_BackGame;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_FirstPersonGameMode_C*              As_BP_First_Person_Game_Mode;                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPGI_Main_C*                           As_BP_UI_Global;                                   // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ReturnEvent;                                       // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnReturn();
	void OnInitialized();
	void OnDestroySessionComplete_E73CF3A14099BA1780F00197E2D8169E(class FName SessionName, bool bWasSuccessful);
	void OnCallFailed_E73CF3A14099BA1780F00197E2D8169E(class FName SessionName, bool bWasSuccessful);
	class UUINavComponent* GetInitialFocusComponent();
	void ExecuteUbergraph_WBP_Pause(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_Pause_LongTapButton_VoiceChat_K2Node_ComponentBoundEvent_0_PushEnd__DelegateSignature();
	void BndEvt__WBP_Pause_LongTapButton_Settings_K2Node_ComponentBoundEvent_5_PushEnd__DelegateSignature();
	void BndEvt__WBP_Pause_LongTapButton_BackToHome_K2Node_ComponentBoundEvent_4_PushEnd__DelegateSignature();
	void BndEvt__WBP_Pause_LongTapButton_BackGame_K2Node_ComponentBoundEvent_3_PushEnd__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Pause_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Pause_C")
	}
	static class UWBP_Pause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Pause_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Pause_C;

SDK_NAMESPACE_END
