#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NavSlider_Penguin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UINavigation_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_NavSlider_Penguin.WBP_NavSlider_Penguin_C
// 0x0030 (0x09E0 - 0x09B0)
class UWBP_NavSlider_Penguin_C final : public UUINavSlider
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             configItem_text_1;                                 // 0x09B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BarPenguin;                                        // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowValueText;                                     // 0x09C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x7];                                      // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(double Value)>  OnValueChangeEvery;                                // 0x09D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetValueText(const class FText& InText);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void ExecuteUbergraph_WBP_NavSlider_Penguin(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_NavSlider_Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_NavSlider_Penguin_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_NavSlider_Penguin_C")
	}
	static class UWBP_NavSlider_Penguin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NavSlider_Penguin_C>();
	}
};
DUMPER7_ASSERTS_UWBP_NavSlider_Penguin_C;

SDK_NAMESPACE_END
