#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_cLeonToggleSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_cLeonToggleSwitch.WBP_cLeonToggleSwitch_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_cLeonToggleSwitch_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_KeyImage_C*                        WBP_KeyImage_11;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleOff;                                         // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleState;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Button_Name;                                       // 0x035C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetToggleState(bool ToggleState);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void ExecuteUbergraph_WBP_cLeonToggleSwitch(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_cLeonToggleSwitch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_cLeonToggleSwitch_C")
	}
	static class UWBP_cLeonToggleSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_cLeonToggleSwitch_C>();
	}
};
DUMPER7_ASSERTS_UWBP_cLeonToggleSwitch_C;

SDK_NAMESPACE_END
