#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReportTypeButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_ReportTypeButton.WBP_ReportTypeButton_C.SelectStateUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_ReportTypeButton_C_SelectStateUpdate final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ReportTypeButton_C_SelectStateUpdate;

// Function WBP_ReportTypeButton.WBP_ReportTypeButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ReportTypeButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ReportTypeButton_C_PreConstruct;

// Function WBP_ReportTypeButton.WBP_ReportTypeButton_C.ExecuteUbergraph_WBP_ReportTypeButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_ReportTypeButton_C_ExecuteUbergraph_WBP_ReportTypeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_State;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ReportTypeButton_C_ExecuteUbergraph_WBP_ReportTypeButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
