#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSlots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ItemSlots.WBP_ItemSlots_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_ItemSlots_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_62;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SlotCount;                                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Item_C*>                    Slots;                                             // 0x0358(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CurrentSelectIndex;                                // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateSlotStackData(int32 TargetIndex, int32 StackCount);
	void UpdateSlotData(int32 TargetIndex, const struct FCPP_GameItemData& ItemData);
	void UpdateSelectSlot(const int32 Index_0);
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void GetCurrentItemData(struct FCPP_GameItemData* ItemData);
	void ExecuteUbergraph_WBP_ItemSlots(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ItemSlots_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ItemSlots_C")
	}
	static class UWBP_ItemSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemSlots_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ItemSlots_C;

SDK_NAMESPACE_END
