#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_announcement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_announcement.WBP_announcement_C
// 0x0030 (0x0370 - 0x0340)
class UWBP_announcement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MainText;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Middle;                                            // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void SetText(const class FText& Text, int32 Index_0);
	void SetColor(const struct FLinearColor& Color, int32 Index_0);
	void RemoveWidget();
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void PlayAnimationMessage(bool IsForward, int32 Index_0);
	void ExecuteUbergraph_WBP_announcement(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_announcement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_announcement_C")
	}
	static class UWBP_announcement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_announcement_C>();
	}
};
DUMPER7_ASSERTS_UWBP_announcement_C;

SDK_NAMESPACE_END
