#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UnderGuage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_UnderGuage.WBP_UnderGuage_C.SetWidth
// 0x0018 (0x0018 - 0x0000)
struct WBP_UnderGuage_C_SetWidth final
{
public:
	double                                        Desired_Size_X;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UnderGuage_C_SetWidth;

// Function WBP_UnderGuage.WBP_UnderGuage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UnderGuage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UnderGuage_C_PreConstruct;

// Function WBP_UnderGuage.WBP_UnderGuage_C.ExecuteUbergraph_WBP_UnderGuage
// 0x0008 (0x0008 - 0x0000)
struct WBP_UnderGuage_C_ExecuteUbergraph_WBP_UnderGuage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UnderGuage_C_ExecuteUbergraph_WBP_UnderGuage;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
