#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NavOptionBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UINavigation_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_NavOptionBox.WBP_NavOptionBox_C
// 0x0060 (0x09E0 - 0x0980)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UWBP_NavOptionBox_C : public UUINavOptionBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NavOptionUnderBox_C*               WBP_NavOptionUnderBox;                             // 0x0988(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UnderBox;                                          // 0x0990(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_133;                                         // 0x0998(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_76;                                          // 0x09A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CompressOptionTexts;                               // 0x09A8(0x0010)(Edit, BlueprintVisible)
	TArray<class UWBP_NavOptionUnderBox_C*>       ChildNavWidgets;                                   // 0x09B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FText>                           AppendTargetTexts;                                 // 0x09C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateUnderBoxColor();
	void UpdateOptions();
	void PreConstruct(bool IsDesignTime_PreConstruct);
	void OnChangedValue();
	void ExecuteUbergraph_WBP_NavOptionBox(int32 EntryPoint);
	void Construct();
	void AddUnderBars();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_NavOptionBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_NavOptionBox_C")
	}
	static class UWBP_NavOptionBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NavOptionBox_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UWBP_NavOptionBox_C;

SDK_NAMESPACE_END
