#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExitShopCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ExitShopCount.WBP_ExitShopCount_C
// 0x0040 (0x0380 - 0x0340)
class UWBP_ExitShopCount_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             SubText;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class FText                                   PresetText;                                        // 0x0370(0x0010)(Edit, BlueprintVisible)

public:
	void SetUIText(int32 AppendPreset, const class FText& Text);
	void SetText(const class FText& Text, int32 Index_0);
	void SetColor(const struct FLinearColor& Color, int32 Index_0);
	void PlayAnimationMessage(bool IsForward, int32 Index_0);
	void ExecuteUbergraph_WBP_ExitShopCount(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ExitShopCount_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ExitShopCount_C")
	}
	static class UWBP_ExitShopCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExitShopCount_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ExitShopCount_C;

SDK_NAMESPACE_END
