#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CompressTextBlock

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_CompressTextBlock.WBP_CompressTextBlock_C.UpdateTextIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_CompressTextBlock_C_UpdateTextIndex final
{
public:
	int32                                         CompressedTextIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CompressTextBlock_C_UpdateTextIndex;

// Function WBP_CompressTextBlock.WBP_CompressTextBlock_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_CompressTextBlock_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_CompressTextBlock_C_SetText;

// Function WBP_CompressTextBlock.WBP_CompressTextBlock_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CompressTextBlock_C_PreConstruct final
{
public:
	bool                                          IsDesignTime_PreConstruct;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CompressTextBlock_C_PreConstruct;

// Function WBP_CompressTextBlock.WBP_CompressTextBlock_C.ExecuteUbergraph_WBP_CompressTextBlock
// 0x0058 (0x0058 - 0x0000)
struct WBP_CompressTextBlock_C_ExecuteUbergraph_WBP_CompressTextBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_SplitText_ReturnValue;                    // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0030(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
	int32                                         K2Node_CustomEvent_CompressedTextIndex;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CompressTextBlock_C_ExecuteUbergraph_WBP_CompressTextBlock;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
